[
    {
        "review": "ReviewTest drove the Veloce as there has been much praises for it.\n\n1st look, either you like it or you hate the looks. To me it's a pretty nice looking car, would say speical especially the front grill.\n\nInterior is somewhat disappointing when compare to the competition. Pretty tight door opening, a bit of a squeeze to get into the driver seat,interior is also pretty squeezy at the back. Dash board design looks pretty simple and unsophisticated. Lots of plastics in use. The center display screen size is pretty small for this era of cars.\n\nIt packs some standard safety features.\n\nDespite the smaller interior, dated looks, the car's reputation is saved by its engine and the drive. The 2litre engine is powerful and responsive even at standard mode, the hand,info is good with 50/50 weight distribution. Turned on sports mode, it turned into a beast. Engine response is increase, acceleration is superb.\n\nI like the shift paddles, big and nice, was told it's similar to Ferrari's. When you tap in both shifters, the gear changes to Neutral, another tap inthe right paddle shifts the gear into drive, pretty neat.\n\nThe reverse camera resolution could be improved along with ththe screen size, its looks pretty small compare to other conti cars.\n\nIn terms of engine and the drive, it's comaprable to the new bmw 3 series, I would dare say more responsive as I don't feel any turbo lag.",
        "user_name": "Wasteland",
        "car_name": "Alfa Romeo Giulia",
        "brand": "Alfa+Romeo",
        "price": "$175,000 "
    },
    {
        "review": "What I like- powerful engine\n- fast acceleration\n- good stability \n- good paddle shifters\n- driver seat will auto shift back when you off the engine and open the door to facilitate easy exiting, not sure will it do the reverse",
        "user_name": "EuroNcap",
        "car_name": "Alfa Romeo Giulia",
        "brand": "Alfa+Romeo",
        "price": "$175,000 "
    },
    {
        "review": "What I do not like- small interior\n- dated dash board, it need to improve in order to change catch up with its competition \n- No auto hold\n- Small center display screen",
        "user_name": "AlainDupuis",
        "car_name": "Alfa Romeo Giulia",
        "brand": "Alfa+Romeo",
        "price": "$175,000 "
    },
    {
        "review": "ReviewTest driven this sometime ago, kinda overdue as this model is discontinued.\n\nBut I feel it should be made known as its a good model not to be missed while waiting for the next model to be in.\n\nAt its previous Teban Gardens showroom where they are moving to Leng Kee soon, the moment I saw the car, my 1st word is SLEEK though I do notice on the roads but not many.\n\nInside is plain simple still where according to SE, as its facelifted model is sometime Q4 2017.\n\nLet's go to the drive...The start of the engine literately roars into life when you key start it.\n\nDriving off is a WHOOSH and the test route is on AYE which can try out the best of this car.\n\nHitting on the accelerator and you can feel the turbo kicks in by the feel as well as there is a turbo meter showing it. Impressed !\n\nCornering is superb for this chap as well despite its wide hatch body.\n\nBraking is superb which is paired with Brembo brakes.\n\nOverall, its a good car to have but do wait for the facelift releasing soon.",
        "user_name": "Mervynwm",
        "car_name": "Alfa Romeo Giulietta",
        "brand": "Alfa+Romeo",
        "price": "$159,000 "
    },
    {
        "review": "What I likePower drive\nResponsive Brembo brakes\nNo Turbo Lag when you need it",
        "user_name": "MichaelKoh",
        "car_name": "Alfa Romeo Giulietta",
        "brand": "Alfa+Romeo",
        "price": "$159,000 "
    },
    {
        "review": "What I do not likeNothing much as wait for the facelift model to see its new changes.",
        "user_name": "wiscpenn",
        "car_name": "Alfa Romeo Giulietta",
        "brand": "Alfa+Romeo",
        "price": "$159,000 "
    },
    {
        "review": "ReviewUnder the radar gem. Striking design and styling without the excessive price tag. Definitely a top consideration for those looking for cars in the $100-120k range.",
        "user_name": "Chinalim",
        "car_name": "Alfa Romeo Giulietta",
        "brand": "Alfa+Romeo",
        "price": "$159,000 "
    }
]