[
    {
        "car_name": "Alpine A110",
        "brand": "Alpine",
        "price": "$238,800 "
    },
    {
        "car_name": "Aston Martin DB11",
        "brand": "Aston+Martin",
        "price": "POA"
    },
    {
        "car_name": "Aston Martin Vantage",
        "brand": "Aston+Martin",
        "price": "$699,000 "
    },
    {
        "car_name": "Aston Martin DB11(Parallel Imported)",
        "brand": "Aston+Martin",
        "price": "$643,000"
    },
    {
        "car_name": "Aston Martin V12 DBS Superleggera",
        "brand": "Aston+Martin",
        "price": "POA"
    },
    {
        "car_name": "Aston Martin DB11 Volante",
        "brand": "Aston+Martin",
        "price": "$849,000 "
    },
    {
        "user_name": "josephannnn",
        "review": "ReviewBought the 2019 facelift edition, whose interior is so much better than the 2018 one. Looks much more upscale as compared to last year. More chrome, and interior lighting that's classy rather than striking. \n\nThe A4 beats everyone in its class when u compare its price. Significantly cheaper than the C class and 3 series, considering u get a 2.0T engine. Its fuel economy/power ratio hands down leaves the japanese counterparts in the dust too, like mazda, toyota. \n\nThe drive is very calm and composed, for a 2.0 turbocharged engine, cruising at 1200RPM constantly: explains the fuel efficiency. Sports mode is very toned down, only keeping RPM at 2000, which is very weird andl doesn't maximise the car's potential. Paddle shifters are a must to use, if you want to maximise the car's power. No worries though, as it can overtake any car in traffic in a breeze, without even hitting 3000rpm, with its 320NM powerband from 1200rpm to 4000rpm. \n\nThe A4 is very under-provided for, for an Audi. Horrific 16 inch rims, no memory seat for a family sedan, virtual cockpit is not stock. The audi drive select is completely fake, comfort mode is redundant, no adaptive dampers or air suspensions means they can't really improve ride comfort. Dynamic mode makes the steering artificially heavy, instead of responsive with high feedback.",
        "car_name": "Audi A4 Sedan",
        "brand": "Audi",
        "price": "$188,016 "
    },
    {
        "user_name": "Bernardongg",
        "review": "ReviewDecided on the A3 as my first car due to its price point. Got it at 110K at suntec roadshow in July. Have clocked 1000KM and liking it so far, especially the fuel consumption. I really liked the colour combination of dark blue exterior with dark brown leather seats. I was given the apple carplay option but didnt want it as i honestly don't think its that useful. Ive tried it on other Jap car and sometimes it doesnt even charge the phone. I can just connect to the audio using bluetooth which is good enough for me.",
        "car_name": "Audi A3 Sedan",
        "brand": "Audi",
        "price": "$136,460 "
    },
    {
        "user_name": "DariusLim_195334",
        "review": "ReviewBought my white Audi Q2 1.4 turbo TFSI engine last month and it appeared to be one of the best decisions I've made. Traded in my 5 year old BMW 5 series for this and to be very honest, I was initially concerned with the space. I owned a Mini Cooper and 3 series before this. The Q2 of course cannot be compared to the cabin space of a 5 series. But I wanted something fun and zippy to drive. Something with power that looks great on the road and at the same time fun to drive without being a fuel guzzler. Reviewing this from my experience, I'd say the Q2 has the best of both worlds of both the trendiness of the Mini Cooper and the moderness and style of an Audi. It's simply the most fun car I've driven! Superb handling on the roads. Interior cabin is kept simple so if you're looking for something techy and elaborate then you might consider the highest end model. Fuel economy is one to beat. This week I drove 179km on just one bar (out of 8 bars) of petrol. Full tank about $90. \n\nLove the exterior daytime headlights as well as the interior mood lighting that allows you to play with lights (just like my old mini). Not to mention the fantastic sound system made by B&O. Fits 4 comfortably. 5 would be a squeeze. Good enough for me if you're mostly a solo driver like me. \n\nAll in all, if you're looking for a stylish yet fun car from a renowned brand that ticks all the right boxes and will not burn a huge hole in your pocket, the Q2 is the one for you.",
        "car_name": "Audi Q2",
        "brand": "Audi",
        "price": "$140,776 "
    },
    {
        "user_name": "Lotr",
        "review": "ReviewReally like this stylish car as its sportback profile sets it apart from the rest of the SUVs/MPVs/sedans\n\nDuring the test drive, felt that the engine and gearbox was really smooth and acceleration from stop is a breeze.  The interior is the typical high quality Audi fare (ie. A4 and above) and makes me feel special in the driver seat\n\nCabin is also very well insulated as I hardly hear any noise on the move. \n\nCar is practical too as the boot opens up with the rear glass which gives easy access.",
        "car_name": "Audi A5 Sportback",
        "brand": "Audi",
        "price": "$204,900 "
    },
    {
        "car_name": "Audi Q3",
        "brand": "Audi",
        "price": "$168,800 "
    },
    {
        "user_name": "Mervynwm",
        "review": "ReviewTest driven this new A6 last weekend. Must say it's Astonishing indeed. \n\nFirst looks is the impressive lights at the front and rear as well as the curves of its new design body, though you may have to look carefully to notice the curves. \n\nInside is a brand new interior compared to the previous generation where no more budge out ugly screens, making it look odd looking. Now is all totally flushed in console, making it a luxury feel in it. Great mind thoughts finally. \n\nThe gadgets are great to have in all like the virtual 360 degree revolving camera, enhanced virtual cockpit, full touch screen console with handwriting recognition capability, and much more to your astonishment. \n\nA pity that no variant comes with panaromic sunroof where you need to pay as option. \n\nThe drive is great as it comes with more power, less drag, 7 speed wet clutch gearbox (not the problematic dry clutch), more horses too. \n\nGearshifts are a Breeze and power delivery is certainly better than its predecessor, and in stoppages is not jerked at. Is a gradual stop with almost to no feel of it. Has heads up display too.\n\nPassenger at the back does experience a comfort feel as during my test drive, an Uncle followed too and too comfortable drive, even at dynamic mode, he almost fell asleep.\n\nOnly thing didn't ask if it comes with any park assist or so to try on. \n\nOverall, it's an improved A6 if you see it and for its drive, gadgets and best of all, its new refined interior with all nicely flushed in, thus giving it a high end luxury feeling.\n\nIt's kinda worth considering if you have a deep pocket of $240k (as of 9 September 2019).",
        "car_name": "Audi A6 Sedan Mild Hybrid",
        "brand": "Audi",
        "price": "$242,500 "
    },
    {
        "car_name": "Audi RS5 Sportback",
        "brand": "Audi",
        "price": "$387,000 "
    },
    {
        "user_name": "vbchia",
        "review": "ReviewGot my new car 26 December 2014 from Premium Auto. It's been three months, so far here are my findings;\n\n1. Having driven VW/Skoda cars before, in comparison, the Audi feels much better put together, quality materials, insulation, road presence and confidence it gives.\n2. Noise insulation is superb except for the tyre noise caused by the sports derivative tyres that came with the car. Perhaps it should be shod with Bridgestone Turanza series instead?\n3. After doing 2500km, the 1.4 TFSI starts to feel more lively. When new from the showroom, it was a bit lazy from take off but when at speed, especially if the rpm is from 1500, the take off for overtaking is noticeable.\n4. Noticed a lag below 1200 rpm or from stand still, there was a slight hesitation when you floor the pedal when you move off. In comparison to my previous Skoda Octavia 1.4 TFSI, the difference is stark (although I had a remap done which gave it 150 bhp and about 250nm of torque from 1750rpm). That skoda, you can feel the G-force pressing against you. In the A3, hardly noticeable. \n5. Fuel consumption is somewhat better than the Octavia. 12.5km/l mixed. Up to 18/19km/l on the highway, quite close to the published 20km/l.\n6. Features wise, it has all the bells and whistles that one can hope for, although a navigation system would have been welcomed, it's not very expansive nowadays. I'm not really into installing after market.\n7. Advice for those who wants to do a remap, all the ports have been sealed and breaking those seals would void warranty. I'd wait for the car to pass the warranty period before considering it.\n8. Space wise, it a lot more spacious now with the MQB platform and longer wheelbase compared to my MK 5 Octavia. \n\nAll in all I'm happy with the purchase and would recommend anyone who is considering it.",
        "car_name": "Audi A3 Sportback",
        "brand": "Audi",
        "price": "$134,250 "
    },
    {
        "review": "ReviewHaving driven the previous Q5 for nearly 6 years, it was time to let it go for fear of further maintenance costs. Having made countless trips to the Ubi service centre, each time I left the car there for something to be fixed or replaced, I vowed not to return again to Audi. Perhaps not everyone can appreciate the reasoning, but there are always brand loyalists and good reasons for their existence. \n\nClearly, there are many alternatives within the SUV class and beyond. In the process, all continental SUVs were considered, as well as cars such as Skoda Superb. On the Japanese side, there was Lexus, Toyota, Honda and Mazda and their various models to choose from. \n\nPerhaps you have to watch the video 'What does it take for a car to be an Audi\" To know what I rnean. An Audi is just a bit more special than the rest in the same price range. Of all the 4WD available, quattro just seems most natural. The interior, virtual cockpit and the MMI exude class. \n\nSo why back to Audi? Perhaps it's the customer service. Perhaps the quality just stands out a bit more. Everything works well in symphony within the car. I wouldn't necessarily recommend this car to just anyone. But ultimately it was difficult to choose anything else to replace my previous Q5. And the clincher? A really good deal offered to me was too hard to resist. Cheers!",
        "car_name": "Audi Q5",
        "brand": "Audi",
        "price": "$241,200 "
    },
    {
        "user_name": "BMWX1",
        "review": "ReviewQ3 is easy to drive. Test drove this car few months ago and noticed the ride is smooth and fast despite its small engine. Kids commented it's a \"Floating\" Car. We like this car but the overall package offered by audi somehow was not as competitive as BMW.",
        "car_name": "Audi Q3(Parallel Imported)",
        "brand": "Audi",
        "price": "$165,000"
    },
    {
        "car_name": "Audi Q8",
        "brand": "Audi",
        "price": "$379,300 "
    },
    {
        "user_name": "Nivlek96",
        "review": "ReviewThe Audi Q7 is arguably the best 7 seater premium SUV in the market now. It is comfortable and looks really good. Handling and engine performance are good too. While the car is rather large, it rides and drives like a normal car with good acceleration in Sports Mode. Reliability could be one of Audi's weaker aspects with several friends switching from Audi to Mercedes. Price is slightly high too but with Premium Automobile's warranty support, the peace of mind could be worth it.",
        "car_name": "Audi Q7",
        "brand": "Audi",
        "price": "$307,800 "
    },
    {
        "car_name": "Audi Q7(Parallel Imported)",
        "brand": "Audi",
        "price": "$256,000"
    },
    {
        "user_name": "Edminski",
        "review": "ReviewThe Virtual Cockpit is too amazing, have never seen this before and this really excites me.\n\nTest drove it, the interior looks as spacious as the A6 and I love the sporty front bonnet. \n\nVery powerful drive, you will love it at first sight and keep thinking of it thereafter.",
        "car_name": "Audi A5 Coupe",
        "brand": "Audi",
        "price": "$209,600 "
    },
    {
        "car_name": "Audi A7 Sportback",
        "brand": "Audi",
        "price": "$380,500 "
    },
    {
        "car_name": "Bentley Bentayga F1 Auto Cars Edition(Parallel Imported)",
        "brand": "Bentley",
        "price": "$743,900"
    },
    {
        "car_name": "Bentley Bentayga(Parallel Imported)",
        "brand": "Bentley",
        "price": "$730,000"
    },
    {
        "car_name": "Bentley Flying Spur(Parallel Imported)",
        "brand": "Bentley",
        "price": "$660,000"
    },
    {
        "car_name": "Bentley Continental GT",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "car_name": "Bentley Continental GT(Parallel Imported)",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "car_name": "Bentley Mulsanne(Parallel Imported)",
        "brand": "Bentley",
        "price": "$1,190,000"
    },
    {
        "car_name": "Bentley Bentayga",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "car_name": "Bentley Flying Spur",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "car_name": "Bentley Continental GT Convertible(Parallel Imported)",
        "brand": "Bentley",
        "price": "$810,000"
    },
    {
        "car_name": "Bentley Mulsanne",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "car_name": "Bentley Bentayga Diesel",
        "brand": "Bentley",
        "price": "POA"
    },
    {
        "user_name": "A_patche",
        "review": "ReviewBought this last year, loving it! The features are minimal but that makes it easy to drive. Engine is more than powerful enough for Singapore driving. Size is just nice, not too small (no bullying on the road) or too big (difficult to park!). Interior is soooo spacious, unlike Mercedes GLA.",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "user_name": "Pomchatchat",
        "review": "ReviewDecided to ditch the SUV gig after nines years and decided on the G20 after a test drive. Driving position is perfect, although I needed to get used to being so low on the ground. The torque from the engine is very surprising.\n\nI feel the car exterior is a head-turner. Size is slightly longer than my previous XC60! Interior-wise, can't compare to the new gen Mercs, but I feel it's less distracting. Let's you concentrate more on driving and the roads, than Merc's twin screens that almost feel like you're playing a video game.\n\nSeat comfort can't compare to Volvo. But the G20 has lots of interesting vehicle safety features too.\n\nOpted for the Luxury line in mineral grey. M Sport was a little too low and stiff for these old bones.",
        "car_name": "BMW 3 Series Sedan",
        "brand": "BMW",
        "price": "$209,888 "
    },
    {
        "review": "ReviewDriven multiple affortable conti cars before (with each mileage ranging form 10k km to 100k km) - A-class, CLA, A3, 320i, X1, m140i, Astra, Insignia and Discovery Sport. Had also driven some Japanese cars. \n\nOwned this baby beemer for 3 years, clocked 100km, unmodded. Other than the normal servicing, there is no problem. Doors gave ratting sounds initially. \n\nWhen alone, this baby beemer provides drivers the usual bmw fun drive and stability. It is possible to do sharp turns at 60km/hr without drifting or losing control (not much body roll). At low mileage, when taking off at traffic light, this car feels slow and sluggish. After owning for a period of time, the car gets faster when moving off (at around 2000rpm), usually the first few cars, leaving the others behind. The steering is responsive, sharp and gives good feedback. All the above are driven in comfortable mode. Though most cars allow drivers to drive aggressively, not all cars are fun to drive. Driver seat is fairly comfortable but not the best in the same category. \n\nWhen with family, the car allows the driver to drive 'less fun', providing more comfort to passengers. The suspension absorbs well but not the best in small car category. Due to run flat, road noise are noticeable. The cabin is well isolated, however, when rev-ing with open windows, the rattling sound is noticeable. Breaking gives better control and less jerky than some of bmw competitors. The interior are more than sufficient for small families (inclusive of kids and elders). Able to put chicco nextfit child seat in rear seats with 2 more passengers in car (front passenger height ranges from 1.60+m to 1.70+m with sufficient legroom, knee not touching the glove compartment). The boot is adequate for small family. Had transported many DIY furniture's. Even though many sedans have 40:20:40 rear seats setup, this baby beemer has the additional height and height entrance for its boot. \n\nFuel consumptions are pretty good, ranging from 14+km/l (80 city drive-20 highway) to 18+km/l (80 highway-20 city; Based on Google map). Tried once to kl, Malaysia, with fuel consumption of 20.5km/l. Competitive fuel cost.\n\nDriven a m140i on autobahn. Even though it is impressive to own a m140i in Singapore, having a 100% Down payment for non-m140i is quite impressive too.",
        "car_name": "BMW 1 Series Hatchback",
        "brand": "BMW",
        "price": "$151,888 "
    },
    {
        "user_name": "brocks",
        "review": "ReviewThis is my daily driver and I simply love it.\n\nThe quality of the interior is much better than its competitors, with soft touch materials on almost every surface, and the interior design closely resembling that of the 7 series. Idrive 6.0 is also much easier to use, along with the epic 360 degree camera system, gesture control, and the convenient BMW connected drive app. The display key also makes it stand out from its competitors as it is unique and it tells you useful information about the car.\n\nThe styling of the car is modern and very handsome (looks more elegant and stately with the Luxury Line, and it looks more sporty and aggressive with the M sport trim.) However, the rear can resemble the previous generation F10 from a distance away due to the similarly shaped 'L' tail lights and silhouette. But overall BMW did a fantastic job updating the car's styling and giving it a very modern look. I found the F10 looking quite dated when next to the G30 on the road.\n\nThe car is extremely compliant over bumps and has just the right amount of firmness for a slightly sporty drive, yet it still manages to be comfortable.\nPower delivery from the 2L I4 engine is great, as the high torque figures help with acceleration and the engine is also very refined.\n\nGear changes are smooth and barely noticeable in automatic mode, the ZF 8 speed gearbox is fantastic.",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewMy friend let me drive his X3, At first it didnt look very sexy. Nothing much but then the autotailgate with the foot sensor makes loading things into the boot when your hands are busy. The 360 degree camera which i could view from the hand phone app was amazing i can see who is parked beside the car etc. \n\nyou could also start the car with your apple watch! Handling of the car was smooth. The turn felt comfortable with no sliding. It was so smooth that i was not paying attention to the speed and i was already over the speed limit.\n\nI know its the luck of the draw, i heard this car has aircon problem.",
        "car_name": "BMW X3",
        "brand": "BMW",
        "price": "$218,888 "
    },
    {
        "car_name": "BMW 7 Series",
        "brand": "BMW",
        "price": "$409,888 "
    },
    {
        "car_name": "BMW 3 Series Sedan(Parallel Imported)",
        "brand": "BMW",
        "price": "$191,000"
    },
    {
        "user_name": "Chivanloh",
        "review": "ReviewTest drove the 2 series GT. Was surprised that the car has adequate torque from moving off. However towards the 80kmh speed onwards, the \"Power\" Soon fizzle out. Was contemplating of changing existing wish to this 2GT as they are both 7 seaters.",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "car_name": "BMW 5 Series Sedan(Parallel Imported)",
        "brand": "BMW",
        "price": "$206,000"
    },
    {
        "user_name": "DdCarReviewerSG",
        "review": "ReviewCollected this car last week and have been using this car to get from home to suntec city or even northpoint city. So far, enjoying the drive.",
        "car_name": "BMW 4 Series Gran Coupe",
        "brand": "BMW",
        "price": "$203,888 "
    },
    {
        "review": "ReviewOverall design to me it looks like a blown up version of the 1er\n\nDuring test drive I can feel the power of this X2 sDrive 20i\n\nAt least it is not underpowered \n\nM Sports Steering is nice and sharp \n\nM suspension is not too hard too",
        "car_name": "BMW X2",
        "brand": "BMW",
        "price": "$174,888 "
    },
    {
        "user_name": "CarbonFalcon",
        "review": "ReviewFor years I've had nothing but MPVs. They serve the family really well despite the last row not being used 80% Of the time. Of course back in the office amidst minted successful bachelors, I stood out as a sore thumb with such MPV heritage. Certainly even a cheap MX-5 was more useful in scoring a hot date than a 7 seater. And having \"Plenty of space backseat\" Was never a good pickup line.\n\nAfter buying the 2 series, I bust into office proclaiming “I’Ve just bought a BMW!” – And imagined myself with Deal-with-it shades smoking a joint. Colleagues gawked wondering “How could a die-hard practical MPV fanatic succumb to an expensive brand that doesn't just bomb the bank, but has a dreadful maintenance fallout.” \n\nWhen you look at the Active Tourer sideways, it was part hideous, part Touran-wannabe and resembled the new Kia Carens. Although an oddball and easily called ugly, the BMW logo turns it into Ron Jeremy rather than a typical fat guy that nobody wanted. Owning this felt like I had suddenly become Dwayne Johnson and could get away with sporting a fanny pack. Even my old MPV pickup line was no longer creepy. Those (hot dates) who were not really into cars didn’T really care. It was still a BMW and I'd score.\n\nJealous co-workers swag posing by the coffee machine and the heartbroken MX-5 guy whose hot date dumped him for a handsome half-Thai with an old BMW Z4 start to voice out - “Ah here comes the guy with the fake BMW”. True enough – This was a FWD BMW in Singapore and it feels nothing like the other BMWs in terms of driving dynamics. Nevertheless, the generous space from thin ergonomic seats, rear air-con, loads of features like the hands-free tailgate opening and BMW connected drive meant I lose none of the MPV practicality I enjoy which they don’T. \n\nOverall, I could comfortably skip the “Rich boy” Bird of paradise show and still fit amidst the glimmering bachelors in the company. Light on the wallet, big on practicality and perhaps comparable to a car with a “Dad bod”, this BMW is a beautifully honest machine. Despite all my focus on securing hot dates, if this odd MPV were to be my date, this would be the one I’D propose to.",
        "car_name": "BMW 2 Series Active Tourer",
        "brand": "BMW",
        "price": "$144,888 "
    },
    {
        "car_name": "BMW X7",
        "brand": "BMW",
        "price": "$452,888 "
    },
    {
        "review": "ReviewTest drove this when it first came to our shores sometime back but yet to launch at that time, where not able to write review here as its stated as pending launch or so until now. My bad.\n\nFirst looks from outside, is small WOW, large car with large exterior but not much changes to its curves and blends.\n\nInside of the interior, is a bigger WOW factor as interior posh has up-marketed from the posh BMW that you see usually.\n\nBoot space is indeed large and with full 7 seats, the 3rd row is pretty comfortable for an adult to sit in.\n\nThe tailgate is DUAL where flips top and also the bottom, perfect for back seat enjoyment and it has a feature button to lower the car when open the lower portion. \n\nBuilt on a new platform and design, the dated buttons here and there have radically changed and comes with multi touch screens where the conventional conti car turnable knob for headlights has changed to button controls too.\n\nThe drive off comes with a whopping 3.0L 300 plus BHP that steers you off instantly. Gear changes is a breeze for this 8 speeder and intense throttle you get the power you need anytime.\n\nComes with many features from active display, active driving assistance suite, surround sensors and many more.\n\nBottom line, if you have a stretchable budget of S$300k to spare and needed space, this is what you should get for its engaging drive (where others cannot seem to be able to test drive like the GLE or a heftier price like the Range Rover).",
        "car_name": "BMW X5",
        "brand": "BMW",
        "price": "$343,888 "
    },
    {
        "car_name": "BMW Z4",
        "brand": "BMW",
        "price": "$263,888 "
    }
]