[
    {
        "review": "ReviewBought this last year, loving it! The features are minimal but that makes it easy to drive. Engine is more than powerful enough for Singapore driving. Size is just nice, not too small (no bullying on the road) or too big (difficult to park!). Interior is soooo spacious, unlike Mercedes GLA.",
        "user_name": "A_patche",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I like- Spacious interior\n- Simple and classy design (will not be outdated over time)",
        "user_name": "Mervynwm",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I do not like- Unfortunately no Apple OS (small thing really)",
        "user_name": "Inlinefour",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "ReviewTest drive this small suv from BMW sometime back, from its first looks, a typical suv look whereas it's immediate sibling,the X2, who shares the same 3 cylinder engine is a sportier exterior look.\n\nInterior was a dated design when it's told as a latest look. Dun recall seeing a sunroof or a moonroof. The rest let's not go there.\n\nThe drive off is not that smooth, perhaps due to 3 cylinder engine capabilities only and a FWD. And Underpowered too.\n\nOverall, if you are a BMW and suv lover but due to Budget constrain, then can consider this.",
        "user_name": "leecheesiong",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I likeNot much",
        "user_name": "baml2010",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I do not likeNo electric tailgate\n3 cylinder fwd\nUnderpowered \nNoisy when revved\nPrice",
        "user_name": "suvdriveps",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "ReviewLCI version looks much nicer than the last gen one\n\nRims are better looking too\n\nAuto kick boot is very practical for shopping of groceries \n\nSteering is light and sharp\n\nDriver has to very good view around car...Very safe with not much blind spot\n\nEngine power is not too bad although it is FWD",
        "user_name": "champ88",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I likeiDrive 6 touchscreen\n\nTouch iDrive Knob\n\nPull handles for folding seats\n\nAuto Tailgate\n\nSpacious Seats",
        "user_name": "GGTT",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I do not likeDoors are very light\n\nSensatec Leather Dash no luxury feel\n\nCabin sound insulation not so good",
        "user_name": "Maxkiah",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "ReviewX1 offers distinctly BMW-like driving fun. Responsive steering and a firm ride make tossing it around Singapore roads a joy. The 2.0-liter turbo four-cylinder makes 192 hp with the front through an eight-speed automatic which the reason for my purchase for 2L model\n\nInfotainment display and Bluetooth is standard with nav and is very user friendly. The front and rear compartment that surprises and delights me and can easily accommodate 5 adult passengers comfortably. This car ride higher than before, with a better view of their surroundings thanks to the X1’s sensible beltline.",
        "user_name": "BMWX1",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "What I like1) Passenger cabin space is great. Rear headroom and legroom is close to 2017 X3\n2) Distinctly BMW-like driving fun\n3) Excellent steering wheel system providing great driving experience\n4) Good boot storage space with and without storage extension\n5) Sporty exterior SUV design and practical cabin for family daily usage \n6) Ambient lighting make the car feel luxury",
        "user_name": "Richard_8289",
        "car_name": "BMW X1",
        "brand": "BMW",
        "price": "$171,888 "
    },
    {
        "review": "ReviewDecided to ditch the SUV gig after nines years and decided on the G20 after a test drive. Driving position is perfect, although I needed to get used to being so low on the ground. The torque from the engine is very surprising.\n\nI feel the car exterior is a head-turner. Size is slightly longer than my previous XC60! Interior-wise, can't compare to the new gen Mercs, but I feel it's less distracting. Let's you concentrate more on driving and the roads, than Merc's twin screens that almost feel like you're playing a video game.\n\nSeat comfort can't compare to Volvo. But the G20 has lots of interesting vehicle safety features too.\n\nOpted for the Luxury line in mineral grey. M Sport was a little too low and stiff for these old bones.",
        "user_name": "Pomchatchat",
        "car_name": "BMW 3 Series Sedan",
        "brand": "BMW",
        "price": "$209,888 "
    },
    {
        "review": "What I like- crazy acceleration\n- digital card key\n- back row legroom\n- driving position\n- adaptive drive modes\n- connectivity on iDrive 7.0\n- LED interior mood lighting\n- quiet cabin\n- decent stock in car entertainment",
        "user_name": "Wasteland",
        "car_name": "BMW 3 Series Sedan",
        "brand": "BMW",
        "price": "$209,888 "
    },
    {
        "review": "ReviewThis is my daily driver and I simply love it.\n\nThe quality of the interior is much better than its competitors, with soft touch materials on almost every surface, and the interior design closely resembling that of the 7 series. Idrive 6.0 is also much easier to use, along with the epic 360 degree camera system, gesture control, and the convenient BMW connected drive app. The display key also makes it stand out from its competitors as it is unique and it tells you useful information about the car.\n\nThe styling of the car is modern and very handsome (looks more elegant and stately with the Luxury Line, and it looks more sporty and aggressive with the M sport trim.) However, the rear can resemble the previous generation F10 from a distance away due to the similarly shaped 'L' tail lights and silhouette. But overall BMW did a fantastic job updating the car's styling and giving it a very modern look. I found the F10 looking quite dated when next to the G30 on the road.\n\nThe car is extremely compliant over bumps and has just the right amount of firmness for a slightly sporty drive, yet it still manages to be comfortable.\nPower delivery from the 2L I4 engine is great, as the high torque figures help with acceleration and the engine is also very refined.\n\nGear changes are smooth and barely noticeable in automatic mode, the ZF 8 speed gearbox is fantastic.",
        "user_name": "brocks",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I likeTechnology \n\nAppearance \n\nTranmission\n\nRefined 2L I4",
        "user_name": "Wasteland",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I do not likePrices are steep, so PI might be more popular for some people\n\nRear might look like an F10 from a distance away",
        "user_name": "bo rui",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewTest drove the 530i, it's a very capable car with very good stability, comfort, quietness and power.\n\nI am especially impressed by the quiet drive and the power it excerts when you need it for lane mergering and over taking.",
        "user_name": "feliciaaa",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I like-Spacious\n- exterior looks very nice\n- interior finishing is good\n- powerful engine\n- 360 full camera for easier parking\n- soft closing\n- seat belt will tighten after fastening",
        "user_name": "Rronnie",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I do not like-Reliability of BMW, well known for issues and high cost of repairs \n- Fat profit margins for BMW Asia and PML\n- PML post service support capability",
        "user_name": "edmundho22",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewThis car is a highly capable executive saloon that's sportier than a Mercedes E-Class and comes with more high-tech features compared to its rivals such as Audi A6.  In conclusion, the 5 Series offers a better mix of practicality, efficiency, comfort and techy features than almost any other saloon on the market",
        "user_name": "VinW",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I likeThe smart exterior styling can also be seen in its cabin. It does not seem as elegant as an E-Class' magnificent interior but everything feels plush, solid and upmarket although the only cheap plastics are found deep in the door bins.\n\nFrom the very comfortable driver's seat you can easily reach all the key controls and BMW's latest iDrive infotainment system really is the best in the business. It comes with satellite-navigation as standard and now sports a second digital display for the driver instead of old-fashioned dials.\n\nIt's quick and easy to navigate your way through its numerous menus using the knob on the centre console, and you can also use voice and gesture control features. The latter might be a bit gimmicky but overall the system itself is far easier to use than what you'll get in either an E-Class or A6.\n\nThere's loads of headroom in the front and enough seat adjustment for six-footers to get comfortable. Unfortunately, lumbar support for the driver and passenger will set you back £225, even on top-spec cars.\n\nSpace in the back is nearly as generous as in the front. Your passengers get a decent amount of headroom and plenty of knee and legroom - even for tall people. There's more shoulder room for carrying three abreast than you'll find in an E-Class but the BMW's rather hard, raised middle seat and huge lump in the floor mean the Mercedes will still be more comfortable with three in the back.\n\nAlthough it's a big car, the BMW 5 Series is easy to drive. You get a surprisingly good view out through its large windows",
        "user_name": "Destiny_Benyhaha",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I do not likeThere isn't a hint of cost-cutting anywhere in the BMW 5 Series' smart, businesslike cabin but it can't match the E-Class's interior for outright desirability\n\nThe only annoying blind spot is where the windscreen meets the front door.",
        "user_name": "asiaroadwarrior",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewBest car i ever owned . The boot is spacious and the handling is prefect.. . It never disappoint for someone who likes speed",
        "user_name": "AaronMing",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "What I likethe stability is more than words",
        "user_name": "stockkid81",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewWhile there is nothing wrong with the car itself, the price that PML is charging for a 2L entry level 5-series is outrageous.  While it has been rebranded as 530, the engine is no more powerful than the 528 it replaces. \nthere is a 60% Premium over the basic cost of the car. And in times of falling COE, I believe that there is a big disparity between the price paid and the \"Car\" Itself. \nHaving said that, it seems be the trend nowadays.  The big boys are all charging 60-70% Premium over the basic cost.  Don't believe me, check the pricing sheet for yourself.",
        "user_name": "Wolfverine",
        "car_name": "BMW 5 Series Sedan",
        "brand": "BMW",
        "price": "$246,888 "
    },
    {
        "review": "ReviewTest drove the 2 series GT. Was surprised that the car has adequate torque from moving off. However towards the 80kmh speed onwards, the \"Power\" Soon fizzle out. Was contemplating of changing existing wish to this 2GT as they are both 7 seaters.",
        "user_name": "Chivanloh",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "What I likeIt's a BMW. Drive nicely. Good for city driving.",
        "user_name": "Budgetdriver",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "What I do not likeThe 3 row is more suitable for children\n\nNot able to attain \"high speed\"",
        "user_name": "MarkerPen",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "ReviewI believe the AD brought in this engine to keep the price competitive in line with the new VES changes. However, I just could not convince myself to accept the 107hp engine. \n\nThe engine delivers good useful torque from idle and feels like a 2L engine. Very good for short spurts of acceleration lasting 1 or 2 seconds. But past 4000 rpms, the acceleration tapers off quickly as the power limited engine gives up torque for rpm. From this point it is all downhill. The torque even lower than a 1.5L bread butter sedan, but dragging a 1.5ton body.\n\nShift up to the next gear and you lose even more acceleration. Better to accept to decreasing torque and shift up later. There is nothing you can do by now. If you're not done overtaking or accelerating by this point, it is better to give up. \n\nEven with the new dual clutch gearbox it still takes almost 12s to reach 100kph. \n\nIf you are a gentle driver that drives at low revs all the time, looking for a \"Branded\" Car with some practicality, this is the ideal car for you. This is almost the lowest price you can get to own a BMW here, especially during promotions, so do look out for them.",
        "user_name": "Kelrecis",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "What I likeLow body roll\nSupple ride\nVery smooth gear changes\nPracticality\nInterior features\nActive safety features\nRelatively well priced\nCAT A COE",
        "user_name": "Bkaalu",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "What I do not likeRestrictive warranty (even original brand rim changes not allowed)\nUnacceptable engine",
        "user_name": "Madmax67",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "ReviewMy mother in law was looking at the 7-seater Honda CR-V Turbo which cost around $152k back in Apr 2018. I advised her to take a look at the BMW 216i Gran Tourer too as it was about the same price.\n\nLong story short, she preferred the BMW over the CR-V Turbo for obvious reasons : Firstly, who can resist the BMW badge. Secondly, the BMW had more advanced features. Thirdly, build quality of the BMW was significantly better than the CR-V with better insulation. \n\nOther things included a higher OMV, better resale value, more comprehensive warranty and servicing package. \n\nI took it out for a test drive and despite only having 109bhp, the car drove very nicely. With sufficient power for overtaking, easily better than a standard 1.6L NA car. The car cruised nicely along the NSHW to Genting Highlands too, maintaining a steady 150km/h without breaking a sweat despite the 1.5L 3-cylinder turbo engine. It then carried a full load of 7 adults up and down Genting Highlands without incident.\n\nIf you have preconceptions about a small displacement turbo engine being inadequate to power an MPV, I urge you to take this car for a spin.",
        "user_name": "Jeff07",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "What I like- Vault-like build quality; solid doors, high quality interior with soft-touch plastics\n- efficient 3 cylinder turbo engine with a strong 200Nm of torque\n- smooth Aisin 6-spd automatic transmission\n- good insulation\n- good value for a BMW, let alone a 7 seater MPV",
        "user_name": "opgamerkkhk",
        "car_name": "BMW 2 Series Gran Tourer",
        "brand": "BMW",
        "price": "$150,888 "
    },
    {
        "review": "ReviewCollected this car last week and have been using this car to get from home to suntec city or even northpoint city. So far, enjoying the drive.",
        "user_name": "DdCarReviewerSG",
        "car_name": "BMW 4 Series Gran Coupe",
        "brand": "BMW",
        "price": "$203,888 "
    },
    {
        "review": "What I likeDesign of the car\nLegroom\nPaddle Shifters\nNice dashboard",
        "user_name": "opgamerkkhk",
        "car_name": "BMW 4 Series Gran Coupe",
        "brand": "BMW",
        "price": "$203,888 "
    },
    {
        "review": "What I do not likeWrecking my brain real hard but cant really find anything.",
        "user_name": "Inlinefour",
        "car_name": "BMW 4 Series Gran Coupe",
        "brand": "BMW",
        "price": "$203,888 "
    },
    {
        "review": "ReviewTest drove this alongside A5. Smaller interior, inferior interior quality, lacklustre engine compared to A5 quattro and higher price if compared spec for spec.",
        "user_name": "nizmo89",
        "car_name": "BMW 4 Series Gran Coupe",
        "brand": "BMW",
        "price": "$203,888 "
    },
    {
        "review": "ReviewFor years I've had nothing but MPVs. They serve the family really well despite the last row not being used 80% Of the time. Of course back in the office amidst minted successful bachelors, I stood out as a sore thumb with such MPV heritage. Certainly even a cheap MX-5 was more useful in scoring a hot date than a 7 seater. And having \"Plenty of space backseat\" Was never a good pickup line.\n\nAfter buying the 2 series, I bust into office proclaiming “I’Ve just bought a BMW!” – And imagined myself with Deal-with-it shades smoking a joint. Colleagues gawked wondering “How could a die-hard practical MPV fanatic succumb to an expensive brand that doesn't just bomb the bank, but has a dreadful maintenance fallout.” \n\nWhen you look at the Active Tourer sideways, it was part hideous, part Touran-wannabe and resembled the new Kia Carens. Although an oddball and easily called ugly, the BMW logo turns it into Ron Jeremy rather than a typical fat guy that nobody wanted. Owning this felt like I had suddenly become Dwayne Johnson and could get away with sporting a fanny pack. Even my old MPV pickup line was no longer creepy. Those (hot dates) who were not really into cars didn’T really care. It was still a BMW and I'd score.\n\nJealous co-workers swag posing by the coffee machine and the heartbroken MX-5 guy whose hot date dumped him for a handsome half-Thai with an old BMW Z4 start to voice out - “Ah here comes the guy with the fake BMW”. True enough – This was a FWD BMW in Singapore and it feels nothing like the other BMWs in terms of driving dynamics. Nevertheless, the generous space from thin ergonomic seats, rear air-con, loads of features like the hands-free tailgate opening and BMW connected drive meant I lose none of the MPV practicality I enjoy which they don’T. \n\nOverall, I could comfortably skip the “Rich boy” Bird of paradise show and still fit amidst the glimmering bachelors in the company. Light on the wallet, big on practicality and perhaps comparable to a car with a “Dad bod”, this BMW is a beautifully honest machine. Despite all my focus on securing hot dates, if this odd MPV were to be my date, this would be the one I’D propose to.",
        "user_name": "CarbonFalcon",
        "car_name": "BMW 2 Series Active Tourer",
        "brand": "BMW",
        "price": "$144,888 "
    },
    {
        "review": "What I likeThe 1.5 diesel engine is awesome.\n\nSport mode made the MPV extremely twitchy and joyful to ride – although the FWD aspect was obvious at this point. \n\n1000km on a full tank (which cost $70) – retardedly awesome. \n\nServicing is cheap since it is front wheel drive - lot less components, complexity.",
        "user_name": "Jjchsg",
        "car_name": "BMW 2 Series Active Tourer",
        "brand": "BMW",
        "price": "$144,888 "
    },
    {
        "review": "What I do not likeI didn’t get the Grand Tourer which had 7 seats as it costs way more. 20% 3rd row seat utilization for 25k wasn’t worth it. \n\nSome Active Tourers seem larger than mine. Not sure why the difference. PM can't explain.\n\nRoad Tax is higher for diesel cars\n\nCan't pump in Malaysia since their Diesel is Euro 3/4. Have to pump in Singapore before going up North.\n\nNo more rear seat trays as they were cited to be safety issues.\n\nNot sure what to use the speed limiter for. Would have preferred cruise control",
        "user_name": "dtkw",
        "car_name": "BMW 2 Series Active Tourer",
        "brand": "BMW",
        "price": "$144,888 "
    },
    {
        "review": "ReviewI had my 218i Active Tourer for about 6 weeks. The car is a good balance on space, power, handling and fuel consumption. \nSpace - good headroom and knee room.  Good space in the trunk.  There is a hidden compartment under the trunk floor that you can store misc items.  Many small pocket of storage space around the car such as door bin, arm rest, under the front seat chair\nPower & Handling - I drive mostly in Eco Pro mode.  Even in Eco Pro mode, you can get good acceleration if you press hard on the throttle. The low end torque of the car is good and accelerate from start is quick.  I haven't really use the sport mode yet as my car is still in run-in period.  Handling is sharp and stable.  Steering is a bit heavy but suits me well.  Brake has good response and stop the car quickly.\nFuel Consumption - in my normal route back & forth to office, I can get about 13-14 km/l.  The car has start/stop and in Eco Pro mode, coast when you lift the throttle.  It is amazing how far it can coast.",
        "user_name": "Tay86",
        "car_name": "BMW 2 Series Active Tourer",
        "brand": "BMW",
        "price": "$144,888 "
    }
]