[
    {
        "review": "ReviewTest drove this small and compact designing SUV.\n\nExterior looks simply feels that you can be known of having a fashionable taste (as its after all design by French).\n\nBasic features (of course you cannot par against like DS7 as its a more luxury one), but this comes as a compact SUV range where those into fashion, looks than features should be enticed by it.\n\nInterior is pretty basic but does comes with some features such as the usual touch screen in 8 inches where the selling point was its comfortable seats (known to me by Sales as memory foam seats) which is great to sit on probably when you drive long distances. Also comes with digital cockpit too.\n\nDriving it was pretty ok at NORMAL mode, did not try SPORTS mode as after all its not meant to be one. I must say, having deviated from conventional suspensions to hydraulics one (which mostly found in trucks), its a definite a GO for when I was told to \"Dash\" Across humps and seriously you DO NOT feel a thing, unlike even those high SUVs that I have driven before where you tend to feel sometimes.\n\nOverall, its a compact SUV to look and get if you are into fashionable taste (minus its performance as its a daily car only) and for some its features that you can find against other brands where you need to top up or totally do not come with it, then C5 is the one.",
        "user_name": "Mervynwm",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I likeThe basics in a SUV.\nFashionable Design.\nMemory foaming seats.\nComfortable ride (as due to its hydraulic suspension from conventional ones).\nBlind Spot Assist.\nDigital cockpit.",
        "user_name": "theory_87",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I do not likeNo sunroof or moonroof.\nElectric tailgate (cannot remember seen or not).\nSmall glovebox.",
        "user_name": "Garycks",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "ReviewJust test drove the new C5 Aircross on Sunday. The car really surprise me. Granted that the cabin material may not be the best. I hate the interior hard plastic door panel. Also the infotainment system is not the best and the lack of physical control for aircon controls is irritating. Where the car surprise me is the moment the door is close. The door closing sound is solid, much better sounding then my C5 X7 and the car is very well insulated from outside world just like the old C5 X7. So far I only find Lexus GS, LS, Mercedes S-Class and Audi A8L quieter than my C5 X7. The new foam in the seats is also very comfy. The moment I started driving off, the way the suspension react very much remind me of Hydractive3+. Under hard acceleration, the car pick up quickly enough for me and the engine noise remain very well suppress. At this price, I doubt there is any car more comfortable than C5 Aircross. The Peugeot 3008 and DS7 just feels hard riding and noisy in comparison. If you got the time, you should go and test drive C5 Aircross.",
        "user_name": "SYSCAR",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I like- Comfortable Suspension\n- Comfortable Seat\n- Powerful Engine\n- Very Good sound insulation\n- Refine drive train\n- Carplay and Android Auto\n- Customisable Digital Speedometer\n- The three individual rear seats",
        "user_name": "coralviper",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I do not like- No physical button for Aircon\n- Hard plastic at the interior door panel\n- Infotainment System can be slow\n- The fake vents\n- The rear seats can be wider\n- Lack of electric seat for passenger, no memory seat for driver and no massaging function (C&C did not indent these features)\n- The lack of LED headlights (Citroen did not make it for RHD market)\n- Small glovebox (Citroen did not relocate the fuses during the LHD to RHD conversion)",
        "user_name": "stevektm",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "ReviewFamily friendly with good driver experience.\nMany nice features.\nGood for long drives and family outings.",
        "user_name": "Jaspertgx",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I likeDriver console experience\nSpacious rear seats\nFunky designs all around\nHuge boot space",
        "user_name": "subarus",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I do not likeAuto tailgate optional",
        "user_name": "dea939",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "ReviewThe exterior design is very citroen and thats what it attracted me to drop by and test drive the car. As i am into fashion, so will expect the car to match me too :p\n\nDid not know it was a 1.6cc car until the sales told me. However the drive is good and power enough, should be the 180Hp and the 8 speed.\nThe seats uses leather cum fabric which I find very interesting and nice to sit on.\nThe interior design is nice and cool with the 12\" Screen. \nSurely value for money car, got to convince my wife now",
        "user_name": "Reywalnimz",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I like1. The exterior design that is a different SUV design from the market\n2. The supposed high density form seats.\n3. The suspension (forget what they use here)\n4. The drive and torque\n5. The interior space and leg room as I am 1.83cm tall\n6. The warranty and free 3 years road tax \n7 The low depre for this car",
        "user_name": "sashimi_7780",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I do not likei guess it will be good to have a powered rear boot for this SUV?",
        "user_name": "jackkwongkm",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "ReviewTrue to Citroen Suspension , truly comfortable and so so plush ... \n\nA good balance of sublime yet subtle touches inside and out as a competitive crossover. Also a fun drive with the responsive steering. Well rounded for the stop go traffic during rush hour or the long run on the express way home.\n\n It runs surprisingly zippy and smooth transmission. Reliable torque coverter Aisin Seiki gearbox, i expect trouble free for many years. \n\nvery spacious boot. The interior trim is stylish/conti without trying too hard to impress  . Although Brown leather would be nice too.\n\nVery good noise insulations, gives a run to those brands priced much much higher.\n\nConti handling and suspension with Jap/Korean price , Win win",
        "user_name": "Terry49",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I likegood pick up and Plush suspension, very quiet , very good noise insulation",
        "user_name": "furprice_extra",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "What I do not likeRims are too big, however its a big car\nNo power rear boot",
        "user_name": "SiminWei",
        "car_name": "Citroen C5 Aircross",
        "brand": "Citroen",
        "price": "$131,999 "
    },
    {
        "review": "ReviewTested this car a while back.\n\n1st impression: The engine is smoother than what I have expected. Although it has 110 horsepower with a century sprint timing of 11.8s on paper, it feel faster than that when I am driving it, probably due to the relatively high amount of torque available (250Nm to be exact).\n\nThe only let down is the 6 speed auto gearbox, which seems a little undecided when downshifting, thus generating a slight vibration when slowing down at junction.\n\nSteering feel is average, with some level of feel back felt, but slightly too light for highway driving and enjoyment. Noise insulation is above average, from compact crossover perspective.\n\nAlthough all the part are well put together, the choice of material could be better. Overall, the plastics used on the door panel, dash board, and even roof lining, etc felt hollow, and cheapen the car. It lack the \"Conti feel\" So to speak.\n\nSpace wise, the head room is respectable at both the front and 2nd row, but leg room is lacking in the rear. Given the 2,604mm wheelbase advertised, I am expecting more, honestly.\n\nOverall, it is still a fun car to be in, if you need much space, and can get past the choice of plastics in the cabin.",
        "user_name": "Carbon82",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "What I like- The lively engine\n- The well cushioned ride\n- The ride height (and compact dimension)",
        "user_name": "MJKoh",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "What I do not like- Not so well tuned 6 speed gearbox\n- Hollow plastics cheapen the car\n- Lack of leg space in the rear",
        "user_name": "Jazrien1708",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "ReviewLiving in Singapore can be a bit hectic, expensive yet boring at the same time. Sometimes we just want to get to where we need to in comfort and style without worrying about our bank account.\n\nEnter the Citroen C3 Aircross. This French mini SUV exudes \"Je ne sais quoi\", combining classy and quirky styling that remains fresh and interesting both inside and out. The turbocharged 1.2L engine provides the same torque as a 2.0L with zero lag, yet returns the same economy as a frugal compact. 40% city/60% highway gets well over 14km/l regularly, stellar for an SUV.\n\nThe super light power-steering can make you feel disconnected from the road at first, but once you get the hang of it, the car becomes a breeze to drive. The high riding position and large windows give great all round visibility. Combined with its compact frame and driver assists such as reverse camera and hill-start, it nips through crowded roads and navigates tight carparks with ease. \n\nDon't let the compact silhouette fool you though. Inside, there's class leading 410L boot space that can fit luggage for 5 adults, and still leaves ample room for them in front. The back seats 3 comfortably even for long journeys, and everyone will have loads of head and leg room regardless. I'm 6ft1 (185cm) and I have spare leg room in the back even with the driver seat set to my position. The glove box may be a little small due to the fuse box position for right hand drive, and there's no center storage, but the cubbies and door bins are decent sized. It all feels spacious and relaxing.\n\nThe 7 inch infotainment screen comes with DVB radio and Bluetooth as standard, and you can opt for the higher Shine trim to add satnav, Apple Carplay/Android Auto and wireless charging. This also gets you keyless engine start and exterior colour accents. But if you can do without these extras, the standard Feel trim will do just fine with LED daytime running headlights, steering wheel controls, automatic wipers and reverse parking sensors in the mix.\n\nAll this for less than 100k. 5 star EuroNCAP safety rating and 5 year Cycle&Carriage warranty and servicing package further add to the value. If money is no object, you should be looking elsewhere. But if 'big car feel-small car price' is what you're after, look no further.",
        "user_name": "JohnnyTJX82",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "ReviewI was looking for a new car to upgrade from my ancient Swift. But for very long, I just didn't feel happy looking at the small cars (hatchbacks) on the market. It just felt like I would be in for much the same. So when I came across this, I knew that I found what I was looking for! Been 3 months since I've been driving it now and I simply must say that the C3 Aircross is a great entry into the world of SUVs. It's got the bold feel to it, more importantly, the drive is surprisingly powerful. I like the color options as it suits my lifestyle. The interior is also modern and a quirky design element. Love taking long drives around in this. Love it.",
        "user_name": "Tedlim09",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "What I likeVery modern dashboard\nStylish color packs \nApple CarPlay",
        "user_name": "boykicksball16",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "What I do not likeNo sunroof",
        "user_name": "briankohjk",
        "car_name": "Citroen C3 Aircross",
        "brand": "Citroen",
        "price": "$98,999 "
    },
    {
        "review": "ReviewI am the owner of the Grand Spacetourer petrol 1.2L EAT8 variant. \n\nWhen I went for a test drive with my whole family (3 generations) and we were all impressed by how graceful the car rev even with full load of 5 adults one kid in the car on just a 1.2L. Compared to my previous 1.6L car, it certainly impresses and performed better. \n\nInterior wise we are all happy with the finishing and how easy the seats fold down flat to accommodate our big family. Everyone is comfortable and have enough leg space in all 3 rows. When compared across MPVs, this is one of the rare ones that offer aircon vents for the middle and 3rd row as well. \n\nWith questions going off non stop from the young to the old, my SE JOHNSON Soh took time and was patient to explain to everyone, even though he have to do a few repeats. We were all happy with his non pushy attitiude and service so we placed an order on the same day.\nAfter sales service was good as well. JOHNSON was always responsive to my question and took extra effort on his side to manage my timelines and facilitate the paperwork. Do look for him at Citroen showroom!",
        "user_name": "Xtacee",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I likeSpacious 7 seater\nExterior design not as boxy as other MPV\nEasy to drive and park\nIntuitive touchscreen panel\nAircon vents for 2nd and 3rd row\n2nd row with 3 individual seats - child seats friendly\nSmooth transition across gears in auto mode\nBig windscreen",
        "user_name": "mrs",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I do not likeSmall Storage drawers and compartments\nNo memory seat\nNo moon/sun roof option",
        "user_name": "6269",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "ReviewShortlisted a few cars within the MPV segment for the past year. This makes the most sense in terms of comfort, assesibility to back row and space. Served by a sincere lady named Cleo who wasn't pushy and patient to let me decide. This car kinds of sells itself once you get behind wheel.",
        "user_name": "pauline_k",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I likeSpace\nComfort",
        "user_name": "JohnnyTeo29",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I do not likeUnnecessary feature like the massage seats for front seats. Could have made it optional with a reduction in price.\nNo blind spot detector and monochromatic mirror.",
        "user_name": "ZRC77",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "ReviewMost family friendly, comfortable and fuel efficient MPV. Superior suspension. Cool LED daytime running lights. 2nd and 3rd row air-con. Longest wheelbase in its class. Spacious in rows 2 and 3.",
        "user_name": "spho1",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "ReviewThe new grand C4 Space Tourer look spacious. The interior design look comfortable. Especially the 3rd row seat more room for the legs. I was served by a helpful sales consultant Cleo Teo.",
        "user_name": "alexljw12",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I likeThe design of the car",
        "user_name": "bengkl",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I do not likeThe driver seats doesn't come with auto adjustment.",
        "user_name": "Jeremy_tan_141",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "ReviewJust bought the Grand C4 SpaceTourer last month and it's been a comfortable experience. So we just shifted into a 4 room HDB as my wife and I are expecting again. So with my parents and a helper, I thought we should move to a bigger car too! And this is just right! I love the spaciousness, and it's got great practical touches too. The height of windscreen is amazing too, when you compare to other continental cars. More importantly, the seats are comfortable and flexible so that we can fit the whole family plus travel luggages for our road trips to Malaysia! Weekend grocery shopping is now made easy with the hands free electric tailgate for greater convenience when you have yoru hands full. Foldable seats at the 2nd row optimises the space when we need to transport bulky buys at Ikea.",
        "user_name": "CharlesTan_216536",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I like1. Very convenient hands-free electric tailgate.\n2. Flexible seats.\n3. Spaciousness.",
        "user_name": "DWD",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I do not likeNothing, as of now :)",
        "user_name": "opgamerkkhk",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "ReviewHad been searching a MPV for the family since 3 months ago. After much researched we decided to shortlist GrandC4 Spacetourer, Touran and Prius+. After all the test drives we narrow down to GC4 Spacetourer and Touran. As our current ride is Toyota Wish, after test driving Prius+ feel that it is nothing better than our current ride. When we test drive with 6 of us the car seems to be lack of power. The plastic interior also turn us off. After a second round of test drive with Spacetourer and Touran, we felt that 3rd rowl seating for Touran is not as comfortable as Spacetourer and we are uncertain of the DSG gearbox. We decided Spacetourer will be our family car for the next ride. My kids loves the 3rd row blower and the charging point. My wife love the hands-free tail gate and the apple Carplay. Although it is just a 1.2L, with the whole family + my parents this car really surprise us. Pick up is good as well as road handling.Gear changes are smooth too. Hope this car will serve as well for the next few years. Good Luck!",
        "user_name": "NeoBoonChing",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    },
    {
        "review": "What I likeRoad handling\n3rd row blower\nhands-free tailgate\nlight steering\nComfort",
        "user_name": "Jaho",
        "car_name": "Citroen Grand C4 SpaceTourer",
        "brand": "Citroen",
        "price": "$122,999 "
    }
]