[
    {
        "review": "ReviewTest driven the Grand Chic 180PS version as was told by SalesPerson the only difference between 180PS and 225PS not just the horsepower, but only feel it when you drive in SPORTS mode, otherwise almost the same.\n\nThe exterior was indeed eye catching as per the title where knowingly French are always known to be artistic when it comes to design. Unlock the car from the front, you see a 180 degrees turning crystal like lights to welcome you and the back lights of spikiness entice you for the looks too.\n\nThis version I tested comes with panoramic sunroof but is a limited batch where likely next batches might not come with it, so for those liked the sunroof do check out before you sign.\n\nInterior, a great French design when it comes to minor details from the display clock to the buttons. Space is adequate for a conventional 5 seats SUV which you will be enchanted by its interior comparing to other makes as after all its design by the French.\n\nDrive...In Normal mode, its a smooth move off but you do hear gear changes locking up even its a 8 Speed but in Comfort, you feel that you are almost floating while cruising.\n\nDuring the drive, tried the Adaptive Cruise Control (ACC) at designated speed which at the cockpit, you see Lane Departure works as dual lines showing your car in lane and will swerve back when out of lane. As for ACC, it has a car picture showing you the actual car in front and does braking when close up, just a mere tap and it goes off by itself in ACC again which gradually to get reach to its defined speed.\n\nOverall, for its smooth ride plus its designing looks to both exterior and interior, its certainly be an unique as well as an eye catching vehicle when you are on the road in this.",
        "user_name": "Mervynwm",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I likeAdaptive Cruise Control (ACC).\nLane departure assist (with ACC in use).\nBlind Spot Assist.\nComfortable suspension (where it smoothed the ride along).\nFull digital cockpit or to many known as Active Digital Display or Virtual Cockpit.\nFuturistic Welcome lights when unlock car.\nComfortable drive (in Comfort and Normal modes), did not try Sports mode.\nElectric Tailgate.\nBoth front are electric seats.",
        "user_name": "Gabdat",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I do not likePrice tag of S$ 173k (as at 8th June 2019) for 180PS.\nFor $20k additional to get the 225PS not into it for some.\nPanoramic Sunroof option is limited, subjected to availability.\nSmall glovebox.",
        "user_name": "Lotr",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "ReviewTest drove this latest DS model yesterday at C&C. It has been some time since we tested a french car. Especially an SUV.",
        "user_name": "RayNg_217040",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I like-Elegant & bold design\n-Powerful 1.6 turbo charged engine\n-Comes with all the safety tech as standard\n-Diamond rotating headlights\n-Comfortable and massage-enabled front seats\n-Rear reclining seats\n-Full panoramic roof\n-Reliable Lexus 8 speed gear box. Probably the only reliable part of the car\n-Way too expensive",
        "user_name": "shuaigeai69",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I do not like-Infotainment screen needs a genius to master\n-Too many sub menus \n-No physical button for auto start/stop. Can only be turned off from the screen. Tedious!\n-Not as insulated as expected\n-Adaptive Cruise Control stock feels cheap and confusing\n-Too many disruptive icons pop up while driving\n-Engine designed by PSA. Something will eventually screw up",
        "user_name": "dldl888",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "ReviewLocal reviews have been positive for this car but there is a reason why we see so few of these OTR. \n\nC&C is asking for a lot for this car. \n\nPricing needs to be more realistic if they want to win customers",
        "user_name": "Xrayyokomo",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I likeEngine performance, the seats (memory, cooled and massage)",
        "user_name": "SYSCAR",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I do not likeHandling, the cheap plastic used for the cruise control, PRICE",
        "user_name": "Diligent",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "ReviewDuring the recent Vivocity roadshow2019, i am attracted by the DS7 performance line design and the taillight ,the salesman arranged for me to test drive on thatday which i cannot as i am not free on that day,the salesman then arrange with me and wife a test drive at the leng kee showroom.\nDuring the test drive, i must say i am impressed by the comfort level,the car handled humps and corners very well.\ni made the booking after the test drive.My wife also like the mulit-climate at the 2nd row and also the ample leg room.\nIt was only at the showroom, i saw the poster on french presidential car DS7.\ni ask the salesman, he told me that dS7 is made for presidential car in France.\nWow, i am so lucky to own a presidential car",
        "user_name": "Stan2004",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    },
    {
        "review": "What I like-3D tail light\n-comfortable handing\n-suspension makes the comfort a whole new level\n-stable when negotatite  bends\n-ample leg rooms\n-boot space more than enough my stuff\n-of course i feel like president when owning this DS7",
        "user_name": "petrolpump",
        "car_name": "DS 7 Crossback",
        "brand": "DS",
        "price": "$166,999 "
    }
]