[
    {
        "review": "ReviewI drove the Avante HD previously and was impressed by the reliability and low cost of maintenance. Decided to skip the Elantra from the previous generation and went straight for the facelift Avante instead. Just look at the number of coe renewed avante running on the roads now, reliability is proven since they are still using the same engine and gearbox albeit some tuning improvements. \n\nAbsolutely no regrets for the price we are paying for at sub 80k for the s model which is a great balance between the basic and elite model. Gotten the car at 75k (some might have gotten lower at 73k during the CNY 8888 promo) and with a parf value of 7k+, the depreciation works out to be less than 7k per annum. Car price is about 5k difference per trim level. Shares similar parts with pre-facelift elantra so maintenance and repairs will be a breeze. \n\nDuring my car hunt, I was comparing a few sedans within the same range such as Civic/Vios/Impreza/XV/Cerato. Test drove all these cars but CVT gearbox really make the drive horrible and lethargic despite flooring the accelerator but gotta give credit to Honda for making civic a decent drive despite the CVT. \n\nIn the end, decided to just compare sedan cars with the traditional AT gearboxes which left me with only Cerato/Avante within the sub 80k price range. Price wise only cerato came close but at the expense of safety features and having to deal with the nonsense t&c from C&C such as minimum loan, mandatory trade in and long delivery times. A savvy guy just needs to do a simple computation and conclude that you are paying way more for the cerato with lesser safety features as compared to avante.",
        "user_name": "ferrytales",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I like1) Decent soundproofing by KMC (soundclad) - This really helps to reduce the road noise and gives you a peaceful drive\n\n2) 3M solar film - better spec solar film as compared to other distributors \n\n3) Flexibility of KMC - You can opt for your own insurance/loan amount/with or without trade in and car price will still be the same, unlike C&C\n\n4) 6 airbags + Traction control for all trims as compared to Cerato (only SX/GT has the top safety features), this should be a basic feature in all cars instead of the usual 2 airbags \n\n5) Wireless charging + amazing legroom for both front/back \n\n6) Delivery time is absolutely amazing, collected the new car all within 2 weeks from making a book to securing coe followed by car collection (better to check with SE that they have ready stock for your colour option)\n\nGreat to see KMC giving soundclad/3m/tuffkote for all avantes as default regardless of trims and not removing the basic safety features (airbags + traction control)",
        "user_name": "Sherleo",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I do not likeKMC should considering bringing in the Avante with 1.4 turbo engine + 6at, this car will definitely be a top seller and relive the good old days in 2009 era.\n\nPlease do not bring in the avante with DCT which is prone to issues down the road!",
        "user_name": "Haydenlim05",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "ReviewTested the Avante Elite variant. Sturdier and seems more durable when comparing to Attrage but hence the higher pricing as well. Car is certainly suitable for SG driving.",
        "user_name": "FY88",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I likePriced pretty much according to cars worth\nLots of features such as ventilated seats, memory seats, rain sensing wiper etc\n6 airbags for this variant\nClimate control aircon as well as for rear passengers\nCruise control for longer drives especially up north\nBased on specs, 0.4secs faster than brother kia cerato (makes you wonder)",
        "user_name": "zhenhong77",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I do not likeStill feels a little underpowered for me (but can't argue)\nWill be nice to have a sunroof since its elite model\nTraditional handbrake makes centre console smaller\nOverall handling is pretty basic\nFront seats have hard plasticy cover, will make it uncomfortable for rear passengers knees especially taller ones.",
        "user_name": "sayan",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "ReviewCompared to the kia cerato, this is more Value for money while the Cerato is more of looks rather than value. For example, the cheapest variant of both cars have a huge difference in terms of specs. The Cerato barely offers anything and either get a free upgrade to leather seats and touchscreen or top up yourself. While the Avante has alot of of features such as Rear aircon, touchscreen and leather seats.It is also safer as it has 6 airbags compared to 2 on the Cerato and also includes TC. So, if your planning to buy any of these two, U can choose either looks or specs.",
        "user_name": "jameswwp",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I likeBase model of this already comes with Touchscreen and Rear aircon compared to the Cerato\nLegroom and headroom are both decent\nComes with 6 Airbags compared to the Ceratos 2 airbags(base model)\nValue for money",
        "user_name": "LionelBoon",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I do not likeEngine takeoff is slow as engine is from 2010 and still not updated.\n6 speed transmission can be improve and engine displacement should be smaller with a turbo",
        "user_name": "Alslee",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "ReviewWe wish to extend our sincere thanks and appreciation to Komoco management and the sales team for the wonderful services rendered during our recent new Hyundai Avante purchase. \n\nOn 22nd July 2019, I went to Komoco showroom together with my wife and relative to meet Ms Anna Yap the sales consultant to view the range of vehicles and subsequently, Anna arranged for us to go for a test drive and at the end of it, we were amazed with the smoothness, quietness and responsiveness of the Avante engine.  We were also impressed with the design of this compact sedan and felt that it was well suited for the needs of my family and budget consideration.\n\nWe had a wonderful experience at the showroom as Anna who had been with the company for the past 15 years was able to provide us the professional and excellent service throughout our visit meticulously, patiently and cheerfully.\n\nAt the end of the day, we felt that the new Hyundai Avante was the right choice for us as our expectations in terms of practicality, affordability, safety and efficiency were met.\n\nOn 5th August 2019, we went back to Komoco showroom to finalize the sales contract with a booking fee for the bidding of the COE.\n\nOn 7th August 2019, I received a pleasant surprise from Anna informing and congratulating me that I have successfully secured the 1st bidding of COE with the strong support of Komoco despite the huge jump of COE price. I was overjoyed with the news and I am now a happy buyer.\n\nMany companies provide services as part of their offerings but it is only with Superior service that makes or cuts a deal. \n\nCongrats for having Anna in your staff.",
        "user_name": "DWJL511",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "ReviewHyundai Avante 2018 is a newly design, young and up trend car model \nin Singapore market. The car capture my attention in 15 Nov 18 but at \nthat point of time,  i am very happy and comfortable with my hyundai \nAccent (2015) and have no intention to change. \n\nSomehow after a visit to the Komoco show room in June 19, makes me think twice and eventually go for the change. Komoco Singapore Sales team Patrick Neo exhibits great professionalism, patience in his car introduction and allow me time to test drive the all New Hyundai Avante that finally makes me go for the change.",
        "user_name": "avtar",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "What I likeI feel much faster acceleration and pick up power than my Hyundai Accent.   \nSpacious and longer cabin interior but height same.  \nMore attractive dashboard materials and solid build quality. \nQuiet, Comfortable ride and decent handling and ride. \nTrendy looking, Good Leg room and Roomy trunk space. \nCabin noise and Road noise is very low. \nHardly feel the gear change upon speeding..  \n06 airbags for my family safety \nAir con outlet for the back passengers allow more comfort..   \nGood sound system just like Accent. \nSudden brake response is good.",
        "user_name": "ShenJialiangVernon",
        "car_name": "Hyundai Avante",
        "brand": "Hyundai",
        "price": "$82,999 "
    },
    {
        "review": "ReviewWent to komoco, got a great SE (Michael Goh, really helped me all the way) to test out a Avante, initially I am very bent on getting on. As days goes by, I tested more and more cars from other makes and finally decided to  pay up for avante. Then my backside itchy when to testdrive the i30, .... The rest is history.\n\nIt is quite comfortable as a European made car (Czech) solid body, solid handling.\nFC is pretty good going about 14-17 km/l (depending on my highway vs city ratio). Powerful when you (warning it's intoxicating) click on the sports button (yeah FC will take a hit). LED lights front and back, Android are good to have....\n\nNo complains thus far (coming from a GTI) except really need to press ISG off, and Autohold on(for tlc on the DCT, and resting your leg at the traffic lights)",
        "user_name": "Ikenshin",
        "car_name": "Hyundai i30 Hatchback",
        "brand": "Hyundai",
        "price": "$97,999 "
    },
    {
        "review": "What I likeComfortable, nice to drive, good acessories\nTurbo  adrenaline when i want it",
        "user_name": "Fenny",
        "car_name": "Hyundai i30 Hatchback",
        "brand": "Hyundai",
        "price": "$97,999 "
    },
    {
        "review": "What I do not likeReally TLC on the DCT",
        "user_name": "BruisedWayne",
        "car_name": "Hyundai i30 Hatchback",
        "brand": "Hyundai",
        "price": "$97,999 "
    },
    {
        "review": "ReviewWe also have a thing for hatchback cars, so then it is time to change our 9 years old hatch (Honda Fit), we were just zooming into all the hatches and SUVs that fit our budget and requirements. \n\nWilfred (from Hyundai Ubi) is very patient and very helpful. We were actually there upon the insistence of a friend to look at Elantra. Very test driving the Elantra, we saw the i30 Hatch and Wagon and were instantly drawn to it.\n\nImmediately Wilfred arranged for another test drive for us.. And this time my hubby and I took turns to test drive it. \n\nWilfred went through every detail of the i30 and made sure we tested all the features during test drive. \n\nIt is very responsive and steering around corner is very stable, noise insulation is good, you can still hear a bit of the engine, but that is quite pleasing to the ears :) No road noise. \n\nQuite generous in terms of cabin space and backrow leg room. For family with young kids, the backrow comes with ISOFIX for your babies's car seat. \n\n\n\nThe HU is a 9\" Unit, sleek looking albeit a bit low-res. But that does not bother me. \n\nComes with Wirelesss Charging, AutoHold (you do not have to hold your foot brake at traffic junction), Drive mode(ECO, COMFORT AND SPORT), engine idle to save fuel. Comes with front and rear camera, tinted solar film, reverse sensor and keyless entry and lock and car mat. All this little details add up to provide a great driving experience thus far. \n\nAlthough it does not have all the fancy features like blindspot monitoring, Autonomous Emergency Braking etc, the engine and the driving experience more than makes up for it. \n\nIt is in short, a fun and comfortable car to drive. The experience was so good that we ended up booked a unit that day itself.\n\nIf you are looking for Hyundai car, strongly recommend i30 and look for Wilfred (At Ubi branch).",
        "user_name": "Mralfredoh",
        "car_name": "Hyundai i30 Hatchback",
        "brand": "Hyundai",
        "price": "$97,999 "
    },
    {
        "review": "What I like- acceleration (about 9.2s  for 0-100km)\n- good noise insulation\n- very stable when cornering\n- 1.4 Turbo \n- Great exterior styling & long bonnet\n- AutoHold & engine idle\n- Multi-link rear suspension\n- individual aircon control for passenger and driver\n- 7 speed dual clutch transmission\n- Auto Chromatic rearview mirror\n- drives like a Golf but cost much less \n- taller, longer and wider than most hatch",
        "user_name": "Melvin123456",
        "car_name": "Hyundai i30 Hatchback",
        "brand": "Hyundai",
        "price": "$97,999 "
    },
    {
        "review": "ReviewWith the recent add on features to this model, it did turned my head when I was comparing cars around the 70k range. The front & back cam, touchscreen, navi, BT, Fogs, Side Indicators & remote booth are newer add ons i see Hyundai are trying to push more attention to this model. I was deciding between other models; To save some $ for a 1.2, or top up abit more for a 1.6, the difference in between is around 4-5k? \n\nHowever I was swayed by the value my dollars can extract from the Accent and my needs in looking for a car. \n\nI dont really need a bigger 1.6 (with less features), as its just myself Im transporting most the time, while the 1.2 is really kinda under powered for my liking despite the economical price and FC.\n\nFC is average so far measuring 12 to 14. Not tempting enough for me to look at hybrid now for the price differences and the long term effects of the hybrid batteries.\n\nYes some of the interior is plasticky (its a not a Conti), but how often do we lay our hands at these areas during the drive? Its just the steering, knob and the seats which are pretty decent already. The aesthetics are curvy and smooth, if the old school chrome ever bothers you, just plastik dip it ;) Imma 1.8m and the rear seat may have some room restrictions for me, but in the driver seat its all good~ The stock rims looks old school with a plastic cover but that doesnt bother me much, not much diff when the wheels are spinning anyway right lol? \n\nthe booth space is very good given its class, a few difference very other models dont really make a diff to me too, as I dont have it filled to the brim always. Theres always a knock down rear seats if you ever need it.\n\nfor a 1.4 churning 100bhp is pretty decent for a city car, its punchy due to it's smaller size from other 1.6s, but dont expect it to be the 1st after the lights turned green, especially vs Taxis. The 4 x Disc brakes are effective when needed. I was rather surprised by how firm the car hugged to the road at higher speeds and at bends, similar Jp models would have felt floaty instead. The doors also felt \"Heavy\" When closing, giving a solid \"Thug\" With not much force required. \n\nKomoco's after sale services are really good and reasonable thus far. Keep it up! You dont get the double standards between before and after sales.",
        "user_name": "SiawJianWen",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I likeValue for each Dollar u spent, depending on your needs and budget. \n- Added features\n- Decent Engine\n- Adequate spaces in areas required.",
        "user_name": "Timbuktu",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I do not like- Retractable Side Mirrors will make it full circle at this price.\n- Eco mode dependant on how heavy your foot is, will be good if there's a Eco mode switch. Not asking for Sports Mode or Crusie \n- Will be great for choice if there is a slight top up version for Auto Lights or LED or any of the above suggested features",
        "user_name": "Philipkee",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "ReviewBought the Accent new (in 2016) as my 'spare' weekend runabout and was impressed with this manual hatchback.  At near 100 bhp/ton, this 1.4M shares the same specific power as my past Alfa Romeo 33TI 1.5!\n\nThe 14\" Stock rims and Kumho tyres are heavy and lackadaisical - so got these upgraded to 15\" Advan Racing RG-II (~5kg/wheel), shod with Michelin PS3 ST tyres ... And a world of difference it has made to the car's ability to accelerate straight-line and its handling around fast bends.\n\nThe Hyundai 1.4 Kappa MPI engine mates superbly with the 6-speed manual transmission and slick gear changes up to 7K redline gives a decent 0-100 in 10+ seconds (timed) ... Though in the course of upshifts, the engine buzz can be a bit cabin-intrusive (unfairly compared to my Lexus and Merc).\n\nWith disc brakes all-wheel round, a well-sorted suspension system and together with a heavy-biased electric power steering, gives the Accent a confidence-inspiring handling prowess at speed, on the road.  Many of its peers - small, entry-level models either come with the odd 3-pot whiny engine, rear drum brakes, rubber-bandy CVT transmission and/or super-light electric power steering.\n\nThe reliability of today's Korean cars are proven and leaves little to question.  Only regular servicing has sufficed.\n\nThicker-gauge Korean steel used (obviously, for a made-in-Korea car) and a heavy hatch door (I note that Hyundai had spent a lot of R&D on the rear hatch design, for crash worthiness) - akin to the European marques.\n\nA full-sized spare tyre in the trunk - which I demand for (my having to make regular trips up north).  The Lexus and Merc also have full-sized spare tyres - at least for the pre-2010 models that I own ... Though unfortunately, this has become a rarity for many other brands - even BMW, Audi and the likes.\n\nMy Accent also came with an after-market leather-wrapped steering wheel, very well installed, not overly thick - compliments of KMC.  This actually does make a difference, in the overall driving experience of the car.",
        "user_name": "Hoonigan",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I likeLight weight, small 1.4 Kappa engine block, churning ~100bhp for a 1-ton car.\n6-MT gears that can be red-lined on-demand.\nA fast and nippy car, that has remained very reliable to-date.\nThe OEM head unit and speakers though basic, provides good music - be it for the radio, CD, or USB device.",
        "user_name": "zhenhong77",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I do not likeThe smell of rubber from the air-cond ducts, when the car is first started up ... but which disappears after a couple of minutes.  Chemical cleaning and replacing the air filter did not help much.\nNeed to be careful in doing sudden steering adjustments at high speeds (>120 km/h) ... am still a fan of the (old) hydraulic power steering.\nThe piano-black plastic used for the head unit cover is a dust magnet.\nThe brushed silver plates around the electric window-switches appear to be easily scratched, but mine have not had any marks yet, after nearly 2 years of use.",
        "user_name": "Fpchong",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "ReviewI got the manual accent.  Handling was nice but there could be improvements in the gearing.  Not as smooth as I would like while up shifting or downshifting but it's something I can get used to.",
        "user_name": "Detach8",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I likeManual transmission\nDesign",
        "user_name": "Jan75",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I do not likeA bit noisy at times",
        "user_name": "Evo5sg",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "ReviewTest drove both the Automatic and Manual.\nI give comfort a 4 star compared to my current Sport car.\nBut of course I do drove several other cars prior to my current car so I am pretty sure the Accent has one darn good suspension. It felt much pliant compared to my older Avante and the smallish Getz too.\nReliability 4 stars. I never had issue with Hyundai car. This is a misconception with Singaporeans about Korean cars. Hyundai made good cars. Go check out the Genesis if you drove BMW. It will knock you out with its Genesis.\nHandling is so-s0.. Its a light weight car slightly over 1 tonne. But the smallish 14 inch wheels had weak handling department. But I am sure a decent pair of 15 inch wheels and better quality tyres will improve the handling by another star.\nExterior is attractive, especially I love the 5D hatch version. Overall length looks shorter and sportier. \nIts interior however is not that interesting. But well sort out. \nI counted 6 cups holder ! Go find out where they were in the showroom if you missed out the 4 holders. Amenities are decent. \nHowever I would have to give the features a 3 star too because I prefer a car with telescopic steering wheel. The clutches are too tiny to my liking too. \nPlastic trimmings are OK except those shinny silver ones which I believe will get scratches within months and tarnish. I would prefer they have matt grey colors that would last a long time. Add some polished Piano black trims to enhance the quality look. But thats my preference.\nValue for money and definitely one of the best bang for buck car I've came across.\nEngine performance is 100 horse. Low if you might think, but for a 1 tonne car, thats almost a 100 hp/tonne performance. \nGO compare some other cars that are 1.6 litre or even 2 litres.. And you will be surprise this little machine is pretty decent too ! If only there is a 1.6 variant in Singapore and I believe this would be the best seller in the mini sub compact market",
        "user_name": "Holeinone",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I likeaggressive looking front and lower bumper shapes.\nNew head lights\nLight weight\nGood pliant suspension.\nFeels more quieter than previous models.",
        "user_name": "PeterPP",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "What I do not likeTiny wheels\nNon telescopic steering\nlack of more color choices.",
        "user_name": "jdmrockz",
        "car_name": "Hyundai Accent",
        "brand": "Hyundai",
        "price": "$75,999 "
    },
    {
        "review": "ReviewHave test drive the hatchback on my first visit whereby the wagon was somehow not make available. \nThe ride was pretty quiet with probably some minimal road noise. It was definitely a better and more stable ride over the hatchback.\nLooking at the great package and price point in comparison with its rivals, this is truly value for money purchase.\nI have simply signed on the dotted line even before the motorshow. Glad that I have do so and the price was just up with Jan 19 1st COE bid result.",
        "user_name": "lun71",
        "car_name": "Hyundai i30 Wagon",
        "brand": "Hyundai",
        "price": "$111,999 "
    },
    {
        "review": "What I likeGreat package price -  At sub $100K,  you will have LED headlamps, DRL, 17inch rims, TPMS, paddle shifters, driver electric seat, electric parking brake with auto hold, engine start/stop, park assist, 8 inch head unit with android auto and apple car play, wireless phone charging etc which is rare for cars at this price point. Be it wagon, hatchback, SUV or sedan.\n\nSpacious boot - 602 litres with all seats up \n\nNice touch factory wrapped steering wheel with great cockpit functioning buttons.\nFactory fitted leather seats feeling great too\n\nVery versatile\nRear seats centre armrest comes with accessibility to boot area\nThe already spacious boot with underneath compartments and cargo net. It also comes with tonneau cover too to hide your items from pry eyes.\n\nElectric steering wheel making parking a brisk.",
        "user_name": "lzhik1990",
        "car_name": "Hyundai i30 Wagon",
        "brand": "Hyundai",
        "price": "$111,999 "
    }
]