[
    {
        "review": "ReviewValue for money in terms of performance...\nPrior to this, I was driving a Jaguar XF and BMW 520. \nPerformance wise, I would say it is on par or slightly better...",
        "user_name": "whatname33",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I like- Combination of powerful engine and rear-wheel drive makes this car very responsive... especially in Sports Mode\n- Sleek exterior with great lines and curves.\n- Tire pressure monitoring system.\n- Auto adjustment on steering and driver seat for easy entrance/exit",
        "user_name": "DdCarReviewerSG",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I do not like- Price difference between variants too huge\n- No Electronic Parking Brake",
        "user_name": "Gabdat",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewWas at the Singapore CAR Show 2019 Wearnes Booth looking at the JAGUAR Vehicles when I came to see the Infiniti Q50. Immediately got interested and asked around for an SE to explain the main features of the car. Was really fascinated by the specifications and what the car can do. Was looking at the Highest Spec Model. When the SE clarified my doubts of the origin of the car, I was even more shocked and wowed. I have always had the perception that Japanese Brands could not rival Continental Car brands. Was pretty obvious that the Infiniti Q50 could match up to its conti rivals. This car gives the WOW factor and would definitely be a good buy. Probably a car that would steal stares from everyone.",
        "user_name": "Mervynwm",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I likeThe car is Long and Spacious which is good for 5 tall adults.\nThis car looks very sporty and a good car to drive up to Malaysia to test out the torque. Would probably get the Other JAP Bros to move aside and let the more powerful brother cross.\nThis car has a really big boot space and good for shopping. Most sports sedans cant do this.\nLike the idea of Automated Seats.",
        "user_name": "Diontan",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I do not likeBAD Fuel consumption\n............. Nothing much actually..",
        "user_name": "PrataPlaster",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewTest drove the face-lift Q50 recently. Quiet interior with a famous horse and gear box under the hood.Everything else is Nissan.",
        "user_name": "Vwguy77",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I like-nice body trim and better front and rear headlights\n-comfortable seats\n-powerful but not better than the Jaguar XE\n-mid range luxury\n-double screen dashboard\n-door touch lock/unlock system",
        "user_name": "Coern",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I do not like-cramped rear seats.not enough leg room\n-slightly jerky gearbox\n-key is like any other Nissan vehicle\n-base model is way too basic",
        "user_name": "Axeman24",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewWent by to test drive the Q50 as keen to wait for the upcoming QX50 where it is likely to have the same 2.0t engine when it’s launching around Q3-Q4 2018. \n\nExterior styling is certainly captivating though is a upmarket Nissan. It’s like some brands where have a household brand and a tuned and/or luxury sibling. \n\nInterior feels plush of luxury with the appropriate buttons placed appropriately within the driver reach. \n\nBoth sides electric seats with a good feel of luxury leather while others are pretty much normal where no sun or moon roof is part of the package. \n\nNo electric tailgate at all as well and no options like active dashboard display like you see in Audi or VW or Lexus.  And didn’t try the console for its features if it had things like ambient lighting, enable/disable features and others where the similar competitors have in them. \n\nBeneath the hood still uses Mercedes that you see in the current C or E class series where you don’t have to pay a high price tag to have a 3-point star engine. \n\nOther features like lane departure assist and so are in the higher variant of higher price top up too which baffles you back. Can’t remember if it comes with rear aircon. \n\nThe drive.....Engine purrs up similar to a Jaguar XF as it quietly gets ready. Once you engaged to Drive, it’s ready to go or dash at your pedal commands. The pickup is excellent with high torque, much tuned better than the E class which is the same engine. Paired with 7-speeds, the gear change is smooth with no stalls or hesitation but didn’t get to try sports mode. \n\nTurning radius is easy too. Cruising is exceptionally smooth where as and when you need the power, just simply throttle on it you get it. \n\nOverall, it’s a considerable car to get for its Mercedes engine beneath it if you do not mind some gadgets not there as standard or not even as options. Or the scaled price tag if you want them all.",
        "user_name": "Huskybeckham",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I likeGood pickup \nMercedes engine in its hood\nNice plush and luxury interior\nGood starting price against its luxury competitors in the same category",
        "user_name": "user50",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "What I do not likeNo elective tailgate \nNo moon or sun roof\nPrice gap difference too much between variants just for the gadgets to have",
        "user_name": "carma1965",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewOwned a 2.0t version and I would say very good experience so far, named the Nissan Skyline V37 in Japan and hidden underneath the bonnet is a Mercedes c250/e250 engine, acceleration is a breeze. Not only that, already with the very powerful engine, it's still have alot of potential for 'poisons' for car enthusiasts. DAS steering is very reactive and one of the first if not the first to have this steering system.",
        "user_name": "CultureShock",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewOwned for 1 year already. \n\nDatsun, Nissan, Infiniti... The brand has come a long way. But a Lexus, this is not. \n\nLexus = old man luxury car, smooth, comfortable, not scary, quiet, underwhelming drive experience\n\nInfiniti = middle age man luxury car wannabe. Powerful engine, quick response, less comfort for more fun, more wind noise than a lexus so we don't fall asleep above 90km/h. \n\nthere is no perfect car, its always an engineering compromise between performance and comfort. This car is skewed towards performance over comfort, especially in sport mode with an extremely responsive throttle and aggressive gear change. Love the old school feel of the 7 speed gear box (reliable, 7G+ from merc) and lunge when the turbo kicks. 8 speed boxes (tried the volvo one) smoothes everything out until no feel. \n\nrear passengers complain of bumpy ride (after being spoilt in the back of the lexus which puts drivers to sleep together with the passengers since its so comfortable and un-engaging.)\n\nin short, lexus is great for passengers. Infiniti is great for drivers. Who is more important? Depends on how much backbone you have.",
        "user_name": "joechen",
        "car_name": "Infiniti Q50",
        "brand": "Infiniti",
        "price": "$171,800 "
    },
    {
        "review": "ReviewHaving 2 continental sports coupe previously, the Infiniti Q60 Red Sports definitely is oceans apart. The drive is luxurious, smooth, refined and yet delivers the power without all the fuss. It pulls easily with a light tap on the throttle. It soaks up bumps and road imperfections very well. And the steering is effortless and easy on the hands. All these qualities very much appreciated after a hard days work and you just want a fast drive home and yet comfortable.",
        "user_name": "Oceantan",
        "car_name": "Infiniti Q60",
        "brand": "Infiniti",
        "price": "$190,800 "
    },
    {
        "review": "What I likeDrive which is smooth, effortless and yet fast. A lot of customization for the drive. Comfortable rear passenger seats. Adults able to sit comfortably. Aircon is powerful.",
        "user_name": "Tay86",
        "car_name": "Infiniti Q60",
        "brand": "Infiniti",
        "price": "$190,800 "
    },
    {
        "review": "What I do not likeI wish the sound qualities can be set up similarly for both radio and media. Boot might be a tad small. Also wished it has a digital speedometer.",
        "user_name": "Quistation",
        "car_name": "Infiniti Q60",
        "brand": "Infiniti",
        "price": "$190,800 "
    }
]