[
    {
        "review": "ReviewWent to the Car Show held on the 10th to 13th JANUARY 2019. Was attracted by the affordable pricing as well as lifetime servicing. Hence, First booth visited was the Jaguar booth by Wearnes. First Impression, Wide but Compact Saloon Car. When I stepped in, I was wowed. Below are the Reasons....Would have booked a unit if I had not bought the Audi SQ5 less than a year ago along with the Honda Fit hybrid and Grace Hybrid that I registered 2 weeks ago. Was really tempted to book a unit but had to pull handbrake due to Financial reasons. Would probably book the unit during the next car show.",
        "user_name": "DdCarReviewerSG",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I likeFirstly, Being one who likes saloon cars, this car definitely caught my attention. This car has many sleek and elegant details lining the doors. Furthermore, the taillight does bring out some elegance as it looks luxury and commanding. \nI do not like stick gearshifts, hence the idea of a knob gearshift really attracted me.\nThe infotainment unit is big enough for me and has enough functions for me to explore and play with.\nAs the car comes with Electric tailgate, I do not need to close the tailgate myself. I do not know why but I have always had a fear of closing tailgates too hard.",
        "user_name": "Gabdat",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I do not likeThe space at the back is comfortable however can be a little squeezy for tall adults. Being a compact saloon, may be a little difficult for those with long legs to exit the car.\nThis car could have been better with the panoramic sunroof or moonroof. Seriously woulod make the car look better. ( Just personal Preference)",
        "user_name": "Solar",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "ReviewWhen up to wearnes last month to test this out.Sleek exterior but very small for rear passengers.Power comes spooling out easily with the 2.0 petrol turbo and performed around bends at buona vista curvy road was impressive.Planted and responsive engine.Nice road handling.Engine note was musical",
        "user_name": "Saint888",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I like-exterior design\n-powerplant\n-nice 18\" rims\n-comfortable seats\n-raging drive\n-the promo price\n-RWD\n-comfort oriented suspension setting",
        "user_name": "Mervynwm",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I do not like-ugly dashboard\n-simple multi media,looks cheap\n-cramped rear seats\n-some road noise intrusion\n-floating gear knob. james bond gone wrong\n-limited interior trimming\n-basic safety features\n-sceptical about reliability",
        "user_name": "mcs08",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "ReviewAttracted by the promo and went ahead with a test drive.\nIt was impressive, not only the looks, also the performance and handling.\n\nBeing diesel, there is a slight noise in the cabin during acceleration, but it is rather unnoticeable. A compromise if one wants to go for a diesel car.\nComparing to other diesels, the sound proofing is good.\n\nAlthough it's over 70; Aluminum, it doesn't feel flimsy. Had the flimsy feeling on C class, not this car. Drive the car hard and observe, and opening/close the doors, you'll notice it.\n\nA real good deal compared with its peers like Mercedes and BMW.",
        "user_name": "Sdf4786k",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I likePerformance. Has high torque of 430nm making driving in our city a breeze\nLooks. Sexy...\nInterior is purposeful yet not cluttered\nGood handling\nSolid body and heavy doors\nLong service interval compared to its peers, 2 years/34k km. Low running costs\nBeen checking out internet for feedback on this car's reliability since it's debut 2 years ago. No major complaints at all.",
        "user_name": "Newbie26",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "What I do not likeGetting in or out of the car may not be convenient for people over 1.78m. \nStock 17 inch rim is too small for the car. Go for at least 18.",
        "user_name": "VteckiCk",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "ReviewBought brand new XE from wearnes in 2017. Vehicle comes with 18inch rims from factory. Local AD replaced it with 17 inch rims (trying to earn pathetic extra one inch).\n\n17 rims comes with way outdated tyres. Tyres manufactured in 2013. Uneven weas and tears spotted. Complained and they agreed to replace the tyres. \n\nTo check tyre manufacturing years must be included when u collect new car. Premium brand dealer behaving like sim lim seller nowadays.",
        "user_name": "technikman",
        "car_name": "Jaguar XE",
        "brand": "Jaguar",
        "price": "$182,999 "
    },
    {
        "review": "ReviewI have owned a Jaguar XF for almost 7 years. I must say the XF is quick , quiet and spacious. The back seat and the trunk are roomy. It definitely delivers the excitement , composure and the comfort. The transmission provides smoother acceleration and delivers better fuel economy and fewer emissions , in tandem with the start/stop system.\n\nSelective drive modes , change gears manually via steering mounted paddles setting cruise speed with your thumb.\n\nThe cabin architecture is clean and unfussy , illuminated sill tread plates and window controls add to the haloed ambience. \n\nThe touch infotainment system provides full command over a wealth of features including audio , climate and navigation. \n\nA distinctive design enhanced by a dynamic drive and the latest technologies.\n\nThe lightweight front double wishbone and the rear integral link suspension work together to bring up the level of ride comfort and handling.\n\nA press on the start button and the engine purrs to life , opening up air conditioning vents , rises up gear knob and the big cat shakes off its slumber. Just a touch to wake this cat up !\n\nThis car is designed to do anything at the flick of a finger or the mere touch of it. From shifting gears to engaging the parking brakes to switching on the cabin lights.",
        "user_name": "Dwee",
        "car_name": "Jaguar XF",
        "brand": "Jaguar",
        "price": "$237,999 "
    },
    {
        "review": "What I like- Stunning body curves and aerodynamic design\n- The nice design cohesion of the LED slant of the headlights at the end\n- The iconic Jaguar front grille\n- The Air-con vents that opens up when engine is on and closes up when is off\n- The gear knob that rises up when the engine is on , that enhanced the driving\n   control in the palm of my hand\n- The half-moon button parking brake mounted on the central console",
        "user_name": "Mervynwm",
        "car_name": "Jaguar XF",
        "brand": "Jaguar",
        "price": "$237,999 "
    },
    {
        "review": "What I do not like- High maintenance price",
        "user_name": "bahomet",
        "car_name": "Jaguar XF",
        "brand": "Jaguar",
        "price": "$237,999 "
    },
    {
        "review": "ReviewTest drove this new SUV from Jaguar sometime ago.\n\nFirst looks is impressive indeed for a used to make only sedans brand to come with this design for their SUV. A head turner for sure when you drive on the roads.\n\nInterior was a well-liked luxury as per a Jaguar where it can stand side by side to its competing brands.\n\nThe intuitive controls on the console is friendlier than some of those I come across from the brands mentioned above.\n\nThe start of the engine is quiet but you can feel the beast is anytime ready to take off. A typical Jaguar with the gear-knob rises to tell you \"I AM READY to be in Drive mode anytime\".\n\nThe take off is smooth and power similar to XF and XJ that I have tried before where the cat or rather beast PURRS its way off but you are certainly in full control with the little heavy steering given.\n\nGear changes are smooth and quiet where you don't feel a thing at all. THUMBS UP ! \n\nAs and when you want to throttle, the almost immediate responsiveness at normal drive is there for you, no need to have any adjustments to the settings to other modes.\n\nCornering is also fantastic, thanks to its AWD ability to handle.\n\nOnly that when you need to have some of its useful packages, you might need to calculate the financial part of it as the base model comes almost empty with it, not even a panaromic roof or roof rails as standard.\n\nOtherwise this is a considerable model to take for its luxury and performance that is on par with the same class from its competitors.",
        "user_name": "Mervynwm",
        "car_name": "Jaguar F-PACE",
        "brand": "Jaguar",
        "price": "$250,999 "
    },
    {
        "review": "What I likeThe take-off responsiveness\nSmooth gear changes\nFriendly console use\nHead turner design",
        "user_name": "bb16",
        "car_name": "Jaguar F-PACE",
        "brand": "Jaguar",
        "price": "$250,999 "
    },
    {
        "review": "What I do not likeNo soft door close to extend its luxury\nLED lights special order or pay more to have than as standard\nNo panaromic roof as standard\nNeed to \"TOP UP\" a lot for their many different useful packages",
        "user_name": "VteckiCk",
        "car_name": "Jaguar F-PACE",
        "brand": "Jaguar",
        "price": "$250,999 "
    }
]