[
    {
        "review": "ReviewJeep’S the kind of brand that could murmur Hannibal Smith's “Winch… Winch… Winch…” In the last scene of the A-Team. A completely off-road focused mud-loving hog farm dedicated to simple boxy designs and a signature Fuhrer grille, Jeep’S namesake to off-roading SUVs is akin to scotch-tape used to call out any sticky tape. Even in their fancy Land Rover fighting guises, Jeeps feel completely out of place on city terrain and long for off-course bashing. Yet the latest offspring is more than a mere sacrificial penguin slapped into small SUV waters. As success mounts even for models like the eyesore causing Honda Vezel, the Renegade displeases car journalists aplenty for breaking tradition – But emerges globally as a commercial success in cityscapes where it doesn’T belong.\n\nSomehow the Renegade had managed to pair the grille, door lining and roof rack with the black under cladding in perfect harmony much better than anyone else. Without emanating an icky plasticky aura, the Renegade makes it as trendy as Macklemore making grandpa clothes fashionable. While the market was chasing LED headlights and fancy illumination technologies, the Renegade with its basic halogen headlights was beaming with much needed old school charisma. Think of it as ditching a cartridge shaver for a safety razor. \n\nThe Renegade fails in one big department – Price positioning. Despite having a solid product offering, with the right engine, maintenance cost and fun factor – It loses out heavily to the other 2 popular models – The Honda Vezel and the Toyota C-HR. \nOn a price comparison basis, the cheapest of the lot (Vezel) packs more features than the 3 and both Japanese makes offer excellent fuel efficiency in hybrid trims. The other outlandish consideration would be the Opel Mokka Diesel, which wins with cheap diesel and a 24km/l fuel economy.  As a result, it is easy to spot any of the 3 SUVs on Singapore roads. The Renegade however is extremely rare.\n\nFor a company struggling to have any footprint in Singapore, I would strongly hope that they revisit the Renegade's pricing to be competitive in the market. By doing what Mokka achieved the Renegade and future small Jeep offerings could further strengthen the brand and delight customers. For now it is just slightly out of reach.",
        "user_name": "CarbonFalcon",
        "car_name": "Jeep Renegade",
        "brand": "Jeep",
        "price": "$129,999 "
    },
    {
        "review": "What I likeOld School Timeless Design\nPunchy 1.4L Turbo - ample torque\nFrugal consumption\nCheap maintenance - no complicated parts",
        "user_name": "Jan75",
        "car_name": "Jeep Renegade",
        "brand": "Jeep",
        "price": "$129,999 "
    }
]