[
    {
        "review": "ReviewI had previously drove Altis , Civic1.6L and 1.6L Cruze. I was shopping around for new car due to COE expiring. Went to test drive Mazda, Altis , Civic 1.6L, Avante and Cerato 2019, before making decision. Lastly I have narrow my picks to either Avante and Cerato. Due odd and to many sharp coroners design of the Avante, I ended up with Cerato, which looks smoother and sexy in design.  \nJust got my Cerato SX 1 month ago. The drive is good and much better road comes with a touch of conti feel. It has all quality looks of nice luxury cars around. Handling when comes to turning around the curve, specially exiting the highways. The pick up from road junction is surprising much better than the older K3s and current stock 2019 1.6 i-VTEC (A) Honda Civic that I have test drive before going for the 2019 Cerato SX. The interior is looks much  better the Honda 1.6 Civic. Whereas the 1.6L Civic looks a little plastic.Leg room is almost the same as the 1.6L Civic.\nThe engine is quiet and smooth. Unless you Rev above 3000rpm, than you hear a roaring sound. It feel impressive and confidence on road. Previously , I have problems with 1.6 Cruze pick up was pretty bad. Now I have much confidence of over-taking. Of course, it is not the fastest car in it's category, but is decent nice car to have. Although Avante having a new 2016 engine drop in, I did not feel the differences in terms of pick up speed and transmissions.  \n The car also comes with warning alarm, if you do not fully release the hand break.",
        "user_name": "HP_Lee",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I like- Design quality is better compared to Avante and Altis\n- Drive is pretty much similar to Avante in terms of pick up speed.\n- Fuel consumption  is better than my previous Cruze. Currently clocking average 12.5 - 13km/L(City60%/40% Highway)\n- Interior space and leg room is larger than Avante and Altis\n- Wireless charging \n- Sound system  is better then Altis and Cruze.\n- 2 Climate controls. Aircon power is decent and right of the cabin even in a hot sunny day. Not overpowering which have to rise your voice during conversation. \n- Infotainment screen is bigger than Avante and Cruze \n- welcome light on exterior door handles.\n- Smooth and sexy design. \n- lights on the driver and passenger sun shade.",
        "user_name": "ferrytales",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I do not like- Road noise due to the low profile tyres it comes with.To reduce the road noise by changing to higher profile tyres. \n- Although the size is more or less the same, the front exterior looks smaller than 1.6L Cruze and 1.6 Civic.\n- 2 tones interior colour not available.\n- Leak of lane departure sensors.\n-  It will be good , if it comes with 1.4T like the Cruze 1.4T.\n- More expensive than Avante's top range1.6 Elite (A), but value for money, if you compare with 1.6L Civic and Altis.",
        "user_name": "Gabdat",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "ReviewTest drove the cerato before deciding to purchase the Avante but it was not due to the car being sucky but rather having to deal with C&C is really a headache. You gotta drive a hard bargain with them to waive the loan/trade in requirements and you might not even get it. Delivery time is ridiculously long, just read the comments in the forum and you will know what I'm referring to. Do a simple calculation and you will realize you are paying much more for the Cerato at the end of the day with the accumulated interest and rubbish trade in value from C&C. \n\nThere was an online warehouse sale in early 2019 and made a deposit for the display unit which was about 1k or 2k off the list price. Went down to the showroom and the SE told me the following which was a major joke:\n\n1) Waiting time is around 3 months despite the car is ready stock\n2) No touch up will be done, selling as is\n3) Rubbish trade in value for my old ride\n4) Price on the website was wrong and they were not going to honor the deal unless I paid the difference\n5) Took 1 month to get back my deposit\n\nWith this kind of service from C&C, pretty much explains why Cerato sales are worse than KMC/Borneo/KAH. However, people who care only about aesthetics are still purchasing the cerato despite having to pay an overall higher price. To whoever that bought the showroom display units, hope they did some touch ups for you as I saw that the rear seats were damaged and scratches on the dashboard.",
        "user_name": "Sherleo",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I like- Nicer aesthetics as compared to Avante\n- Drive is pretty much similar to Avante but definitely better than K3\n- Fuel consumption should be better than the older K3 and there seems to be improvements in the tuning when I test drove  \n- Interior space feels larger than Avante\n- Dashboard looks futuristic and premium",
        "user_name": "Pingyeek",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I do not like- No traction control unless you pay more for the highest trim (I asked SE about this and he told me nothing major but the car might be unsafe if you decide to drive around bends at higher speeds or wet surfaces, WHAT? you gotta be kidding me)\n- 2 airbags in Cerato vs 6 airbags in Avante \n- Almost impossible to find a decent SE from C&C Alexandra branch (proven in the mcf thread as well)",
        "user_name": "subzero17",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "ReviewTried out this \"Baby\" Stinger at C&C on a hot saturday afternoon. Made me smile but not for long. First look and feel was impressive. After the drive.....Depressive. Still, I would recommend this rather than the Avante. Just for it's sexy looks.",
        "user_name": "nishan_bandara",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I like-design. reminds me a lot of Audi and it's bigger sibling,the Stinger\n-comfortable front seats\n-GT line is the one to get\n-many safety features that you can find only on higher end cars\n-ventilated cool seats",
        "user_name": "MarkerPen",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I do not like-over priced. embarrassing cheap plastics at this price\n-air conditioning is very weak\n-lack of power from it's old engine. only 1 engine option\n-noisy interior. poor insulation\n-poor fuel consumption\n-reliability still a notch below the Japanese",
        "user_name": "yishunite",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "ReviewTest drove the car recently. The looks of the car interor and exterior as well as the features was better than expected!",
        "user_name": "Chianglai",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I likeThe honey comb front grill look is slick looking\nThe add on external looks for the GT line is pretty impressive\nSunroof!\nDriver memory seats!\nVentilated seats for our hot climate!",
        "user_name": "Otgekoo",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I do not likeCar lacks the power needed for its looks. Wish that Kia had a car that slots between this and that of the much pricier Kia Stinger\nThe back of the front seats have a hard plasticy surface cover which makes the rear passenger knees uncomfortable\nStill uses traditional handbrake which makes the console feel small and narrow\nOverall handling can be improved considering this is GT line",
        "user_name": "GS418",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "ReviewFinally collected my GT Line model after a 6-month wait. To me it was alright and in fact perfectly great timing as I started looking for a new replacement car to my Honda Accord since Feb 2019. Placed my order in end March and the car arrived end Sep just nice when I'm scrapping the Honda. \n\nSo far I'm pretty impressed by the features the comfort & quietness of the car. Test drove A3 and Skoda Octavia and the feel was actually not as good as CERATO. Plus the features of Cerato are way better. \n\nPerformance wise nothing to shout about. It's just a NA 1.6L engine. Time tested to be reliable. Absolutely suitable for drivers who aren't going to rev too much and wanna race on the boring roads here. \n\nTo me, comfort, styling, features come first and Cerato GT line fits the bill perfectly. Plus is Cat A COE, neutral VES and low road tax. Fantastic choice.",
        "user_name": "Chiayaowei",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I likeStyling\nFeatures like smart trunk, wireless charging, Apple CarPlay, sunroof, D shape sporty steering wheel, beautiful daytime running lights, nice rims (I dun even need to change it to anything sportier), ventilated seats to cool your butts and back on a hot day, large infotainment screen\n\nSimple, uncluttered and sleek dashboard\nKeyless entry\nCat A COE price\nReliable engine (normal 1.6L but if it is turbo engine then in Singapore it will be Cat B COE and also future high maintenance costs)\n17\" factory rims\nCollapsible back seats for extra stowage",
        "user_name": "WongWk_12653",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "What I do not likeMediocre sound system (lack of bass)\nManual handbrake (best is electronic)\nNo aircon inside glove compartment and centre console",
        "user_name": "bluearieskie",
        "car_name": "Kia Cerato",
        "brand": "Kia",
        "price": "$81,999 "
    },
    {
        "review": "ReviewThis car is an absolute joy during test drive with the turbo kicking in at low rpms and perfect for city driving in Singapore. However, the car might suffer at higher speeds and noise from the engine will be pretty prominent too. Pretty high depreciation due to the low parf.",
        "user_name": "ferrytales",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "What I like- High torque for city drive\n- Sufficient space for 4 adults, 5 will be a squeeze\n- Boot space is reasonable\n- Turbo engine",
        "user_name": "AdenPhua",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "What I do not like- Questionable reliability of the dry clutch \n- 3 cyl engine makes it a noisy drive\n- Poor insulation\n- Car feels hollow, gotta spend $$ for aftermarket soundproofing",
        "user_name": "2378howe",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "ReviewWas first introduced to Kia Stonic at the Car Show.\nJust randomly browsing with my friends.\nWhen i decided to get a car, i saw that actually Kia Stonic was one of the most affordable yet comes with multiple features compared to other cars at the same price range.\n\nWent for a test drive, immediately i was bought over by the power and features it comes with. However, colors were limited and delivery is very long.\nWaited for 4 months before even the car is in my hands. \n\nOverall, it is still worth it.",
        "user_name": "LawrenceLee_110640",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "What I like1) The funky exterior looks (Multiple colors, but limited in SG)\n2) Pricing of the Car (Affordable)\n3) 6 Airbags (Safer compared to Fit etc.)\n4) Hill-start Assist Control\n5) Torque Vectoring by Braking\n6) Auto Headlight/Air-con\n7) Low Road Tax (1L Turbo)\n8) Electric Folding Mirrors with side repeaters\n9) Sun-glass Storage with overhead console lamp\n10) Reverse Parking Camera\n11) USB port built in for charging & *connecting to android/apple\n12) Built in Bluetooth (Audio only)",
        "user_name": "Mach23",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "What I do not like1) Rear Seats are cramp for 3 adults\n2) No Rear Air-con\n3) No Air-con seats like Kia Cerato.\n4) Android Auto/apply carplay functions must be connected via cables.\n5) No built in GPS function.",
        "user_name": "MarkerPen",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "ReviewStill a fresh new model since being launched 6 months ago, Stonic is a definite competitor to the compact crossover market. \n\nThis car comes equipped with features to provide the driver a good driving experience, not forgetting the turbo which totally aids to pickup, good stock suspensions for comfortable ride, and driver's dashboard can be customize to various preferences (digital speedometer, cruise-control etc)  \n\nTest driving for a short distance will not justify the actual power of this car, i encourage to ask the sale person for a longer test driving experience, dont forget to check out the info-tainment too. The real gem of the Stonic is about the technology and the driving experience.",
        "user_name": "DdCarReviewerSG",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "What I like-the Turbo! Adds punch to the pickup!\n-the freshness of this model (new on SG roads)\n-road tax price (low!)\n-auto headlights and smart cornering lights\n-dashboard info can be customize to driver's preference\n-stability when cornering \n-continental brand tyres as stock\n-rear disc brakes",
        "user_name": "mikk123",
        "car_name": "Kia Stonic",
        "brand": "Kia",
        "price": "$84,999 "
    },
    {
        "review": "ReviewThe car is magnificent.  Wife is from Singapore so I was curious.  Not to bum you guys out but the car which cost you 202k I just bought in Boston Ma for 39k USD.  It is a 3.3L with all the bells and whistles",
        "user_name": "SpaceGhost",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I likePower and comfort",
        "user_name": "Gabdat",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I do not likeAuto stop engine feature keeps coming back on ever time you start the vehicle",
        "user_name": "DdCarReviewerSG",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "ReviewWhat can i say that has not been written in these reviews?Nothing actually.What has been said is exactly what i felt when i test drove this beauty of a machine.\nthumbs down to other European make.This is the the car to own.\nShame on me for not buying it!!",
        "user_name": "EuroNcap",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I like-driving\n-handling\n-body\n-fun factor\n-engine\n-RWD",
        "user_name": "ervintay",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I do not like-some parts feel and looks cheap.just like any other KIA using feeble plastics\n-end up losing much more after driving for 5 years compared to other cars that are priced the same\n-pretty low ARF for such a hefty price",
        "user_name": "StingerGT",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "ReviewAfter 10 years of Audi S5 ownership, here comes the time to go hunting for a good substantial car to replace my 10 yr old S5. Went car hunting at Toyota, Kia, Mazda,Nissan and Audi with a group of car enthusiasts who drive a S5 as well. This car feels very much like my S5 but still lacks in some areas like mods. In the end, some of the enthusiasts from the group settled for the Kia Stinger 3.3 while some of us went for the Mazda 6, the flagship sedan of Mazda, Mazda CX9, the flagship SUV and vehicle of the Mazda fleet, Toyota Vellfire, Premium First Class Drive on the roads as well as the flagship S series SQ5. I was one of them of who settled for the SQ5. I am writing this review in a Owner of a S5 and an enthusiastic and happy new owner of an SQ5's perspective. This review may not be really objective in a sense.",
        "user_name": "wheelogist",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I likeThis car comes with paddle shifters which allows for quicker gear shifts. The car also has a long wheel base for a car of its class which makes space for more legroom. Most cars are compact these days. This car also comes with the panoramic sunroof. Good for people who love to admire the sky above while driving. This car also has multiple variants to choose from.Actually only two variants to choose from which is already more than enough to make buyers spoilt for choices.",
        "user_name": "Badieboy",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "What I do not likeBuild quality\nfails in comparison to conti cars\nPlastics\nsomething that conti would not make it dominate\nReliability\nKIA TRACK RECORDS?\nTurbo Lag\nTakes a while for the full power to kick in",
        "user_name": "Edmundgan",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "ReviewThis car has disrupted the automotive industry with its bold attempt to challenge the Germans but nonetheless they have done a fantastic job coming very close with its stunning performance, looks, thoughtfulness and value.\n\nDriving this stinger invokes a blood surging emotion. The overall feel of the car and the connections exceeds one's expectations and its price. This car allows the driver to drive like a sports car and yet able to perform its daily task admirably.\n\nFor the same price, rivals will not be able to provide the same level of performance, reliability, and equipment level. This gap could be as far as 100K+ in Singapore.\n\nThis car is truly a YOLO kind of car. You have a lifetime to own a few cars and why not get a grand tourer that enables you to feel connected and truly go the speed you want at the speed of thought? \n\nGovernment's rules on cars kept changing and it might not be so distant away when new rules will make ownership of performance cars fast more painful than now. COE upswing is also trending to start to 2019.",
        "user_name": "AlainDupuis",
        "car_name": "Kia Stinger",
        "brand": "Kia",
        "price": "$169,999 "
    },
    {
        "review": "ReviewHad tested drive the Sorento twice and totally in love with it! In fact, had almost paid for the deposit but changed my mind at the very last min signing another make MPV instead. \n\nHere's my review as a car \"Goondu\" Below; Spec I don't know, only the driving feel. \n\nHigh seating gives the driver a bird's eye view hence giving confidence. Drive was smooth with power. \nStable turning and U-Turning with responsive accelerator. \nMy teenage girls were with me, and they were super wow over by Sorento and said this is the \"ONE\"!\nThey like many of the features inside eg. Electrical ports at 2nd and last row for phone charging, panoramic sunroof (of course), comfy seats even the last row.\n\nAlthough Sorento isn't my final choice, but guess I will always lust after this beautiful car....",
        "user_name": "Chugomay",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I like1) Sporty Design \n2) Park Assist\n3) Lots of features - aircon vent even at the last row\n4) Ventilated Seats\n5) Stable ride for my motion sickness children\n6) Diesel Engine Power!\n7) Nice New price after July's 1st COE\n8) Premium feel \n9) Electric Tailgate\n10) Save money using Diesel instead of Petrol\n11) Panoramic Sunroof for my girls - I prefer \"No Sun Ray entry\" like a tank if possible",
        "user_name": "Grandpa78",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I do not like1) Back row a little difficult to access to but... it's an SUV\n2) Big and chunky car, potentially make parking difficult, yes, my parking skills sucks. Park assist failed on my 2nd test drive but it was a busy day with lots of traffic\n3) Nothing to do with the Sorento but SE who attended to me didn't seem to be very eager in my business.\n4) Diesel Road Tax!!!!",
        "user_name": "opgamerkkhk",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "ReviewAn impulsive buy but nvr did regret. Secured a competitive price during kia rd show in the east and traded in my 2yo 2.4L Outlander. Depre worked out to be mid $11k. The great torque was the deciding factor. Space, built quality, and the tons of features are great.  Having the car for the past week, I've managed to clock avg of 14.5km per litre with 70% Highway routes. Definitely an added surprise for this 2 tons suv!",
        "user_name": "Pumpump",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I likePanoramic roof. It stretches beyond the 2nd row seats and my kids love it!\n\nTorquey engine that gives you the g force pull back feel.\n\n14.5km per litre fuel sonsumption (not forgetting the cheaper diesel cost)., my prev 2.4L outlander did around 10.5km\n\nGood space for the 3rd row. Allows passengers without pulling forward the 2nd row that most mid size 7 seaters suv require. There's ac for the 3rd row as well! \n\nFolding of 2nd and 3rd seats flat is a breeze. \n\nConti feel\n\nGreat road presence.",
        "user_name": "Neutoris",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I do not likeNo lane departure.\n\nNo 360 view camera\n\nDoors side panels plastic a tad too much\n\nSlight diesel clattering during idle and move off. (quiet during crusing though)",
        "user_name": "Kardoff",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "ReviewDriven many amny cars before, from mx-5  to cx-9 now currently driving cayenne and cx-9 and looking to replace cx-9. C&C offered my 2+ year old cx-9 140k while many other places did 145k. Vw offered 150k. Compared many cars which are seven seaters which range from the trash toyota sianta to something like the skoda kadiaq. These cars are,mazda 5, toyota wish, honda jade, opel zafira, toyota noah/voxy/esquire, three french 7 seaters gc4p , 5008, grand scenic. Also tested bmw 216i gt but way too underpowered. Best two mpvs tested are touran and sharan. Suvs tested include Nissan xtrail(last row seats not useable), Honda Cr-v(really poor built quality), mitsubishi outlander(drivetrain and body control very poor), skoda kodiaq(almost 170k after added options,almost cx-9 territory).\nAt last shortlisted 3 cars, Kia Sorento, Vw sharan and Vw touran.Tested each car at least twice before settling on the touran. Sorento had good power and torque, can really feel the thrust when pushed hard, seats high up(commanding position),spacious 3rd row seats. Feels much faster than the figures on paper suggest 9.3sec. Not a hint of sluggishness with 5 on board. 10 year warranty very impressive and 5 year free sevicing is also great. Built quality is amost on par with the Germans but quality of materials not up there yet, asking price 145k for gt line also quite expensive. Limited colours left, no colour i want, hence i went for touran",
        "user_name": "fungyee77",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I likeThird row air con\n441nm of torque\nfull of features\nimpressive built quality\nAuto parking\n19 inch wheels\nRed brake calipers, even my cayenne ones are not in red(yellow)\nDiesel motor quite refined, not noisy inside cabin nor outside unlike bmw diesels\nAll-wheel drive provides ood grip and i took a right turn at alexandra at 70+ km/h with little body roll, no tire squeal meaning i can actually go faster, composed handling for quite a big car\nAdd obly 5k for the 8 speed transmission which is almost on par to the ZF transmission in Bmw.\nDiesel cheap and SE claim 1 tank can go aound 1.1k km, which i suppose would be aound 900+ if driven normally",
        "user_name": "Little_prince",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I do not likeSlightly high price for the brand(acceptable to me since cr-v 7 seater 150k)\nBrand image not good amongst sgreans(dad used to have a Kia carnival and car went bonkers within 4 years)\nHigh road tax\nIf go malaysia, hard to find euro 6 diesel\nSlightly slower than Touran\nSmaller than Sharan in every dimension\nOnly 6 airbags(reasonable since the x-trail, cr-v all have 6 also)\nDoor opening need very huge space, kids will accidentallynhit other people car\nLow resolution infotainment system, camera(small problem, just change outside can already)",
        "user_name": "dsman",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "ReviewGot my Sorento GTLine at end of Aug. Absolutely love it. It is powerful yet not noise. Exterior (esp the tiger nose grill) may not please everyone but overall the presence is there. Interior is nicely done. Loads of features such as ventilated front seats, electronic front seats with presets, real time FC, tyre pressure monitor, Auto engine start/stop, etc. Driver seat can be adjusted in a lot of ways. CarPlay and Android Auto ready. (Finally) a bigger MMC screen. Plenty of boot space. Rear sun blinds are very good for Singapore. Lots of boot space with 3rd row down. Can fit in one 26-inch foldable mountain bike and one 20 inch foldable bike (maybe another 20 inch one, will try later). GOOD FC considering it is nearly 2 tons. I am getting 8.XL/100km for my usual routes on normal mode which has about 65/35 Hwy/City. That is < $70 per 71L tank (~900km). Sports mode is very responsive and fun to drive with when traffic is light. Normal mode is also powerful enough for most cases. I installed TTC cushion and the car is quite stable and comfort to ride with. Without TTC it is fine also. Of course more body-rolling than a sedan but respectable for a SUV of this height. Sure you can get a cheaper SUV but I consider the extra cost money well spent for all the things I can get with Sorento. Quote from CarAdvice article: \"In its latest generation, the Sorento has grown far larger than it has ever been before (4780mm long and 2780mm wide), no longer straddling the medium and large SUV segments a-la the Mitsubishi Outlander and Nissan X-Trail, instead now competing directly with the likes of the Mazda CX-9 and Toyota Kluger.\"\n\nPS - Difference between GT and SX - not much, GT has AWD, paddle shifter, red upholstery, Seat Work-in System,",
        "user_name": "cbeuk",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I likePowerful engine. High torque, smooth acceleration and quiet. Good FC. Ventilated seats and all the features. Dynamic LCD dashboard. 19-inch rims. Auto tail gate. Six airbags. Electronic Hand Brake. LED daytime-running lights, rear sun blinds, Very fun to drive with.",
        "user_name": "Jman",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "What I do not likeCertain features are removed / not present in the Singapore version. e.g. Infinity sound system, Lane Departure Warning, adaptive cruise control, autonomous emergency braking.",
        "user_name": "Aukang",
        "car_name": "Kia Sorento Diesel",
        "brand": "Kia",
        "price": "$154,999 "
    },
    {
        "review": "ReviewHaving bought the vehicle in Jul 17, this car has simply outperformed my expectations. Had looked around for a sporty and economical SUV/MPV, and was choosing between the Citroen C4 Picasso and the Niro. What made me swing towards the Niro is its cheaper and has more features that many other models at the same price point does not offer.\n\nAnd the sweetener when driving this car is the FC! Sure i can achieve 26km/l and more if drive most of the time on 60km/h, but real world driving comes to abt 20-23km/l depending on your foot. In ECO-mode, the take off is slightly sluggish, but when it cruises, its a very comfortable drive, easy to overtake if you need that bit more push. In Sports-mode, its really rev ready, has alot of torque to really propel you forward from the get go.\n\nOverall, i am very satisfied owner of this vehicle, having driven it for 3 months and its still surprising me with its performance.",
        "user_name": "SOULSTER1989",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    },
    {
        "review": "What I like+ FC at 20-23 km/l\n+ Ventilated Seats\n+ Relatively quiet cabin, well insulated\n+ Driver memory Seats (2 settings)\n+ Blind Spot detection\n+ Reverse Camera\n+ Multi-zone Aircon\n+ Rear Aircon\n+ Sunroof",
        "user_name": "toyotapower",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    },
    {
        "review": "What I do not like- Windscreen abit smaller than usual Cars\n- 5\" Infotainment screen, as compared to overseas models\n- No Apple/Android Connectivity\n- Boot not flushed to the edge\n- 16\" Stock Rims",
        "user_name": "nirofan",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    },
    {
        "review": "ReviewOne of the better looking hybrids out on the market now, the Niro packs a ton of features into a relatively affordable package imo.\n\nAs expected from a hybrid, fuel economy is amazing and it should be cheap to run long term. You get better figures in eco mode but that's pretty dull tbh. In sport mode, this thing really punches above its weight but it gets pretty loud.\n\nThis car also comes with quite a number of features, my favourite being ventilated seats. I hate getting a sweaty butt while driving.",
        "user_name": "Ian1",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    },
    {
        "review": "What I likeFeature rich\nPunchy engine\nAmazing fuel economy\nDoesn't look like any other hybrid",
        "user_name": "Mervynwm",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    },
    {
        "review": "What I do not likeEco mode doesn't move the car much",
        "user_name": "vwlover",
        "car_name": "Kia Niro Hybrid",
        "brand": "Kia",
        "price": "$111,999 "
    }
]