[
    {
        "review": "ReviewBeen driving it for 2 years and  it was with the old ford engine . I  have drove the new Ingenium engine too in Australia for 2 weeks which is of not much difference. \n\nIt has below-average fuel economy and uninspired handling. Part of the reason is the transmission, which sometimes features poorly-timed shifts.\n\nWas attracted to its look and 7 seater option but really disappointed on the reliability ! Been in and out of the workshop umpteen times for minor to major issues till i had to demand for courtesy car during the repair period's . \n\nSo decided to sell it off last month at a huge lost. The re-sales value and demand is certainly worse off compare to other luxury brands.",
        "user_name": "Pastor",
        "car_name": "Land Rover Discovery Sport",
        "brand": "Land+Rover",
        "price": "$235,999 "
    },
    {
        "review": "What I likeIts unique look \n7 seater option \nComfort ride",
        "user_name": "baml2010",
        "car_name": "Land Rover Discovery Sport",
        "brand": "Land+Rover",
        "price": "$235,999 "
    },
    {
        "review": "What I do not likeEngine under powered \nFuel consumption of 13-14L per 100km\ninferior built quality \npoorly timed gear shifts",
        "user_name": "Jan75",
        "car_name": "Land Rover Discovery Sport",
        "brand": "Land+Rover",
        "price": "$235,999 "
    },
    {
        "review": "ReviewThe test drive was main reason why we passed on this. The power delivery was pretty disappointing and the transition was not smooth. Perhaps the test car was not tuned properly but it was enough reason to pass on it.  The interior and exterior design is simple but slightly on the boring side. The technology is also a bit dated. For the price, there is simply too much competition for a compact to mid size suv.",
        "user_name": "Mervynwm",
        "car_name": "Land Rover Discovery Sport",
        "brand": "Land+Rover",
        "price": "$235,999 "
    },
    {
        "review": "ReviewBe absolutely comfortable and safe in this spacious and hardy car. Great for petite people like me because of the high driving position. \n\nYou will feel the power in your hands as you handle this tough cookie!",
        "user_name": "cherubin",
        "car_name": "Land Rover Range Rover",
        "brand": "Land+Rover",
        "price": "$510,999 "
    },
    {
        "review": "What I likeHigh driving position; lots of space",
        "user_name": "Cordoba8008",
        "car_name": "Land Rover Range Rover",
        "brand": "Land+Rover",
        "price": "$510,999 "
    }
]