[
    {
        "review": "ReviewTest drove the luxury version last Sunday. Personally, I think it's main rivals are BMW X1 and Merc GLA series. Here's my take on the car.",
        "user_name": "Gabdat",
        "car_name": "Lexus UX 200",
        "brand": "Lexus",
        "price": "$162,800 "
    },
    {
        "review": "What I like-very easy and comfortable to drive\n-eCVT is a cut above the rest. Not as whiny as others\n-spacious front seats and good seating posture\n-dashboard exclusively different than it's rivals\n-powerful air-condition\n-undisputed reliability with proper maintenance",
        "user_name": "Wasteland",
        "car_name": "Lexus UX 200",
        "brand": "Lexus",
        "price": "$162,800 "
    },
    {
        "review": "What I do not like-besides the dashboard, sadly everything else felt cheap\n-insulation not as good as expected from a Lexus\n-strong tire noise from the back seat\n-terrible headroom in the back\n-overall, should have been more luxurious",
        "user_name": "petrolpump",
        "car_name": "Lexus UX 200",
        "brand": "Lexus",
        "price": "$162,800 "
    },
    {
        "review": "ReviewThey say it's never too late to drive an old Lexus. This model has been out since 2013 with only a minor face lift and some tweak to the suspension and gear ratios. I just had to try it out.",
        "user_name": "Gabdat",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I like-solid interior\n-aggressive engine throttle response\n-confident ride with it's RWD power-train\n-smooth gear change\n-comes with Lexus Safety Sense + (2019 model)\n-responsive steering at cornering and abrupt turning\n-slight, very slight body roll\n-sharp exterior design",
        "user_name": "opgamerkkhk",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I do not like-aging interior\n-does not come with BSM and memory seats\n-cramped rear seats. Enough for just 2 person\n-poor rear legroom",
        "user_name": "shortass",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "ReviewDoors feel solid\nInterior dated\nChassis feels dated, a lot of body flex and bumpy suspension\nHuge rear tunnel\nGood quality materials used",
        "user_name": "Darylklm",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I likeSolid japanese premium car\nGood enough acceleration\nLow price",
        "user_name": "Dtchen",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I do not likeLooks weird(personal opinion)\nLack of newest features\nNo good feeling like driving A4",
        "user_name": "xinz",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "ReviewGot a very good price for the car as I did not trade in any car. Love the smooth gear change, the turbo power. \nAs being a luxury car, the soundproofing is absolutely fantastic, played MP3 music and with built in USB port and the music sounds like a live band in front of me.\nTake off from stationary is good as it is a turbo engine, and with 8 speed gearbox, the gear change is super smooth.",
        "user_name": "Pixel18",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I likeExterior looks sporty.\nGood turbo pick up from stationary position.\nFantastic interior leather quality.\nSoundproof.\nGPS built in.\nNo regrets purchasing this car.",
        "user_name": "alex976",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I do not likeNot used to the foot brake instead of a hand-pull brake which is common in most cars. A few times drove off without releasing it, so the alarm sounded.\nTo save fuel, the engine switches off during stationary at red lights, which I'm not used to it. Thus, I turn off that feature when driving, but it resets every time when I turn off the engine. Wished there was a button that could permanently turn it OFF.",
        "user_name": "Kwannie",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "ReviewDriven the IS200t Exec for about a year at the time of writing. It's a great car to drive in. Coming from a Ford Mondeo, the IS200t is a huge step up in comfort and driving experience. \n\nThe interior is of high quality and it's big enough for my family even though the space is less than what we were used to. \n\nReliability has to be proven after a few years but so far so good. Additionally, Lexus is known to be reliable so all it's all good. \n\nStyling wise, it's really striking. Personally, it looks great to me but I have seen on forums that some do not like it; It's very subjective. \n\nPrice wise, do not be fooled by the listed price. Borneo Motors usually gives pretty good discounts, so don't be too put off by the price. Also, spec for spec with other marques, the IS actually has a price advantage. And because the OMV is rather high, the annual depreciation is competitively priced in this segment\n\nEngine performance is objectively really smooth during normal operations. During hard acceleration from standstill there is abit of turbo lag. But once the turbo lag is over, there is a strong sense of acceleration of getting pinned to your seats (especially when SPORT mode is on). The engine is really potent for Singapore roads.\n\nBeing more light-footed, I averaged about 12km/l. Do note that I'm almost on ECO mode with Auto Start/Stop off whenever I drive. 60% Highway 40% City.\n\nThe service rendered at Borneo Motors during service is second to none. You are treated really well with good facilities. You get a meal every time you service and the service representative is professional in his dealings. Usually, I would dread going for servicing but with Lexus' Borneo Motors, I actually found myself looking forward to it.",
        "user_name": "Surveillancevideocamera",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "What I like-Looks\n-Power\n-Price\n-Comfort\n-Perceived reliability\n-Service at Borneo Motor\n-Fuel Consumption (Mondeo used to average 9km/l so this is a step up for me)\n-Beefy brakes",
        "user_name": "toyotapower",
        "car_name": "Lexus IS 300",
        "brand": "Lexus",
        "price": "$179,800 "
    },
    {
        "review": "ReviewI just switched to ES250 this year after driving German cars for last 10 years. Absolutely love the ride and comfort. The exterior design caught my attention with her distinct and sharp contours. The interior features are premium despite an entry level model I picked which you usually pay extra for German car. The thing I like most are the various safety features that are practical and essential to me who is not a car enthusiast. Finally, I do not need to burn a big hole in my pocket to own this beautiful car with premium features and I feel safe driving my family around.",
        "user_name": "DarrenChiaSGP",
        "car_name": "Lexus ES 250",
        "brand": "Lexus",
        "price": "$210,800 "
    },
    {
        "review": "What I like1) Exterior design and sporty looks with the 18\" wheels. In this 2019 facelift, the car has grown 5cm longer and wider but the height remains. This has made it on par or even bigger than its German competitors but keeping its sporty look.\n2) The sunroof that stretch from driver to rear passengers which you can still shielded it if the sun becomes too bright & hot.\n3) I am surprise at how quiet the cabin is even during cruising and overtaking, unlike the noisy turbocharged engine.\n4) The roomy interior let you feel posh and comfortable even for someone who is taller than 1.8M especially the rear leg room.\n5) Standard package include:\na) Keyless entry and auto start/stop\nb) Built in GPS and rear camera, safety sensor around the front and back of the car.\nc) Wireless phone charging in the car and multiple USB ports in front and back.\nd) The auto sensor to open car boot using your foot (useful features for family man when your hands are full of grocery)\ne) The safety features include auto detect when your car drift outside of your driving lanes, setting the safety distance with car in front, side mirror warning lights for vehicles in your blind spots just to name a few.\nf) Leather feels soft and there is even aircon blowing through both the front passenger seats (good features for hot weather SGP)\ng) The 2.5L engine is very smooth & powerful enough for SGP traffic. It is not punchy like turbocharged type. (If you like quick acceleration like BMW and sports engine, this is not your car)\n\nAdditional things thrown in by Borneo include front & back recording camera, 3M solar film, 5yrs warranty and 3yrs free service. Not forgetting my professional and friendly sales agent, Nicholas.",
        "user_name": "Gabdat",
        "car_name": "Lexus ES 250",
        "brand": "Lexus",
        "price": "$210,800 "
    },
    {
        "review": "ReviewThis car definitely shines in its ride comfort and cabin refinement. The six-speed automatic provides seamless gear changes. A drive mode select system with Eco , Comfort & Sports settings , which let’S me adjust how eagerly the engine and gearbox respond to my right foot. A turbocharged 2.0-litre petrol , fitted with a six-speed automatic gearbox rather than the CVT of the hybrid , is a pricey , sports-oriented range-topper to this distinctive looking four-wheeled drive SUV.\n\nThe large signature Lexus spindle grill design that gives the car an aggressive road presence.\n\nIt comes with a well built interior that is nicely outfitted. The Dual-Zone climate control settings allow the driver and the front passenger to adjust their preferred temperatures. A good added feature is the touch-sensitive dome lights and map light switches , which activate with a gentle touch over the lamp itself. Reclining rear seats will make two adults in the back feel lavishly accommodated. The boot is a respectable size with more than enough room for a small family luggage or the weekly grocery shopping. And a broad square shaped aperture makes loading bulky items pretty easy.",
        "user_name": "Dwee",
        "car_name": "Lexus NX 300",
        "brand": "Lexus",
        "price": "$211,800 "
    },
    {
        "review": "What I like-\tThe front seats are extremely comfortable and are bolstered all around to provide snuggling support.\n\n-\tA Remote Touch controller at the centre console , which adds further control of what’s displayed on the 7-inch high resolution full colour display. I can operate what I see on the screen via pinching , swiping , pushing or touching the touchpad as the same way as operating a smart mobile phone.\n\n-\tSimple and elegant door handle adds to one of my favourite feature. Keyless entry. No need to fumble for the keys. Just reach for the door handle and the car will unlock. And just one simple touch to lock the car again.\n\n-\tBright , long lasting LED headlights and fog lights , and a power operated rear tailgate.",
        "user_name": "Bonafidestack",
        "car_name": "Lexus NX 300",
        "brand": "Lexus",
        "price": "$211,800 "
    },
    {
        "review": "ReviewTested the RX300. If I had to choose one word to describe the interior and the drive, I believe that word will be AMAZING.",
        "user_name": "Gabdat",
        "car_name": "Lexus RX 300",
        "brand": "Lexus",
        "price": "$253,800 "
    },
    {
        "review": "What I like-muscular design\n-silence\n-plushness and oh boy it's filled with it\n-beautiful cabin\n-space and huge legroom\n-the luxurious drive. better than the Europeans.\n-5 yr warranty",
        "user_name": "Whitebear",
        "car_name": "Lexus RX 300",
        "brand": "Lexus",
        "price": "$253,800 "
    },
    {
        "review": "ReviewHave collected my ES300H slightly more than a week. I must said this is so far the best driving experience even compared to my 2 previous E200 models that I have been owning for the past 9 years. Lexus, the brand which resembles premium quality even up to all the fine detailing and continuously maintaining their good workmanship. I doubt we can challenge their design integrity and intentions to ensure Lexus car owners really benefited from their work. Just think in this way, a normal Toyota car already can earn their respect from the public  in terms of quality controls. And only the TOP performers in Toyota are allowed to join Lexus team in their corporate policy (check this out via website). So you are getting the best out of the best.",
        "user_name": "IamwhatIam388",
        "car_name": "Lexus ES 300h",
        "brand": "Lexus",
        "price": "$220,800 "
    },
    {
        "review": "What I likeQuiet during start up and even when the engine cuts in upon reaching a certain speed\nVery Spacious, even good headroom for rear passenger with the \"coupe\" looks\nAircon seats and Low ambient temp ... really cold. May be because my previous continental car never achieve such low off coil temp. Aircon compressor still running even when engine cut off during car halt. Will not get the warm effect.\nEfficiency. Getting 19-20 km/l as Long as you drive normally\nGood sales rep\nNice screen display\nBlind spot monitoring, important and useful\nGood balance between comfort and driver experience",
        "user_name": "Gabdat",
        "car_name": "Lexus ES 300h",
        "brand": "Lexus",
        "price": "$220,800 "
    },
    {
        "review": "ReviewMy SE was kind enough to let me & my wife test out this amazing vehicle before collecting our ES. If I had one word to choose..It'll be LUXURIOUS. This word has been used to often for a lot of cars but in the LS, fits in every perspective. In fact, it's an understatement. There is no word for it's comfort level while driving. I seriously could not find a word. Not one word. How do you say beyond comfortable?",
        "user_name": "Gabdat",
        "car_name": "Lexus LS",
        "brand": "Lexus",
        "price": "$437,800 "
    },
    {
        "review": "What I like-magical drive and ride quality. NVH does not exist in this car\n-silky smooth 10 speed transmission\n-3.6L V6 twin turbo\n-the best front seats you'll ever get in a production car\n-rear full massaging seats\n-quieter than a closed library. So quiet you can hear an ant walking inside and I'm not exaggerating\n-the most high end interior I have ever felt\n-accustomed to fine details like no other car\n-overall pure Japanese craftsmanship",
        "user_name": "sean4860",
        "car_name": "Lexus LS",
        "brand": "Lexus",
        "price": "$437,800 "
    },
    {
        "review": "What I do not like-interior not as distinct as an S Class\n-bulky. Making U turns are near impossible\n-fuel consumption\n-still, over heavy humps and bumps there are slight jolting",
        "user_name": "GTH",
        "car_name": "Lexus LS",
        "brand": "Lexus",
        "price": "$437,800 "
    },
    {
        "review": "ReviewMy NX300h gave me no problem right from day 1 till now 5 years later.  Still running on original hybrid batteries, brake pad and discs, and its coming to 130,000km .",
        "user_name": "Ektpuah",
        "car_name": "Lexus NX 300h",
        "brand": "Lexus",
        "price": "$226,800 "
    },
    {
        "review": "What I likeGood looks, refine, comfortable, reliability.",
        "user_name": "sreeganth",
        "car_name": "Lexus NX 300h",
        "brand": "Lexus",
        "price": "$226,800 "
    },
    {
        "review": "What I do not likeCannot think of any.",
        "user_name": "Ektpuah",
        "car_name": "Lexus NX 300h",
        "brand": "Lexus",
        "price": "$226,800 "
    },
    {
        "review": "ReviewI beg to differ with above comment, I have been having string of issues with this car since delivery in Jan2019, Starting from cockroach issues, fuel cap popping up automatically, engine auto slow down, various alarmed popping up, right from AWD system malfunction, parking assistance problems  and now in the workshop for few weeks to come due to some issues with fuel line. Maybe am unlucky one here.",
        "user_name": "HuangG",
        "car_name": "Lexus NX 300h",
        "brand": "Lexus",
        "price": "$226,800 "
    }
]