[
    {
        "review": "ReviewTest drove the Mazda 3 Sedan Elegance that comes with 18 inch rims. Reliability is given an average because this is a new model and hence issues are unknown. Previous model does have a fair share of issues like, engine vibrations, suspension knocking sound, etc. Hence this new model needs time to prove it reliability.",
        "user_name": "Heartbreakid",
        "car_name": "Mazda 3 Sedan Mild Hybrid",
        "brand": "Mazda",
        "price": "$96,888 "
    },
    {
        "review": "What I like- Interior and Exterior design.\n- Features (Even the Classic, which is the basic model has decent equipment and safety features.)\n- Build quality. Door close with solid thump. And overall body panels do not eludes the thin hollow sound when knock as compare to previous model.\n- Good ride comfort despite wearing 18inch wheels.\n- Improved insulation against road and engine noise (Engine noise is much more refined at higher rpm than previous model)\n- The drive eludes solid feel.",
        "user_name": "Sherleo",
        "car_name": "Mazda 3 Sedan Mild Hybrid",
        "brand": "Mazda",
        "price": "$96,888 "
    },
    {
        "review": "What I do not like- SPACE: (Very) disappointing despite longer wheelbase that previous, and it seems previous model (already not a very roomy car) is slightly roomier in terms of legroom. The overall cabin feels snug within.\n\n- BRAKES: The brakes lack of strong bite, this eludes an impression of weak braking performance because the bite power is correlated to your leg strength input. Perhaps is the way Mazda wanting the driver to have more \"feel\" to the handling than making the brakes way to power assisted?\n\n- PERFORMANCE: Under normal driving, the 1.5 litre is enough but it will not eludes strong immediate overtaking power due. The kick down gears do not eludes the \"push\" feel. Ideally for such a body size and weight, the 2.0 litre or a 1.8 litre (which Mazda doesn't have as petrol model) will be a good balance, but price is another factor.\n\n- PRICE: In terms of safety equipment, Mazda is generous with this new model, but factor in the engine size, the price for this category is on the high side. The highest range, Astina, model is priced really closed to Civic 1.5, Subarus or even its own Mazda 6. So the consideration for this new Mazda 3 is really up to personal choice on what the buyer is targeting (Performance? Equipment? Comfort? Design? Economy? Space? Or an overall good balance package of all?)\n\n- Unknown updates frequency for this model: Usually for most makers, a model will be updated/ facelift one time, but for Mazda, like the Mazda 6 or 2, which has been facelifted 3 times (Mazda 2 updated model has been revealed), one will never be certain if the model is going to be updated for the better or not.",
        "user_name": "nawegoro",
        "car_name": "Mazda 3 Sedan Mild Hybrid",
        "brand": "Mazda",
        "price": "$96,888 "
    },
    {
        "review": "ReviewTest drove and tested the new facelifted Mazda 3. Attracted by the exclusive looks of the car especially the red coloured one.",
        "user_name": "Wasteland",
        "car_name": "Mazda 3 Sedan Mild Hybrid",
        "brand": "Mazda",
        "price": "$96,888 "
    },
    {
        "review": "ReviewI tried the Executive variant of M6. If you are considering style between the M6 and Uncle Camry, then of course M6 will win. But if comfort and more rear leg room for your passengers is what you need, than Camry should be your choice. Of course, price diff is quite a bit almost 33k then might as well consider the Accord. For M6 I did not find sound-insulation to be all that great, don't know why the hoohaa is all about. Engine seemed sluggish for a 2 liter power-plant. They should have just turbocharged a 1.5L save road tax in almost $600 annually. Camry had choice of 2 interior colours M6 used to have 2 as well but they standardize all models to ugly dingy black. Aircon was weak. My old altis could leave you in frostbite at 22deg fan speed 1... The M6 cabin became bearable at 18 deg with fan speed 2. In fact, go try the Mitsubishi Outlander and feel the difference in aircon... Day and night like my old altis. In our climate weak aircon means angry drivers. Seats were not all that comfy. I'm 1.8m tall and without thigh support long journeys can be tiring. Qutlander had better seat support, I would say but one is a sedan and the other SUV... Opel Insignia has better seats if you wish to compare sedan and uncle camry. Mazda should lower their price if it really wishes to dilute our roads with Mazdas.",
        "user_name": "petrolpump",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I likeBody styling\nFULL LED front and rear lights including signal and reverse.\nAuto Lock (just off engine/close door and walk away from car - it will lock on its own)\nPrice (okay okay, can be lower)",
        "user_name": "josephywj",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I do not likeRear leg room\nNo electric boot release\nNo remote boot release\nNo button inside car to release boot either\n17\" rims (should be at least 18s)\nNo wireless charging\nRear USB slots in arm rest (if carry 3 rear passenger then how to use USB?)\nLack of interior colours (no white or brown only black)\nInsulation\nEngine performance\nWeak aircon (should learn from Toyota and Mitsubishi)",
        "user_name": "Irenelumsh",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "ReviewGot my car 2 weeks ago. M6 executive. As an ex volvo xc60 owner, i have to say the M6 is looks good and feels damn good. Perhaps for me the pick up is lacking, maybe because I'm used to a car with a turbocharger. But the torque makes up for it nicely.",
        "user_name": "LinHan",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I like- super quiet car\n- comfortable electronic memory seats\n- packed with safety features (e.g. blind spot and lane departure warnings)\n- super stylish led headlamps.\n- soul red paintwork \n- price I paid was 7k more than a brand new altis. And 9k more than a new civic 1.6 with 2 airbags. It was an easy choice. \n- bose sound system \n- excellent 8 inch touch screen with android auto and apple carplay",
        "user_name": "CoolZebra",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I do not like- air con is on the weak side, in terms of the air output. Temp is perfectly fine\n- should have 18 inch rims instead of 17!",
        "user_name": "thesoul",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "ReviewLast driven an almost ten yr old Skoda. Looking for a replacement  which matches  the same drive and make quality and also does not consume too much fuel. Had never owned a Mazda in my life, but was pretty impressed with this model after a test drive. Ever since I owned it, this car is very conposed at all times and petrol consumption is at 18km per litre on highways which clocked over 30km.",
        "user_name": "opgamerkkhk",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I likeVery stable ride and high specs. Pretty quiet engine with minimum road noise. Reasonable fuel consumption. Android auto makes life convenient, now that I had no need to mount handphone on dashboard.Keyless and auto lock function is good as I no longer even need to lock the doors after getting down. Heads up display is helpful for drivers to gauge speed limit of road and gives warning on any motorists ard us before we switch lanes. Like the exterior styling of car esp the stylish grills and the plush interior that is also functional and pleasant looking.",
        "user_name": "Gabdat",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "What I do not likeScreen black out in s few occasions. Interior cabin space could haave been bigger",
        "user_name": "DdCarReviewerSG",
        "car_name": "Mazda 6",
        "brand": "Mazda",
        "price": "$128,888 "
    },
    {
        "review": "ReviewTest drove the 1.5 Elegance Model.\n\nExterior Style\nThe latest 4th gen looks more sleek and aggressive compared to the 3rd gen. Looks wise, the car really wows looking  modern and sexy. The redesigned tail lights also give it a unconventional edgy looks. The butt of the car looks a bit glaring to my liking though.\n\nInterior\nLots of modern day niceties and well padded cabin. Technology wise, it has about everything and even the radar control which is quite unique. For me who is 180cm, the car felt a bit cramp to me and rear passenger may feel cramp for the low headroom when entering the vehicle. \n\nThe sunroof that can be opened does bring more light and airy feel to the slightly dark cabin which feel a bit cramp to me. The seats fit snugly and felt premium with the electric adjustments.\n\nThe inclusion of the rear aircon vents also make this class more upmarket compared to Japanese rivals.\n\nEngine \nThe 1.5 liter picks up decently and felt comparable to my 2008 Impreza 2.0 liter. Steering wheel felt responsive and nicely planted. \n\nBrakes wise the pedals seems mounted to the floor and lacks bite when u are tapping it lightly. You really need to depress it in to bring the vehicle to a stop.\n\nTech\nThis model has a lot of safety feature that felt premium but coming from a 0 tech car, I dont really appreciate those blind spot monitoring or lane assist which just annoying chines and alert you via the dashboard.\n\nThe dials are modern and it can feel like a lot of info is presented to you which may distract driving. The HUD for speedometer is unique and premium though. No issues of it \"Wobbling\" When you drive. Good thing is those tech can be turned off too.",
        "user_name": "Ka_kia",
        "car_name": "Mazda 3 Hatchback Mild Hybrid",
        "brand": "Mazda",
        "price": "$111,888 "
    },
    {
        "review": "What I like1) Seek modern new looks that make it looks sexy and sophisticated \n\n2) Lots of technology even for the base model. Has 360 degree reverse parking view\n\n3) Plush cabin \n\n4) Comfortable ride",
        "user_name": "petrolpump",
        "car_name": "Mazda 3 Hatchback Mild Hybrid",
        "brand": "Mazda",
        "price": "$111,888 "
    },
    {
        "review": "What I do not like1) Could do with more power for this car that has grown weight. About 1.5 tonne now. Heard from agent that there are no plans for skyactive X version or even the 2 liter skyactive G version\n\n2) Cabin felt a bit dark and rear visibility is not very good\n\n3) Brake pedal lacks bite. Need to really depress it in to stop vehicle\n\n4) Price. The over trade for COE car is not attractive. Probably only able to give $3-4k overtrade for COE car that has still 4 yrs lifespan.",
        "user_name": "Solomongrundy",
        "car_name": "Mazda 3 Hatchback Mild Hybrid",
        "brand": "Mazda",
        "price": "$111,888 "
    },
    {
        "review": "ReviewBooked CX-5 a very pleasant car to drive and be in. Conti like interior and got great pricing for my trade-in car and the CX-5 event unit.",
        "user_name": "TankoMank",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I likeEverything",
        "user_name": "Extravaluemeal",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I do not likeLimited choice of interior colour - only black. Would have loved to have white.",
        "user_name": "qiming89",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "ReviewPrevious car was a Mazda 3, which was already nice to drive. Decided to switch to a SUV as I've always felt more relaxed and shiok driving SUVs (CX5 and Rav4 on overseas roadtrips).\n\nAs our highway surfaces can be quite undulating due to constant roadworks (and maybe some other reasons), there is a difference in the way this SUV \"Bounces\" Along at highway speeds, as compared to a sedan. If possible, try to test drive on the highway to see if you like it. Generally, you will feel less jarring-ness from bumps in the road.\n\nThe CX5 can get up to speed rather easily, but I find myself driving safer in a more relaxed mood. Mazda cars are already more driver-centric than other Japanese brands in the similar range, but I would say the journey is more enjoyable in the CX5, while the drive experience is more enjoyable with the Mazda 3 (and I would guess the Mazda 6 as well). \n\nThere are probably better aftermarket sound systems, but the provided Bose sound system in the CX5 is good enough, if you don't intend to add on aftermarket parts.\n\nGet the premium version if you can. It has nice options, one of which is ventilated seats. With the press of a button, a fan system inside the chair will channel cool air from the a/c to your back.",
        "user_name": "Superflyguy63",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I like- HUD shown directly on windscreen.\n- High ride-height.\n- Automatic \"Manual\" transmission as opposed to CVT.",
        "user_name": "qiming89",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I do not like- Limited extensibility of telescopic steering wheel.\n- Aircon seems weaker than Mazda 3 from 2017.\n- Centre console for resting arm is not as long as that in Mazda 3.",
        "user_name": "jabsmat",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "ReviewCar comes with Android auto and auto carplay, 2L engine more than sufficient for urban driving. Interior is equivalent to Europeon cars. No complains.",
        "user_name": "0wnage",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I likePremium interior\nBest looking exterior\nDoes not cost as much as common looking harrier and low powered CRV , not to mention Euro cars\nBose sound system\nHUD\nAndroid auto , apple carplay\nReverse cam\nGreat handling in corners \nAccor member with 1 free night stay",
        "user_name": "Trent895",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "What I do not likeFC\nA paranomic roof will be nice",
        "user_name": "Mervynwm",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "ReviewTook delivery early December. Chock full of features and interior has the luxury feel,and I have driven 3 Merc and a Bimmer,and not to manteion other continent broads before,this one is a definite value for money in terms of luxe feel and features( mine's a 2.0 Premium) Handles well and rides comfortably for my family of 4. Only drawback I can tell is the boot space or the shortfall of it. Ohhhh....And one more thing, personally I think it's the handsomest SUV in the market......That's why I bought it! :-)",
        "user_name": "ilovetoyotacars",
        "car_name": "Mazda CX-5",
        "brand": "Mazda",
        "price": "$134,888 "
    },
    {
        "review": "ReviewTime for a brief first hand review.\nFor the first 10,000km of mileage. \nBeen driving a mixed of MIJ/ MIK sedans & SUVs for the past two decades.\nHowever the 2019 CX-3 is definitely a tad different from the rest of its class.\nIt's not exactly a huge rough-it-out SUV or cute nippy quickly Hatch.\nCX-3 is a CUV as in \"Cross-Over-Utility-Vehicle\". \nAnd that's the way Mazda design it to be since its first version launched in 2016.",
        "user_name": "UncleLabbit",
        "car_name": "Mazda CX-3",
        "brand": "Mazda",
        "price": "$98,888 "
    },
    {
        "review": "What I likeGood:\n\n1) Beautiful exterior design & sculpted\n2) Brilliant choices of colors (every colors seems nice)\n3) Interior upgrading presents a softer upscaled touch\n4) Smooth drive-train power transmission on long road trips\n5) Improved noise reduction in cabin\n6) Bose Subwoofer in rear trunk is a good add-on\n7) Supremely sporty drive-ability \n8) Good fuel economy \n9) Activate Sports Mode for \"Zoooom Zoooom\" feel\n10) 99.9% of all the parts of the car, inclusive of the lesser known Toyo tires are MIJ not MIT or MIC.",
        "user_name": "opgamerkkhk",
        "car_name": "Mazda CX-3",
        "brand": "Mazda",
        "price": "$98,888 "
    },
    {
        "review": "What I do not likeBad:\n\n1) Rear suspension set-up feels bumpy (Probably to create more boot space)\n2) Lack of sun roof feature in 2019 models imported to Sg\n3) Lack of CarPlay in earlier 2019 models\n4) No remote boot release \n5) Rear seats for passengers' height of 1.8m will be cramped\n6)  No passenger electric seat",
        "user_name": "MathieuWong",
        "car_name": "Mazda CX-3",
        "brand": "Mazda",
        "price": "$98,888 "
    },
    {
        "review": "ReviewGreat handling, good NVH. Sufficient space inside. Small but just ample for 1.7m and below. 3 adults in rear will be a squeeze. Smooth and effortless acceleration.",
        "user_name": "Sunset73",
        "car_name": "Mazda CX-3",
        "brand": "Mazda",
        "price": "$98,888 "
    },
    {
        "review": "What I likeGreat steering feedback/roadfeel.\nGood comfort\nGreat price",
        "user_name": "pudge69",
        "car_name": "Mazda CX-3",
        "brand": "Mazda",
        "price": "$98,888 "
    },
    {
        "review": "ReviewWith a Plethora of choices to choose from, it can be really dificult to decide what car to buy. As part of a car hunt on a weekend, I and a group of Car Enthusiasts who all drive the 2008 Audi S5 went to Explore and Discover the Following: Mazda CX-9, Mazda 6, Nissan GT-R, Audi SQ5, Kia Cerato, Kia Stinger and Kia Carens. As a Continental car driver since the last decade, I have never touched any other brands other than the continental ones. Was pretty shocked that a Japanese Luxury Premium 7- Seater SUV Can perform comparably to a Continental Car. If Audi had not come up with the Audi SQ5, I would have booked the Mazda CX-9. The car is just simply breathtaking. As what you would have expect from what I have written, yes, I am now a proud owner, Still waiting, of an Audi SQ5. Although I personally did not book this unit, some of us from the group booked a unit. If I see the need for another family car, I know that the Mazda CX-9 would be the perfecr choice. Will be elaborating on why I say so in my Review later on. This review again is written in a Continental Car driver perspective. Hence, it would not be representative of everyone.",
        "user_name": "DdCarReviewerSG",
        "car_name": "Mazda CX-9",
        "brand": "Mazda",
        "price": "$199,888 "
    },
    {
        "review": "What I likeExterior\nHeight Of Car shows some form of a sign to the others who see the car that hey, someone with a really high status is in here. Dont come here or you will get into trouble my man.\nThis car comes with cool looking radiator. This car's radiator does look a bit different from the sibling models, CX-3 and CX-5. This really helped to bring out the elegance and Luxury feel of the car.\nThe car has headlights and taillights designed really well to show that the car is Luxury and brings out some bold features of the car\nMost importantly in a Luxury segment vehicle, what i look out for is the look, the feel it gives the driver and passenger as well as the size which is what the Mazda CX-9 does well in. Just look at the size of the car, it is just marvellously huge. \nInterior\nIf I were to list out everything I like in the interior of the car, I would definitely exceed the word limit so I would just priortise the top few that I like.\nThe size of the car really affects the interior space. Having said that, this car has a generous interior space and even the third row poassenger can sit in comfort throughout the whole journey. I must salute Mazda here.\nThis car comes with electric tailgate which is what I really appreciate. A car with many features but no electric tailgate has seriously failed. So good job Mazda again",
        "user_name": "ToonWeiLim",
        "car_name": "Mazda CX-9",
        "brand": "Mazda",
        "price": "$199,888 "
    },
    {
        "review": "What I do not likeThis car is really big but with a tiny engine. You cant expect to go fast in this engine. Mazda should really consider putting in more torque into such heavy cars in the future models. Would seriously help to move the car further.\nThis car has a really bad fuel efficiency. If you do not like the smell of petrol kiosks, please refrain from buying this car as you would be making lots of frequent visits to the petrol kiosks.",
        "user_name": "AndyChang",
        "car_name": "Mazda CX-9",
        "brand": "Mazda",
        "price": "$199,888 "
    },
    {
        "review": "ReviewWe bought this car based on excellent reviews from overseas and took delivery from the first batch in Singapore. Since then we have been up to Malaysia twice and thoroughly enjoyed travelling in this car. It handles well, is very comfortable and is well equipped.  \n\nWe compared this to some MPVs but this was easily the most fun and best looking choice.",
        "user_name": "Fitmugen",
        "car_name": "Mazda CX-9",
        "brand": "Mazda",
        "price": "$199,888 "
    },
    {
        "review": "ReviewNo 1 else offer a make in japan with 6speed auto box at this price.\n\ncvt = rubbish.\n\n\nthe engine match with 6speed gearbox is so perfect.\ni drive many auto 1.5/1.6L cars in the pass 20 years, non of them come close in term of performance.\n\n\n1.0L swift turbo is laggy.",
        "user_name": "DylanChen",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I likev nice 6speed auto\nFC 16km/L",
        "user_name": "TangoJazze",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I do not likeTEK . they sux. Pui !!",
        "user_name": "isaiahyap",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "ReviewBought the standard model in 2016. Have been driving it for slightly more then 6 months. A decent point A to point B car. What I love most about the car is its fuel economy. At 60/40 highway/city driving, I get an average f 17km/l,which translate to a lower petrol cost. The seats are slightly small for an average height man, but it fits my petite wife well. Be prepared for the passengers at the back to have problems with foot space. Officially in paper the vehicle is a 4 seater car, thus, the center seat at the back is pretty tiny. Soundproofing is obviously lacking, and it's not due to the tyres. You can hear the distinct sound of the car/motorcyle moving past you.\n\nEnd of the day, it's a great car used daily if you are not concern about all the other premium features you can find.",
        "user_name": "Mazatlan",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I likeGreat Fuel Economy\nSporty Looks",
        "user_name": "dcb",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I do not likeCompact seats\nSoundproofing",
        "user_name": "Fujitsubo123",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "ReviewOne of the lowest Depreciation and price Made in Japan car in the market. The others being Mit Lancer.\n\nAn pretty much Point A to B car with no frills features. Made in Japan for its reliability.\n\nThe car can pretty much be used for day to day driving, and can comfortably sit 4 adults (include driver). The car is small and nimble and can park anywhere easily. \n\nPower to weight ratio is good and the best part is the fuel economy. \n\nHowever, travelling up North to KL or further, this might not be the best car to consider.",
        "user_name": "Jimmy1978",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I likePunchy and good FC\nadvance engine\ninterior styling",
        "user_name": "StreetFight3r",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "What I do not like$5,000 for the delux which does not comes with the best value for money upgrade\nThis car could do a little more with leg room and boot space just like the Attrage.",
        "user_name": "Mrmilktooth",
        "car_name": "Mazda 2 Hatchback",
        "brand": "Mazda",
        "price": "$83,888 "
    },
    {
        "review": "ReviewHaving owned the Mazda 2 sedan deluxe for 17 months, other than servicing arrangements, I have no complaint about the car so far. What astonishes me is its outstanding fuel economy. I'm surprised that the system electronically registers fuel consumption as 6.4L/100 km or 15.63 km per litre from day one.  I also calculate my fuel consumption manually using the same ESSO station and at the same pump. Each time I pump full tank auto stop I record the mileage travelled and number of litres consumed.  On most occasions I managed between 15 - 16 km/l but on some occasions like last week I managed 16.7 km per litre. Compared to my previous car, my monthly petrol bill has been cut by half.\n  Road holding and braking are excellent and that is despite drum brakes at the rear. There is hardly any body roll when rounding sharp bends and best of all, the standard Dunlop tyres do not make any noise at all.\nMy only complaint is not about the car but servicing. For regular servicing, Trans Eurokars need to learn from Borneo Motors. Booking for a servicing appointment is only through the phone. When the servicing warning light appears, a typical phone appointment takes a month and the car has to be left in the workshop with no approximate time frame given for collection. \n At Borneo Motors, one can choose an appointment date and time online which typically is a week at most. Quick routine servicing is completed in an hour or less with major servicing 2 - 3 hrs. Owners can wait cosily in the lounge while their car is being serviced. To be fair, the staff at Eurokars is polite but waiting is a no, no, as the hard foodcourt like chairs at Leng Kee is unlike the sofas at Borneo Motors where you can even doze off while your car is being serviced. Despite the car being a man in the street car, servicng rates are not man in the strict prices.",
        "user_name": "Ron",
        "car_name": "Mazda 2 Sedan",
        "brand": "Mazda",
        "price": "$88,888 "
    },
    {
        "review": "What I like1. Extremely good fuel economy. (15 -16 km/l)\n2. Good road holding and no tyre noise when rounding bends.\n3. Extremely quiet engine, so quiet that on many occasions, I forgot to switch of the  engine but luckily the system did not allow me to lock the car until the engine is off.\n4. Very quick take off from start,\n5. Good driving comfort.\n6. Trouble free to date",
        "user_name": "Ron",
        "car_name": "Mazda 2 Sedan",
        "brand": "Mazda",
        "price": "$88,888 "
    },
    {
        "review": "What I do not like1. Arrangement for routine servicing of car. Never tell you when your car can be ready. Typical answer \"We'll call you on your handphone when it is ready.\" Sometimes never call but text. If you miss the text message, god bless you.\n2. Limited storage compartments in the car - one glove compartment and one each on the front doors.\n3. No console box.",
        "user_name": "TangSL",
        "car_name": "Mazda 2 Sedan",
        "brand": "Mazda",
        "price": "$88,888 "
    },
    {
        "review": "ReviewI had experienced some noises in most of my new cars but surprisingly, from day 1, this Mazda2 sedan was extremely quiet, so quiet that I went on to restart the engine thinking that it went dead.",
        "user_name": "Sitikchai",
        "car_name": "Mazda 2 Sedan",
        "brand": "Mazda",
        "price": "$88,888 "
    },
    {
        "review": "What I likeSpacious with ample leg room for 4. \nBig boot. \nGood pick up. \nGood road holding with 16\" wheels.\nNice looking sports rims.",
        "user_name": "Bonafidestack",
        "car_name": "Mazda 2 Sedan",
        "brand": "Mazda",
        "price": "$88,888 "
    },
    {
        "review": "ReviewAfter having owned and driven the previous 3 generation of the Miata, I am glad to say with the 4th generation, Mazda improved what we already thought was difficult to improve upon.\nThis little car is small, and fun to drive and it puts a big smile on your face each time you take it out.\nThis current version is set up slightly softer, hence it provides a more comfortable ride along Singapore expressways, but it does feel like it rolls in the bends, especially on the smaller twisty roads. \nBut overall great car, a lot closer to the original 1st Gen Miata.",
        "user_name": "Rronnie",
        "car_name": "Mazda MX-5(Parallel Imported)",
        "brand": "Mazda",
        "price": "$159,000"
    },
    {
        "review": "What I likeThe weight and the size are just perfect now.\nThe 1.5L really pulls all the way up to 7000 rpm\nThe sky activ engine is reliable and ecnomic",
        "user_name": "Sitikchai",
        "car_name": "Mazda MX-5(Parallel Imported)",
        "brand": "Mazda",
        "price": "$159,000"
    },
    {
        "review": "What I do not likeIf I have to really find a complaint, there are no glove box and the boot is slightly small.\nThe biggest problem is while the 1.5L can be currently purchased for slightly over $110K, but it's available from PI only.  Get the agent car and that will set you back way way more expensive.. Too expensive in fact, even for a 2L version.  It just doesn't make sense at those prices.",
        "user_name": "Lcsacc",
        "car_name": "Mazda MX-5(Parallel Imported)",
        "brand": "Mazda",
        "price": "$159,000"
    },
    {
        "review": "ReviewI owned an NC 2005 MX-5 until June last year. It was great fun. Simple. Reliable. Playful. Great-sounding. Cheap interior plastics but very well-built. So I was looking forward to the ND series. The car surprised me and not all of it was good. Read my likes and dislikes below for a summary.",
        "user_name": "toyotapower",
        "car_name": "Mazda MX-5(Parallel Imported)",
        "brand": "Mazda",
        "price": "$159,000"
    }
]