[
    {
        "review": "ReviewI collected my MINI One 5-Doors since May 2019, after 5 months driving reach almost 10K millege, I would like to say: I am a very happy driver with this ride!\n\nI drove my first MINI since 2010 which 1st Gen Clubman, I let go it in 2013 when the arrival of my new family member. I miss it very much when I changed to sedan car to suit family needs. Till last May, I drive this ride and very satisfy with it!",
        "user_name": "pierre76",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "What I likeFirst, I impressed with it's latest technology compared with my 1st MINI! \nThe new LCD screen providing useful information & media function on the go.\n\nThe 5 doors version add the practical part for small family, it's easy access from the little rear doors no issue for my parents and my little one who turn 6 now, 4 adults plus 1 kid just perfect for this ride. The room for back passengers definitely not as big as sedan but it is decent, acceptable, because it's MINI! The flexibility to fold down the back seats for bigger items is a plus point as well.\n\nThis car with 1.5 litres turbo, 102hp, of course not as fast as the big brother Cooper or Cooper S variant, but surprisingly it's not slow but \"quite \" powerful especially when switch the driving mode to \"Sport\"! It's decent for my daily usage. The ride is very comfort if compared with my first MINI in 2010, the handling is as excellent as my previous MINI which I believe handling always is one of the MINI's selling point.\n\nIt's exterior made me fall in love immediately when I first saw it from MINI roadshow. It is most updated & face lift MINI One, especially the Union Jack rear tail lights, they are so beautiful. The full ring headlights enhanced the perfection of it's exterior look.\n\nLook forward to have a pleasant experience with this 2019 MINI One.",
        "user_name": "Singfun",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "What I do not likeNot much, I drove to Malaysia once with the new ride, it's not powerful enough to overtake other cars in high speed of expressway.\n\nMINI One short of some features like keyless entry, center armrest, reverse camera. However I think I shouldn't expect more as MINI One is the entry level car of MINI family, with it's more affordable price tag to own a MINI, it's value for money!",
        "user_name": "Purplexus",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "ReviewI collected my  Mini One 12 months ago.\n\nProblem 1 - water ingress in car boot within 3 months.\nWithin 3 months there was strong mouldy smell from aircon. Later realised the car boot was filled with water. (I hadnt need to use use car boot so didnt notice water ingress issue earlier). Mini technical side said the lining of car boot cracked, which caused water seepage when it rained, which in turn caused awful smell in aircon. Issues fixed.\n\nProblem 2 - continued foul smell from aircon.\nIn the following months, the aircon continued to emit foul smell. I sent in car two more times for aircon filter cleaning and software upgrades. Mini could not pinpoint exact issue except to say they had fedback to manufacturer. Naturally, i was increasingly frustrated with inconvenience. Very disappointed.\n\nProblem 3 - car reversed in drive gear!\nThe last straw came when serious  transmission problems occurred.\nFirst the car did not slide forward when put in drive mode (it is auto). Have to step on accelerator couple of times to move.\nThen next day, the monitor indicated neutral gear when in dive mode, i.E. Could not move off at all. Other times, drive gear could not be engaged. Worst, the car went into reverse when put in drive gear.\n\nI wonder who will be responsible if i had not stopped the car reversing in time and hit someone or damaged something. Mini or me?\n\nMini 's initial diagnosis was it was a battery problem (!).\nAfter they sent it back, i told them problems were unresolved.\nThey took it back again. Then they changed the gearstick and control unit.\nTechnician said hot weather likely caused elctronics issue. Nobody checked if it was gearbox problem.\n\nBy now i am bitterly disappointed.\nI have asked Mini to give me permanent replacement car. Expectedly, they said no.\nI asked them to give me the best deal for upgrade to their flagship Cooper. \nThey came back with the normal listed price and market rate trade in value with free Mri anf msi.\n\nIm still in the process of deciding what to do. \nMini clearly does not think they need to compensate me for the very unfortunate experiences. I think i can hear them say 'suck it up' loud and clear.\n\nSo please to those out there, avoid Mini.\nLikely not the car that can take singapore hot climate. \n\nBe warned.",
        "user_name": "rexscooby",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "What I likeDesign",
        "user_name": "Ipodee",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "What I do not likeInternal workings beneath beautiful design",
        "user_name": "jdmrockz",
        "car_name": "MINI One 5-Door",
        "brand": "MINI",
        "price": "$114,888 "
    },
    {
        "review": "ReviewJust received my car today. (After a super super long wait) Couldn't be any happier when i start bringing my car for some city spin. Even though it is only an entry level mini, the engine still pack a punch.",
        "user_name": "Keyo11",
        "car_name": "MINI One",
        "brand": "MINI",
        "price": "$111,888 "
    },
    {
        "review": "What I like- The car still retain most of it's previous generation traits\n- Buttons are display neatly\n- Seats are firm and have the premium feel\n- Steering wheel gets firmer when going at higher speed, more stability control\n- Fuel efficiency is there",
        "user_name": "Spaceranger",
        "car_name": "MINI One",
        "brand": "MINI",
        "price": "$111,888 "
    }
]