[
    {
        "review": "ReviewThe price of Outlander is quiet good and could be the most affordable 7 seats SUV in the market. Incomparison with other competitor, like CR-V, Ford Escape, Mitsubishi Outlander is always behind in term of performance and engine power.\nhttps://tinxemitsubishi.Com/2019/09/04/danh-gia-mitsubishi-outlander/",
        "user_name": "TinxeMitsubishi",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I likeReasonable Price\nNew features for interior as Apple CarPlay, Android Auto, Parking Camera and heatined steering wheel.",
        "user_name": "AlvinWang",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I do not likeEngine and driving performance",
        "user_name": "Peterblack",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "ReviewJust got the babe a week ago.  My family and I are happy with it so far.   However, I did not foresee seniors having difficulty getting in/out of it.  Intend to install side steps to aid them.  And window visors too.  Not using all the functions in the LCD screen though e.G. Miracast, ipod, spotify.  Still getting use to fully utilise the rear parking screen.  Strongly recommended for those intend to upgrade to a bigger cc and bigger car.",
        "user_name": "HamiSK",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I like- impressive size (cut down unnecessary flashing and horn from bigger cars, as experienced by my last smaller car)\n- value for money\n- reasonable fuel consumption \n- sound proofing acceptable (comparatively, as that from my last car was horrendous)",
        "user_name": "dyong28",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I do not like- jerks experienced, especially if Auto hold is being activated\n- overtaking takes some effort\n- more effort to get into the last row seat",
        "user_name": "Suzeneka",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "ReviewDriven this car for about 3 weeks. Although onboard calculation for fuel consumption can go up to 17 or 18km/L but actual calculation is about 12km/l which is not too bad for a 2L car. Pickup is actually quite good if you understand the characteristics of CVT, but pls do not compare with more powerful cars. Sound insulation is not too bad but bulk of the noise comes from the undercarriage. Space wise is fine as the last row of seats are always taken by my kids. Can be a chore for adults. Electronics wise I would say it is very good already and this car in made in Japan.",
        "user_name": "opgamerkkhk",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I likeSpace and value for money 2L SUV.",
        "user_name": "Evo5sg",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I do not likeNone at the moment.",
        "user_name": "AndyMichaelsLim",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "ReviewJust viewed this car few weeks ago, as my dad was looking for a new SUV to purchase. I have to say, it really is a brilliant car, for the new 2019 Variant. They've improved alot of things such as adding air-conditioning towards the back seats and etc, really impressive. It really is a value for money SUV for a family, really good car! Yes, the last two seats might be squeezy, but actually the middle seats have a lot of leg room! I'm a 188cm guy, and when I seat in the middle seats, I have a lot of leg room! My knees are quite far from touching the driver's seat or the passenger's seat infront! If you push the middle seats a tad bit forward, the back seats would have much more leg room! This car is just so simple, yet its perfect in all the aspects of a budget SUV. However, I do feel that the engine should be a 2.4L, as it is a SUV. Unfortunately our government isn't very nice about that.",
        "user_name": "opgamerkkhk",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I likeLarge boot space.\nComfy seats.\nVery silent drive even when revving.\nLarge legroom area in middle seats.\nStylish exterior.\nSimple interior but very easy to use.\nGear shifters behind steering wheel makes it sporty-feel.\nHandbrake is much more different than past year cars!",
        "user_name": "fungyee77",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I do not like2.0L isn't enough for these types of SUVs, should be 2.4L.",
        "user_name": "mrkkhk",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "ReviewNo doubt, the Mitsubishi Outlander is a handsome looking car. Its Dynamic Shield makes its front looks aggressively sporty and isn't that one of the reason why people like SUVs?\n\nWhen I first bought the car, I love it mainly because how it looked and how it was being reasonably priced. However, after driving it for some time, there are some problems that I starts to see:\n1. The CVT is a drag and it is not doing the reasonably powered engine any justice. Overtaking cars needs tremendous effort from the engine and despite how much it roars, it just feels like the CVT isn't able to thrust the car forward. Accelerating when the car is already traveling over 60km/hr works better, since the car already has some momentum. But if I really want more thrust, switching the car to 4WD Lock will be needed.\n2. I believe that the engine reliability should be fine, since Mitsubishi is willing to give the engine a 10yrs warranty. However, I am not so sure about other parts of the car. Within 2yrs after driving the car, things started to fall apart. The weather seals on the doors and car body began to drop off, passenger overhead handle started to come off, just to name a couple. \n\nHowever, don't get me wrong, the Mitsubishi Outlander is not entirely bad. To be fair, besides the 2 key points above, the Outlander does have its positive points like, handsome good looks, good fuel efficiency, comfortable ride with good suspension, sufficient space to take 7pax at any time of the day, etc. \n\nAll in all, I would say that my experience with the Outlander isn't the worst, but it isn't the best either. In any case, it is still the better Japanese 7-Seater SUV than the other brand, which is also using CVT transmission for its comparatively smaller 7-Seater SUV.",
        "user_name": "Eclipse1",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I like1. Handsome good looks\n2. Sufficient space to take 7pax (incl. 2 kids)\n3. Good fuel efficiency\n4. Comfortable ride with good suspension\n5. Sufficiently powered engine, if it is paired with a better transmission\n6. Reasonably priced",
        "user_name": "Little_prince",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "What I do not like1. Terrible CVT that is unable to transmit sufficient power to its wheels\n2. Overall make reliability, where car parts start to drop off after driving for 2yrs\n3. Mediocre handling with lots of body roll when addressing bends and corners\n4. Interior furnishing and features can be improved",
        "user_name": "mrkkhk",
        "car_name": "Mitsubishi Outlander",
        "brand": "Mitsubishi",
        "price": "$109,999 "
    },
    {
        "review": "ReviewCollected ride and having driven for a week, realized this ride is comfortable, quiet and smooth engine delivery and transmission.  Interior is very Euro-feel, leg room has been great, start/stop kick-in is not abrupt as compared to previous ride's.",
        "user_name": "DopeyOne",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I likeHead-Room / Leg Room is good.\nCabin Insulation.",
        "user_name": "Des72",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I do not likeBoot Space is small.",
        "user_name": "cody7k",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "ReviewFinally, collected my very first SUV last week. Still getting use to and exploring the car features which is a lot of fun to do. I have been driving a sedan in the past and I must say that I am enjoying the ride of this EC very much. Its' high driving position let me see traffic far ahead and feel really comfortable. To me, personally, I feel it is a way better car in term of engine performance, features, audio system compare to my ex Citroen. Good responsive turbo engine, good cabin noise insulation and very good FC compare to my ex ride. I like the exterior design, a very good looking coupe SUV. Its' interior design also great and very modern as compare to other similar SUV. However, it will be great if C&C is bringing in EC equip with other features available in other countries. Overall, I am enjoying my ride in the EC and hope it will serve me well for the years to come.",
        "user_name": "Tarutaru",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I likeEverything about the EC!\nGood performance engine\nGood and reliable Japanese made car\nGood FC (so far)\nComfortable drive \nGood features (can be better)\nGood cabin noise insulation\nGood air conditioning system (as in other Japanese made)\nStylish exterior\nModern looking interior design",
        "user_name": "Gabdat",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I do not likeBoot space a bit small but it is not an issue for me\nNo safety features which is available in other countries like blind spot detection, ACC and rear moving object detection system",
        "user_name": "Treiber",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "ReviewHad the car for 3 months now and i must admit i like the car. It was unique much like the C HR but with more space and felt more well built then the more common Vexel/HRV and nicer features and look (personally felt) then the forester or XV.\n\nA lot off people says the car drags/sluggish but that because the ECO mode is on and it limits the car a little but if you put a bit more pressure on the gas the car would react and it felt like a sporty hatchback.\n\nThe car are not without it flaws if those who done their research would find out the car lack blind spot monitor, adaptive cruise and awd which is part of the package else where the car is sold. But what really this car lag is the price of the car sitting close to Outlander (7 seater) Harrier(PI), CLA (PI), GLA(PI), Scenic, Madza 6,, Forester and the XV, X-trail and yet higher to the Vexel.\n\nNonetheless its is a unque car with sporty look of a hatchback/coupe with the road presence of a typical SUV and yet drive close to a normal day to day sedan.",
        "user_name": "Adyrai",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I likePowerful 1.5T engine works wonders \nRoad Presence, ride height\nSafety feature (FCM, Around camera)\nSpacious for 4-5 adult with boot space\nHandling is good but bumpy",
        "user_name": "Contipro",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I do not likeSome feature could have been added in Blind spot monitoring, AWD, Rear passenger air con\nPrice point too high for the car of this size and feature\nFuel consumption could be slightly better\nInterior is dull \nComfort is affected as the car be a bit bumpy over uneven road or humps",
        "user_name": "Bluebull",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "ReviewOne of the few 1.5l turbocharged Japanese car. It has very good low and mid end torque that is very well suited for driving in Singapore.",
        "user_name": "Bullfrog",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "What I likeDesign / styling, high ride height / ground clearance, responsive / good pickup, smooth CVT.",
        "user_name": "retrozz",
        "car_name": "Mitsubishi Eclipse Cross",
        "brand": "Mitsubishi",
        "price": "$115,999 "
    },
    {
        "review": "ReviewAt this price range of 60k, main competitors are bezza/accent/note. Prior to testing the attrage, make sure you didn't test drive any other cars else you will be underwhelmed by it. Any other cars will give you a better drive than this, even perodua axia drives better than this but if you can look beyond the shortcomings, its still one of the cheapest brand new sedan you can find in singapore. \n\n1.2 3cyl engine makes it sound like an airplane taking off from the runway when you give it a little push. If you are looking at this car, make sure you forget about everything you've ever known about driving a car, forget about overtaking on highways, forget about trying to be first at the traffic light, forget about noise-proofing. \n\nMajority of the people who purchased this car is mainly for the low cost and advertised low fuel consumption but some people forget that this car comes with a puny 1.2 litre engine and tries to drive it like a monster truck, then end up complaining about why the fuel efficiency is not as advertised. You will naturally want to floor the accelerator to pick up speed, to overtake as the engine is weak thus compromising on the fuel efficiency. \n\nDrive it like a tortoise by being super gentle with the accelerator and do not go above speeds of 100kmh on the highways as you will feel like you are bouncing off the roads and you might get a free trip to space as well. However, if you can look beyond the shortcomings, its a decent and value for money car in SG context with ample interior space for whatever purposes. \n\nThere is a reason why we no longer see many PHV attrage on the roads now as compared to the earlier years between 2016-2018 as the PHV drivers all complained that parts start to fail and broke easily due to their high mileage. Most should be scrapped now and unfortunately for those who bought the attrage in 2016-2018 are now stuck with this car as there is just no resale value for this car.\n\nWhat I also don't understand are people buying this car cause its cheap but end up spending additional $$ on mods such as adding bodykits/bars. With the total amount you are paying, better off just buying another decent sedan rather than trying to mod this puny 1.2l car into a racer wannabe.",
        "user_name": "ferrytales",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I like1) Cheap\n2) Huge boot \n3) Huge interior space",
        "user_name": "bongo9000",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I do not like1) Free trip to space if you are not careful\n2) Pay abit more for the accent with a 1.4l engine which doesn't sound like a space shuttle about to take off\n3) Kids will love the car rides just like how they enjoy bouncy castle",
        "user_name": "minty",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "ReviewBought the Attrage in Jul 2019 after searching for generally fuel-efficient cars in Singapore and with a baby otw. Would say that it has been a great ride so far, IF you manage your expectations well. This is not a car for showing off or zooming around town but it definitely gets the job done if you can control your pedal foot ;)\n\nIt was a big change from driving my parents' car (Toyota Camry 2.5) but it is well worth it in terms of the overall $$ spent on the car itself, fuel and most importantly, the convenience!",
        "user_name": "TinxeMitsubishi",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I like- Generally affordable price as a first car\n- Generally fuel-efficient (13-15km/L on average), depends on driving conditions\n- Looks grow on you\n- Comes with the 6 airbags for peace of mind\n- Cruise control (although hard to use in SG with all the jams)\n- Integrated controls in steering wheel\n- Pretty spacious back seats\n- Active WhatsApp chat group for Attrage owners ðŸ˜‚\n- SE was flexible to swap out my bodykit from Style for extra $500 service credits :)",
        "user_name": "Ika_tomas",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I do not like- Engine CMI for acceleration from standstill (changing engine air filter does help abit) \n- JVC HU doesn't support ï£¿ CarPlay (sian but will not spend extra $& to zhng this, basic wireless bluetooth good enough for me atm)\n- Headlights not white...(planning to zhng)\n- No Daytime Running Lights (planning to zhng with Aliexpress ordered ones)\n- Had to take the min $40k loan + AIG insurance from C&C",
        "user_name": "s_venkatesh78",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "ReviewMade a big decision to buy the Mitsubishi Attrage after a long consideration. Given the high living costs, Attrage is just right for my wallet.\n\nCompetitive market pricing: 59k for the Modern variant now. Annual Depreciation at 5k+ is a wow!\n\nAftersales services: Purchase price came with service credits for me to buy plans to service the ride regularly. Bought the 2 year Diamond service plan for a start. A peace of mind on maintenance! Booking/amending service appointments is also a breeze too with the new C&C mobile app.\n\nDrive: Being light-weight at 940kg, it helps for a smoother ride with 1.2 engine. Power during cruising is brilliant, just abit sluggish when it comes to moving off from stationary. Not much of an issue here since our roads here are heavily used during peak hours and car speed is low. Helps keeping within roads' speed limit for safety is first.\n\nFuel efficiency: Pretty satisfied with the fc of the car. Able to cover up to 700km on a full tank! Being a light footer and driving in a mix of expressway & non-expressway roads, this definitely helps. Average of 18-20km/L for me.\n\nComfort: Rear space is big and comfortable. Still have plenty of leg room for passengers on the rear.\n\nFeatures: Many to name, my favourite being Cruise Control!\n\nLooks: Sporty sleek look with the sports kit for Style variant. Comes with shark fin antenna, rear boot lip spoiler, front and side skirting.\n\nParking is easy as Attrage is not big in dimensions. Great for tight spaces.\n\nA very value-for-money car! Highly Recommended!",
        "user_name": "lokeloh",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I likeAs above",
        "user_name": "gamester2007",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I do not likeNone so far",
        "user_name": "MarkerPen",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "ReviewI think Attrage is a good for a family with 3 to 4 people. It serves quite well in city road, but it would be quite weak when I want to pass other car on the freeway. Attrage only costs around 4.5L to 6 L for 100km so I satisfy with it.\nhttps://tinxemitsubishi.Com/2019/06/22/danh-gia-xe-mitsubishi-attrage/",
        "user_name": "value",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I likeSaving Fuel, good handle in city road",
        "user_name": "yishunite",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I do not likeSmall car, weak engine",
        "user_name": "Sksivapriya",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "ReviewPicked up this little thing as a 2nd car about 2 weeks ago and have been playing around with it on and off. Functions as the family's 2nd car, mainly driven by the wife.\n\nIf you manage your expectations, it's about as good as you can get for a value buy, Point A to B Japanese Sedan. The new 2019 Style body kit makes the little car look much much better than the older editions. And even for a 1.8m 80++KG guy who's definitely not on the thin side, the Attrage feels deceptively roomy on the inside despite it's actual size.",
        "user_name": "Icecube7",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I likeThe new Bodykit gives the car a better look\nCheap (July 2019 Pricing)\nFuel Economical\nComes stock with Front & Rear Cameras (Though you have to nag your SE to enable the parking mode)\nFeels surprisingly roomy on the inside despite it's actual size.\nWell thought out cabin fittings",
        "user_name": "Gdragon2004",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "What I do not likeDoes not come with rubber mats\nNoisy powerless engine\nThin sheet metal evident everywhere\nRather lazy cheaped out Engine bay \nNo rear cabin lights\nDid I mention that the engine is a noisy powerless thing?",
        "user_name": "DanriickSeah",
        "car_name": "Mitsubishi Attrage",
        "brand": "Mitsubishi",
        "price": "$63,999 "
    },
    {
        "review": "ReviewWent for a test drive of the vehicle and was pleasantly surprised by the space in the tiny package. This however also emphasized the spartan state of the interior. When they said it was fuss-free.. It really means it's not for the fussy. \n\nMoving off I had the biggest revelation. Being almost agricultural, the vibrations and idol and drone from the engine makes for a very un-enthusiastic and strained start. Almost felt like I was hurting the engine trying to push it over the speed hump. Maybe a tad bit of exaggeration there but it really is quite a stark contrast with a similar vehicle that I tried earlier that day. \n\nOn the upside, 6 airbags. Which is quite the assurance needed considering the vibe from the vehicle. Think it was hard not to reconsider the vehicle especially for those on a keen budget or looking to downsize. However can't help but look over at the Attrage at the showroom floor. Awkward boot aside, it has that added space for when needed.",
        "user_name": "Mengster",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    },
    {
        "review": "What I likeValue for money, slightly spunky looks. Almost sporty. Turns on a dime.",
        "user_name": "Itachino",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    },
    {
        "review": "What I do not likeNoise, Vibrations, Strain from gutless engine.",
        "user_name": "Brass",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    },
    {
        "review": "ReviewA small Japanese car affordable and economy to your wallet , most importantly Mitsubishi is a well known market brand that you can stick to",
        "user_name": "Tay86",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    },
    {
        "review": "ReviewCaveat-never tested this car before so I gave average for handling and engine performance.\nI came upon this car during the Cars@Expo.\nBefore I sat into the car, I was told that this is a very spartan and basic car.\nHowever, I was pleasantly surprised as this car was not at all spartan as it has many features that are not supposed to be found on budget cars like this.",
        "user_name": "Mervynwm",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    },
    {
        "review": "What I likeFeatures \nStart stop system,keyless entry and auto air conditioning \nShould be fuel efficient \nSafe when compared to cars of this size\nBrand name for assurance (depends)\nBuilt quality(as compared to some other car of its same size.)\nPracticality",
        "user_name": "mazdafever",
        "car_name": "Mitsubishi Space Star",
        "brand": "Mitsubishi",
        "price": "$65,999 "
    }
]