[
    {
        "review": "ReviewAfter 2 years of ownership, i find that this car is kind of okay i guess... \nI own the pre-facelift 2.0 litre model. Overall, a really comfortable and well-insulated car, though lacking a bit in features. However, fuel consumption is quite bad, i am a light-footer and average around 650km per tank. I also do not like the nissan-renault alliance, comprimises nissan's reliability as french cars are nortorious for breaking down and have expensive parts. The design of the car is quite attractive too, though this is another factor of french cars. So far, no issues/problems mechanically and i hope that lasts, would not want to fork a fortune on repairs. Only time will tell.",
        "user_name": "BenLim00",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I likeLED headlights- though not as bright as most cars, such as the vezels', the range is significantly longer than other cars.\n\nIndependant multi-link rear suspension- Ride comfort is excellent.\n\nCabin insulation is excellent too, quiet even at high speeds.\n\n6 airbags, heavy weight of car- Good safety.\n\nDriver's cockpit- Though the gauges are analogue, they do look nice and the animations are cool too.\n\nInterior design and materials- Soft-touch plastics, leather and cushioned paddings make the car feel premium and conti-like. Very comfortable.\n\nEngine performance- Acceleration from standstill is impressive, great amount of torque. \n\nDoors- Heavy, feel solid, increased safety.\n\nMetal roof rails- Can throw lots of barang barang on top.\n\nFew electronics- Less things that will break and less expensive to maintain.\n\nFactory-fitted leather upholstery- Seat comfort is one of the very best.\n\nSpare tyre - Spare tyre will always be better than those tyre repair kits. More protection too in a rear-end collision.\n\nBoot space- 430 litres with seats up, more than enough for barang barang.\n\n2.0 litre model has less issues/problems than 1.2, as seen from forums.\n\nN.A engine. Best for reliability. Turbos are more unreliable and more expensive to maintain.\n\nHigh ride Height- Better field of vision and high humps like the 1 at JB's woodlands checkpoint no longer hits my suspension, which tortured my previous car.\n\nHill start assist- Won't langa other people's car on inclines and i have about 3 seconds to look at other people.",
        "user_name": "jackkoh20",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I do not likePrice- Overpriced tbh... maybe 5K less still alright.\n\nHeated seats- great for the UK or europe. Not at all for us, should be replaced with a much needed safety feature such as AEB or BSM or something else like ventilated seats.\n\nMoonroof- Great for nights, not so when the sun is out. A pain to keep spotless as it is made of glass. Rarely opened, but honestly, i don't mind having it.\n\nStock Brakes produce a lot of brake dust- a huge pain to keep clean, already swallowed 15 bottles of sonax wheel cleaner, which ain't cheap.\n\nStock 19 inch alloy wheels- Look great, flashy. But Way too big for me, greatly affects fuel consumption and ride comfort badly. Normally used only on sport vehicles. Swapped to 17 inch.\n\nNO alarm???- Jesus christ, no thief would be stopped by just a immobiliser.\n\nLack of safety features- Only have ESP and ABS, whaaat? Come on...\n\nStock local headunit is quite bad- Poor Fm reception, laggy gps interface. Sound quality so-so. Would not mind paying a few extra grand for the original.\n\nLacklustre performance at high speeds- Trying to overtake at high speeds is difficult, rev high but speed hardly increases.\n\nCVT- Nissan's CVTs have a bad reliability reputation, as shown by scotty kilmer. Rubberband effect also squeezing me.\n\nNissan-french co-developed engine- Kiss goodbye to reliabilty when the french are involved and say hello to hefty repair bills. But the russians say it is a good motor, if it can survive russia, i think it will do fine.\n\nStock horn- Sounds like the ones on barbie jeeps played by children. Soft too. Safety affected, swapped with Hella ones.\n\nBody roll is evident even during minor turns but i can live with it.\n\nRain sensor- Seems lazy, sensitivity all over the place, sometimes wipers slow like turtle, sometimes faster than light, adjust sensitivity here and there but still cannot get the 'sweet spot'. Somewhat prefer manual ones.\n\n1.2 litre model has DRLs but 2.0 litre does not??? :/ Oh well, save more battery. :)",
        "user_name": "Pawancha",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "ReviewMy previous cars were Toyota Camry 2.4 and Volvo s70. \n\nI test drive Qashqai 1.2 1.2 DIG-T premium with a friend who was then driving a Volvo XC60.\n\nWe were both surprised by its overall performance, premium interior, features,  and good looks. Best, it's houses a low 1.2T engine.... Yet powerful enough, with road tax at $500 for 12 mths and low insurance premium.\n\nWe, both being used to higher cc powered cars, ended up loving the test drives. We both placed ours orders. I took a white, my friend's red on 28/6/2018 for imm delivery and trade-in our cars. SR Vivien gave us max discount.\n\nSo far, the QashQai 1.2T has not disappoint us. Still very happy and glad today.",
        "user_name": "Samsy",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I like- premium interior\n- premium features such as realtime tyre pressures, fuel consumption, reverse camera & sensor.\n- handsome & sturdy looks\n- 1.2T engine but works more like a 1.8 engine\n- steering wheel's smooth feel & handling\n- 5 years warranty\n- 3 years free services\n- low road tax & insurance premium\n- low fuel consumption\n- roomy cabin",
        "user_name": "BenLim00",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I do not likenone",
        "user_name": "Jansen_ee",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "ReviewWith the low COE, went to test drive drive the 2.0 L model .. My first experience with an SUV after years of driving sedans of many makes.\n\nWas initially OK with the car's interior and handling, but along the way I found many quirks that I think I will have issues with if I own this car..",
        "user_name": "ervintay",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I like- External styling looks solid\n- High and spacious driving position\n- Not too bad interior finishing",
        "user_name": "JimTan",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I do not like- The proximity sensors is strangely engineered.. it takes over your multimedia system when there is a near object e.g. when stopping at traffic light and a M/C stops beside the car, the alarm will sound off continuously and the screen will switch to display the warning from the alarm system, blotting out whatever was on your screen (e.g. Nav map), and it will only be restored after the proximity objects gets out of the way.. \n - Some low pitch noises from suspension when going over humps.. sounds like bushing problems I faced with my previous Nissan.. probably demo unit that's why\n- Some rattling from inside cabin, and also from dash.. demo unit?\n- The auto emergency brake system sometimes come on unexpectedly.. once there was a slightly high road hump, and it braked! Sales rep said this is how its supposed to work.. but gave me a bit of anxiety when approaching the next high hump..\n- The front blind spot is pretty bad.. difficult to gauge the kerbs in front at tight corners.\n- Air con at times automatically switches to \"fresh air\" even when it was put to internal circulation.. SR was probably right saying maybe it’s a safety feature to ensure enough oxygen levels.. but not when there is a black smoke-spewing diesel lorry right in front of you ha ha.\n- Checked the real world fuel consumption.. looks pretty far from that stated in brochure\n- I personally don't like the feel of the car with the CVT.. does not give that \"kick-down\" feeling and acceleration with the auto gearbox like DSG or Aisin..\n- The \"thin looking\" 19 inch tyres makes the car look like it’s on stilts from the rear.. I \n also read in some car forum pages that its difficult to source for 19 inch tyres of the 225 spec.. also more expensive compared to others..",
        "user_name": "ZHANG-WEI",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "ReviewHad this 2.0 litre for about 3 years. Overall, a good car let down by cabin rattles and reliabilities. Had several cabin rattles, after several rectifications, rattles still return. Biggest disappointments are reliability. These include:\n \n- engine shuddering under hard acceleration, this led to CVT overhaul\n- suspension bushing noise, this was ratified\n- after disengaging parking brake, random knocking noise when driving off \n- (latest) steering motor grinding noise, still awaiting parts.\n\nMy service technician has been kind to address the above issue, but the countless trips to service center is a hassle. Had owned Honda, Benz, this Qashqai is unfortunately the most problematic.",
        "user_name": "JohnTan_180232",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I like- stable car\n- nice design\n- nice features",
        "user_name": "desmondwyson",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I do not like- below average reliabilities \n- poor torque when accelerating from stationery.",
        "user_name": "JttyNToberhead",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "ReviewOwned the 2014 or pre-facelift 2.0 litre model for about 1 year now. Previous ride was a 2006 Toyota Yaris, was very reliable, no problems at all for 9.5 years. Decided to upgrade as family needed a larger ride. Initially wanted to get a Wish but decided against it as it had very few features and the styling looked very dated. Went for the 2.0 litre NA model as i will never ever buy a TC car in my life, turbos do not last and they require high maintenance. Recently went on a trip to Genting, car was extremely stable even at 160km/h, sound insulation was excellent too, barely a whisper. Car breezed up the mountain easily, 3000RPM was enough for even the steepest areas, unlike the yaris, which kind of struggled to get up the steep gradients, had to rev up to 4500RPM constantly. Fuel economy ain't that great, averaged about 10-12km/L, yet still acceptable as the car weighs like 2 tons. However, overtaking requires planning as the 2.0 engine feels lacklustre at high speeds, acceleration from stop is excellent though, really strong torque but peaks out around 100km/h, similar to a tesla but does not really bother me, i can live with it. Boot space is great, the leather seats are really comfortable, moonroof is kind of useless though, usable only at night as it's just too warm during the day. One feature i hate is the heated seats function, great for the UK or europe but obviously redundant here. Overall, still a great family car. Pricing is kind of steep though.",
        "user_name": "Clanceroy",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I like- Great exterior and interior styling.\n- High Stability.\n- Excellent Sound insulation.\n- Excellent build quality.\n- Strong torque from engine, more than enough HP.\n- Large moonroof.\n- Loaded with features.\n- Great comfort and ride quality.\n- Ride height.",
        "user_name": "Deen80",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "What I do not like- Heated seats function is useless.\n- Original antenna ruins the outlook of the car, shark fin would be better, facelifted model gets it though.\n- Suspension feels sensitive at times, though ride quality is still excellent.\n- Car could do with more safety tech, like blind spot monitoring.\n- Stereo unit is not the original, GPS lags and is slow. No around view monitor.\n-Motorized moonroof sunshade, prefer manual as it will spoil eventually.",
        "user_name": "giraffey99",
        "car_name": "Nissan Qashqai",
        "brand": "Nissan",
        "price": "$121,300 "
    },
    {
        "review": "ReviewFirst time gotten a hatchback in 20 years of driving, getting to like the smaller size. Bought a used DIG-S model with a small 1.2L supercharged engine which can deliver 72kW of power, so driving up the steep slope of Benjamin Sheares Bridge poses no issue at all. Speeding and overtaking is effortless on expressways as the Note produces the power when needed.\n\nCornering is not so stable, maybe attributed to a smaller base and higher centre of gravity. ECO mode does save on petrol per fill but each time the engine restarts, the \"Shivering\" Can be felt. Also, I wonder if too many start/stop over the years will damage the starter component...After all, such electrical/mechanical parts do wear out more over time with increased usage and if the money from petrol saved justify the component replacement, if that were to happen (maybe a Nissan Rep can re-assure customers on this aspect).\n\nNissan scored many positive points with the Note. Overall, it is a good car to own/drive.",
        "user_name": "RetiredDriver",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I likeFeatures factory-equipped:\n1) LCD touch panel with bluetooth connectivity\n2) Navigation app pre-installed\n3) Installed with front and back camera for reverse parking assist\n4) Firm and comfortable leather seats offering strong lumbar support\n5) 15\" stylish sports rim\n6) Locking can be done on left/right/back, making it really convenient\n7) No spare tyre so car is lighter and more fuel efficient (repair kit and air pump provided for emergency self-fix)\n8) Bright white halogen headlights\n9) Tinted glass\n10) Very spacious front and rear legroom, surprising for a hatchback",
        "user_name": "Jennicher",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I do not like1) Aircon goes off for too long in ECO mode and does not turn on until pedal is released - can get rather warm on a hot day (but aircon compensates with cold air fairly quickly once revolution kicks in)\n2) Aircon does not produce cool air on rainy days at the same calibrated temperature as on a hot day, probably because temperature difference with exterior is minimal at 1-2 degrees (my first such strange experience)\n3) Factory speakers sounded \"flat\" with no depth nor life to music\n4) Glove compartment flat and borderless; things can drop/slide off\n5) Fuel efficiency achieved is only about 11 km/litre rather than 20 km/l as claimed, considering I am a conservative light-footed driver",
        "user_name": "Datsun366",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "ReviewI have driven a Note# (2019 facelift version) for 3 months after my previous car retires. I don't understand why people say it is not good, it is affordable and it is hassle-free.\n \nWhen I test drive, this 1.2 car picks up faster than the Jazz 1.3 after traffic light. The steering wheel is lighter too. Some may say that it feels like a toy, but as a lady driver, I am ok with that. \n \nOne may ask is it worth it to pay another 5K for a Note# compared to the basic model? I say it is totally worth it, it looks so much better internally and externally!",
        "user_name": "MarkerPen",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I likeThe leg room for the back passenger seat is superb! Bear in mind this is a rather small car, but compare the leg room with a March or a Mazda 2 you will see. \n \nThe trunk is spacious, of course, I am not trying to compare it with Shuttle but yes, good enough.. oh btw I parked next to a Shuttle once, the 2 cars are about the same length.\n \nThe bonnet is short, i.e. easy to handle for me. Yet there is an extra piece at the nose that makes the hood looks longer than it is, more proportional to the car length.\n \nThe wheelbase is somewhat very long.. good for me, not so bumpy. It increases the turning radius to 5.2 (I think more like 5.5) from 4.4 of my previous drive, but it is ok, with the very-light steering wheel, I am still queen of u-turning.",
        "user_name": "Soreloser",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I do not likeThe engine is noisy as usual, like other Nissan small car models. \n \nThe rear windscreen is small. Above that the car frame is thick, so it blocks a bit my view of the 4 sides. I am thinking of installing extra mirrors already.\n \nThe rear passenger seat headrests are too high (even if I put it to lowest). Again they are blocking my view. \n \nI think you must turn on the sports mode for fast overtaking. I don't overtake very often and I have not driven many different cars, so I can only compare it to March (Elegance 1.4).",
        "user_name": "ervintay",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "ReviewNissan no te.\n\nDozo yoroshiku onegai.\n\nThe hand of Nissan says something.  Its affordable, fuel economical as well as environmentally friendly.\n\nSimple powerful hand of Nissan.",
        "user_name": "Homanfai",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I like1. The price.\n2. The package.\n3. The TC team.",
        "user_name": "Incubus22",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "What I do not likeCould have added more sweet add ons.",
        "user_name": "Fpchong",
        "car_name": "Nissan Note",
        "brand": "Nissan",
        "price": "$75,300 "
    },
    {
        "review": "ReviewThe Nissan X-Trail that I test drove is a typical Japanese SUV, and this car has the worst performance among all Japanese SUVs.\n\nThe comfort level is very good, as its suspension setup is soft and more towards comfort drive. This compromise on the drivability totally. The road holding is missing completely, because of its over soft suspension. The engine is underpower for a 2.0 engine, and make worst by sluggish CVT gear box.\n\nFor people who ask for little, X-Trial may be sufficient for them, but definitely not for me.",
        "user_name": "shuaigeai69",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I like1. Comfort",
        "user_name": "Suzeneka",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I do not like1. Underpower engine\n2. Sluggish CVT \n3. Body roll, body roll, body roll\n4. Soft brake",
        "user_name": "Bwilly",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "ReviewBeen driving another Jap 7-seater SUV for more than 3.5 years and looking for similar replacement. Test drive Nissan X-Trail recently (as well as few other Korean and Conti 7-seater mid-range SUVs). The exterior is average but interior feels posh especially the leather finishing and seats plus full sunroof. The 3rd row is slightly more comfortable than my current SUV i.E. Pre-teens and slim-built average height adults should be ok. Engine is expectedly less powerful than my existing (2.4L) and pick-up from 0-100KM/H is more than 11 secs. Loaded with new advance features. Price is attractive.",
        "user_name": "miloice",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I likeSlightly better than average 3rd row.\nGood interior finishing.\nPrice is reasonable.",
        "user_name": "opgamerkkhk",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I do not likeUnsure about reliability of new advance features as they are new.\nEngine performance e.g. power and pick-up, could be better.",
        "user_name": "Atrecord",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "ReviewHave been driving the Mitsubishi Outlander 2.4L for more than 3years. It starts to show its age, and explore looking at reasonable priced 7seater SUV around. X-Trail impresses me with the biege and luxury feel, rear air-con, 360 view, kick boot sensor, LED lights (front adaptor), the lumbar support (zero gravity seat), the passenger seat now comes with electronic adjustment. Some soft plastic, but with leather around. The full length sunroof is nice. \nThis car is to be drive at \"Leisure\" Pace, as it complaint when you push it. If you drive it like a sedan, but with extra 4WD, then it should suits you. The +2 third row barely can make it, only when you use it occasionally like me, than this car probably for you. \nThe current 2WD OL is now more affordable, less than $110k, the X-Trail is consider more 10k.Will review more when I collect the car, info is based on test drive over two separate days.",
        "user_name": "Uranium2k",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I likeTons of features\n1) Full Length Sunroof\n2) Electronic seats for both front \n3) 360 view\n4) Kick boot release\n5) LED lights + adaptive\n6) 4WD when you need it",
        "user_name": "opgamerkkhk",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I do not like1) Power can be better\n2) Loud when you ram it\n3) Some plastic around interior\n4) Dont see easy to zhng the car in Singapore",
        "user_name": "fungyee77",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "ReviewI bought my X-trail almost 3 years ago in 2015 mainly because of the family needs, with a helper and wheelchair elderly and 2 kids. I needed a 3 row on a budget. Between Mazda-5 and X-trail, features, comfort and value for money was clear. There were not too many options then.\n\nThis car is my first CVT, anyone that enjoys responsiveness of traditional auto transmission is going to find CVT completely unnatural. Reving hard is so terribly noisy, you will naturally become lighter on your pedal.\n\nFurthmore, the FC on paper is impossible to reach, my daily drive is from east to central and then west.  Clocking only an averaging of 8kml.  Its really poor.  When I'm in a rush, and driving it hard, FC can easily hit below 5kml.  The car is heavy with the 4 wheel drive and there are significant roll. So, handling isn't fantastic, turning radius is huge.\n\nI have sold this car now that I have no helper anymore. We don't need the extra row and pay premium for a boring but comfortable drive.  Looking forward to a more compact and responsive drive.",
        "user_name": "CarLover1001",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I like1) I have grown to love the 360 view, it is so important to have this, makes parking so much safer for drivers to look out for pedestrians crossing at blindspots.\n2) the Panoramic sun roof is just so less clusterphobic for the second row passengers.\n3) value for money in terms of features\n4) in build GPS is very useful.",
        "user_name": "Pocy",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I do not like1) Poor FC\n2) Reliability of the aircon is suspect. Since the last servicing, the aircon just suddenly got warmer, tilll a point, it is just warm air on a hot day.  The dual climate control was clearly blowing much warmer air on the drivers' side. It was 20 degrees for the driver's side and 25 degrees on the left, yet, it felt cooler on the left.  I finally sent it for the 50k servicing, the diagnostics was that the cold gas was low and they top it up and perform few hours tests and found no leak.  To me, this is not an acceptable explanation. If there isn't a leak, why would the cold gas gone so low in just bearly 3 years.  I smell some BS by their mechanic here. My confidence on their maintenance falls greatly with the aircon issue.\n3) I am not a big fan of electronic controls for the seats, the good old manual levels are less luxurious but much more functional and practical.\n4) the infotainment system is llaggy and rather buggy. Through the servicing, i think they have updated the firmware as I have seen some bugs disappear after initial servicing. Occasionally, the bluetooth call controls are just screw up and the only way is to restart the unit.",
        "user_name": "relaxdriver",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "ReviewDoes nothing outstanding in its class. Loses out in space to the tiguan,crv but bigger than cx5 and 3008.Reasonably cheap enough, tc se offered 124k. Must say pretty underpowered, only 3 people in car, floored the accelerator, though little vibration,the cvt is poorly calibrated and has  a lot of improvement to be done. The best cvt is subaru but their interiors are meh. Back to the x trail,the seats are very gimmicky but feels okay... Even the tiguan has better seats and much bettter ergonomics, obvioulsy poor in this car. Dont have any reason to go for this car unless you are a hardcore nissan fan??????Why??",
        "user_name": "Little_prince",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "What I likePano roof\nOrange colour looks good with white/beige interior\nboot seats compared to others that dont even offer",
        "user_name": "Ivantanjh",
        "car_name": "Nissan X-Trail",
        "brand": "Nissan",
        "price": "$134,300 "
    },
    {
        "review": "ReviewFor the people who love speed, this is the car that has definitely popped up in your list of to buy car lists. It is true that the GTR gives speed and this is what many people have come to love and enjoy. If you are looking for a performance standard car but cant seem to afford the Ferrari or Lamborghini range, this is the car to buy. Within the car, you get the speed comparable to a Ferrari GTC4LUSSO T with a relatively incredible exterior styling.  So much being said, I would not elaborate in the below",
        "user_name": "DdCarReviewerSG",
        "car_name": "Nissan GTR",
        "brand": "Nissan",
        "price": "$592,500 "
    },
    {
        "review": "What I likeSpeed\nExterior Styling\nPrice Tag\nEngine\nSteering wheel\nSeats",
        "user_name": "Akiyo",
        "car_name": "Nissan GTR",
        "brand": "Nissan",
        "price": "$592,500 "
    },
    {
        "review": "What I do not likeFuel Efficiency\nReliability of Nissan Performance cars not leisure cars",
        "user_name": "jdmrockz",
        "car_name": "Nissan GTR",
        "brand": "Nissan",
        "price": "$592,500 "
    },
    {
        "review": "ReviewFirst time gotten a hatchback in 20 years of driving, getting to like the smaller size. Bought a used DIG-S model with a small 1.2L supercharged engine which can deliver 72kW of power, so driving up the steep slope of Benjamin Sheares Bridge poses no issue at all. Speeding and overtaking is effortless on expressways as the Note produces the power when needed.\n\nCornering is not so stable, maybe attributed to a smaller base and higher centre of gravity. ECO mode does save on petrol per fill but each time the engine restarts, the \"Shivering\" Can be felt. Also, I wonder if too many start/stop over the years will damage the starter component...After all, such electrical/mechanical parts do wear out more over time with increased usage and if the money from petrol saved justify the component replacement, if that were to happen (maybe a Nissan Rep can re-assure customers on this aspect).\n\nNissan scored many positive points with the Note. Overall, it is a good car to own/drive.",
        "user_name": "RetiredDriver",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I likeFeatures factory-equipped:\n1) LCD touch panel with bluetooth connectivity\n2) Navigation app pre-installed\n3) Installed with front and back camera for reverse parking assist\n4) Firm and comfortable leather seats offering strong lumbar support\n5) 15\" stylish sports rim\n6) Locking can be done on left/right/back, making it really convenient\n7) No spare tyre so car is lighter and more fuel efficient (repair kit and air pump provided for emergency self-fix)\n8) Bright white halogen headlights\n9) Tinted glass\n10) Very spacious front and rear legroom, surprising for a hatchback",
        "user_name": "Jennicher",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I do not like1) Aircon goes off for too long in ECO mode and does not turn on until pedal is released - can get rather warm on a hot day (but aircon compensates with cold air fairly quickly once revolution kicks in)\n2) Aircon does not produce cool air on rainy days at the same calibrated temperature as on a hot day, probably because temperature difference with exterior is minimal at 1-2 degrees (my first such strange experience)\n3) Factory speakers sounded \"flat\" with no depth nor life to music\n4) Glove compartment flat and borderless; things can drop/slide off\n5) Fuel efficiency achieved is only about 11 km/litre rather than 20 km/l as claimed, considering I am a conservative light-footed driver",
        "user_name": "Datsun366",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "ReviewI have driven a Note# (2019 facelift version) for 3 months after my previous car retires. I don't understand why people say it is not good, it is affordable and it is hassle-free.\n \nWhen I test drive, this 1.2 car picks up faster than the Jazz 1.3 after traffic light. The steering wheel is lighter too. Some may say that it feels like a toy, but as a lady driver, I am ok with that. \n \nOne may ask is it worth it to pay another 5K for a Note# compared to the basic model? I say it is totally worth it, it looks so much better internally and externally!",
        "user_name": "MarkerPen",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I likeThe leg room for the back passenger seat is superb! Bear in mind this is a rather small car, but compare the leg room with a March or a Mazda 2 you will see. \n \nThe trunk is spacious, of course, I am not trying to compare it with Shuttle but yes, good enough.. oh btw I parked next to a Shuttle once, the 2 cars are about the same length.\n \nThe bonnet is short, i.e. easy to handle for me. Yet there is an extra piece at the nose that makes the hood looks longer than it is, more proportional to the car length.\n \nThe wheelbase is somewhat very long.. good for me, not so bumpy. It increases the turning radius to 5.2 (I think more like 5.5) from 4.4 of my previous drive, but it is ok, with the very-light steering wheel, I am still queen of u-turning.",
        "user_name": "Soreloser",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I do not likeThe engine is noisy as usual, like other Nissan small car models. \n \nThe rear windscreen is small. Above that the car frame is thick, so it blocks a bit my view of the 4 sides. I am thinking of installing extra mirrors already.\n \nThe rear passenger seat headrests are too high (even if I put it to lowest). Again they are blocking my view. \n \nI think you must turn on the sports mode for fast overtaking. I don't overtake very often and I have not driven many different cars, so I can only compare it to March (Elegance 1.4).",
        "user_name": "ervintay",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "ReviewNissan no te.\n\nDozo yoroshiku onegai.\n\nThe hand of Nissan says something.  Its affordable, fuel economical as well as environmentally friendly.\n\nSimple powerful hand of Nissan.",
        "user_name": "Homanfai",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I like1. The price.\n2. The package.\n3. The TC team.",
        "user_name": "Incubus22",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "What I do not likeCould have added more sweet add ons.",
        "user_name": "Fpchong",
        "car_name": "Nissan Note(Parallel Imported)",
        "brand": "Nissan",
        "price": "$70,000"
    },
    {
        "review": "ReviewElgrand is build with good interior luxury, great passenger carrier if you have a driver that fetches you everywhere",
        "user_name": "alym",
        "car_name": "Nissan Elgrand",
        "brand": "Nissan",
        "price": "$175,300 "
    },
    {
        "review": "What I like- nice interior\n- very spacious\n- easy to handle steering wheel considering it's megasize\n- thoughtful in design, height internally to make passenger very comfortable\n- great people mover vehicle (if you are not in a huge rush)\n- nissan offered 5 years unlimited warranty \n- compared to Alphard, it is quite value for money for the same type capacity",
        "user_name": "moki",
        "car_name": "Nissan Elgrand",
        "brand": "Nissan",
        "price": "$175,300 "
    }
]