[
    {
        "review": "ReviewOpel is a super under value car, it's great and the price is about the same as a korean car but you get continental touch. It's like driving a volvo but at half of it's price.",
        "user_name": "Wlee",
        "car_name": "Opel Insignia Grandsport",
        "brand": "Opel",
        "price": "$142,777 "
    },
    {
        "review": "What I likeprice",
        "user_name": "ErChianKong",
        "car_name": "Opel Insignia Grandsport",
        "brand": "Opel",
        "price": "$142,777 "
    },
    {
        "review": "What I do not likecost of parts",
        "user_name": "Justauser",
        "car_name": "Opel Insignia Grandsport",
        "brand": "Opel",
        "price": "$142,777 "
    },
    {
        "review": "ReviewOwn the car for 3 months now and drove close to 8000km. So far, it is very comfortable, good and sharp handling despite its size. I got the diesel variant so every full tank give roughly 1000km. Spacious at the back, so it has fair amount of leg room. Boot is big too! \n\nDefinitely a big upgrade to the Altis and Mazda 3 i was driving \n\nReally pretty car, many people turn their heads to have a 2nd look. I guess it is also not common, so it add to the uniqueness",
        "user_name": "opgamerkkhk",
        "car_name": "Opel Insignia Grandsport",
        "brand": "Opel",
        "price": "$142,777 "
    },
    {
        "review": "What I likeSafety features - value for money \n\nStyling - very chio\n\nGood FC - especially now fuel $$$ is going up\n\nSpace - enough to be comfortable",
        "user_name": "InsigniaOwner",
        "car_name": "Opel Insignia Grandsport",
        "brand": "Opel",
        "price": "$142,777 "
    },
    {
        "review": "ReviewLove this car after 1km drive.. Especially the dancing light when starting the car.. It is so cool .. The adaptive auto light make drive in dark area a real advantage.. It is really cool ! Https://www.Youtube.Com/watch?V=owyhVex_2Bc\n\nother feature like handfree auto tailgate ( good for my wife getting groceries , anti head collusion  , auto parking featues.. Well i use to think i dont need all this kind of feature, why i need to get it.. But after i got it.. I feel cool.. After all we are paying the highest car price on earth.. Why not maximise it !",
        "user_name": "Saggi",
        "car_name": "Opel Grandland X",
        "brand": "Opel",
        "price": "$149,777 "
    },
    {
        "review": "What I likeadaptive lighting , hand free auto tailgate ,antii headon collusion\nunique , sleek design on same peugoet 3008 platform.\nwidest SUV in this mid cat series , High OMV , 19\" sport rim , memory seat , ventilated seat useful during hot days , seat extension for thight support.",
        "user_name": "Wormee",
        "car_name": "Opel Grandland X",
        "brand": "Opel",
        "price": "$149,777 "
    },
    {
        "review": "What I do not likeno adaptive cruise control which present in Insigma. AC not as cold , maybe due to indoor size compare to saloon. need adjust below 20C to be cold..  knob level adjustment for passenger seat . lack of space to put junk stuff..",
        "user_name": "Saggi",
        "car_name": "Opel Grandland X",
        "brand": "Opel",
        "price": "$149,777 "
    },
    {
        "review": "ReviewInterior build pretty good since it is german, 1.4T though good power,no where close to the vw group 1.4T seen on the much more spacious touran. During test drive, ride pretty noisy since car old model, shoukd just go for the touran ,cheaper some more.",
        "user_name": "opgamerkkhk",
        "car_name": "Opel Zafira Grand Tourer",
        "brand": "Opel",
        "price": "$138,777 "
    },
    {
        "review": "What I likeSe very patient, no rush\nGerman build quality\n5 year free servicing",
        "user_name": "Goodman",
        "car_name": "Opel Zafira Grand Tourer",
        "brand": "Opel",
        "price": "$138,777 "
    },
    {
        "review": "What I do not likeSpace, interior not as spacious as something like the vw touran\nEngine and ransmission,slow to respond much slower than touran\nlooks old,rims bad design, those on touran although also 17inches looks nicer with multi-spoke\nNo place to store tonneu cover/parcel shelf, need put on the floor of 2nd row or hold on to it as proposed by SE, good job opel NICEE PACKAGING!!!!!!!!!!\\\n\n\n\n\nIn conclusion,go for touran if looking for 7 seater, if not the mazda 6 is great value",
        "user_name": "axiom",
        "car_name": "Opel Zafira Grand Tourer",
        "brand": "Opel",
        "price": "$138,777 "
    },
    {
        "review": "ReviewI have start driving Zafira A since 2002, and follow by Zafira B in 2007, and decide to change to Zafira C (Tourer) now.  It’S more stylish and upmarket than previous Zafiras.  After taking off the COE, the car cost that  I pay now and then, a diff of about $6k (include 2 year/40000km free service which I do not have previously), which I think is worrh.  As I do not try to speed up when lights turn green or always needs to overtake others, the engine performance for me is acceptable as well.The Zafira Tourer is enjoyable to drive, with well weighted steering and minimal body lean in corners.",
        "user_name": "RTOPEL",
        "car_name": "Opel Zafira Grand Tourer",
        "brand": "Opel",
        "price": "$138,777 "
    },
    {
        "review": "What I like1. The 3rd row seat setup is easier now.\n2. More storage compartments.\n3. Safety features like  blind spots alert. Where fitted, parking sensors are a welcome addition.\n4. Commanding view and access to a modern and ergonomic cockpit that is neat, logical and fuss-free.\n5. Lower road tax.",
        "user_name": "RTOPEL",
        "car_name": "Opel Zafira Grand Tourer",
        "brand": "Opel",
        "price": "$138,777 "
    }
]