[
    {
        "review": "ReviewQA better than Proton company. Satisfy with the car. Smooth drive. Interior is big enough for a family. Boot is big.  Exterior design is nice.  Of course , feature and performance , cannot compare with experience car. This car is good enough for family ,  travel A to B.  Keyless , Toyota engine, chain  timing belt. Value for money. Low road tax",
        "user_name": "Commonppl",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I likeSimple with satisfactory design. Radius is small. Easy to park. Price is reasonable with simple feature and performance.",
        "user_name": "MarkerPen",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "ReviewTest drove the 1.3A version a few years back when the COE was skyhigh. I was comparing it with the Attrage and I must say that this had a better overall package in terms of engine performance and refinement.\n\nThe engine is sourced from Toyota with VVT-i technology and being a 4 cylinder engine, it is much smoother with better power than the 3 cylinder from the Mitsubishi Attrage. 93bhp/121Nm in the Bezza plays 79bhp/106Nm in the Attrage.\n\nThe gearbox is a regular torque converter which provided better acceleration compared to the CVT in the Attrage.\n\nCabin space is similar in both vehicles.\n\nSpare parts are a breeze to find over the causeway.",
        "user_name": "Commonppl",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I like- Toyota engine with modern technology\n- Regular torque converter gearbox\n- Better drive than the Attrage\n- Spare parts are cheap",
        "user_name": "_Sam_",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I do not like- Reliability is an unknown\n- Looks aren't great but then again, the Attrage is no looker too",
        "user_name": "war_virus",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "ReviewFirst time, tested drive the car. The CS is friendly. Turning a radius and parking is easy. After do a comparison with Attrage.  Decide this car. Though, basic features. It is good enough to travel point A to B. Boot space is spacious. Engine is from Toyota. Keyless ignition, etc. More features, later end up more expensive maintenance. Some spec, Bezza better than Attrage.",
        "user_name": "wayne221",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I likeMini sedan\nKeyless",
        "user_name": "pangsh02",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I do not likeWill drive more to comment",
        "user_name": "lekite",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "ReviewBeen driving this car for almost 3 months now and at 3000 km. This is one of the most fuel efficient cars I have driven. Fell in love with this car after trying it and the Mitsubishi Attrage. I bought the MT variant because of my love for MT. Although this car is devoid of most luxury items, the car will cover most of your basic needs and still provide decent performance.",
        "user_name": "nghongyeong",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I like1) Fuel efficient - easily 15-16km/L (depending on how you drive if its MT)\n2) Huge boot space\n3) Reasonable price tag (for a car sold in SG)\n4) Can camouflage your car and buy spare parts if you visit Malaysia often\n5) Responsive clutch\n6) Reliable engine (from Toyota)\n7) Decent performance - won't hear the engine straining when carrying 3 passengers (excluding driver) going up a steep hill",
        "user_name": "Nemsis",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I do not like1) Poor sound insulation - probably have to shout to be heard in the car during a heavy downpour/travelling on the highway\n2) Narrow gear ratio between 2nd and 3rd gear\n3) Small rims (alamak, stock rims at 14\" tak boleh la)\n4) Narrow and high body - feels like the car is going to turtle turn when cornering at higher speeds",
        "user_name": "BabyStar",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "ReviewGot this Bezza since April 2017 and i must say this is one under-rated vehicle. It's been more than a year and my average FC is 18.44km/litre. Best was 19.7km/litre and worst was 16.5km/litre. VVTI is a great improvement from my previous Kelisa with a smoother stick shift action. The gear ratio set up is as good as it gets.. Depending on your driving habits. Other perks are the push start engine, generous leg and boot space, small turning radius, front and rear sensors and smart locking mechanism. Ie; You'll never be able to lock your car with the keys inside it.",
        "user_name": "Carnoob",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I like1. small turing radius\n2. fuel efficient\n3. generous leg/boot space\n4. quiet engine\n5. ideal gear ratio\n6. one touch signal\n7. front and rear sensors\n8. spare tire is similar to the ones on the car. you don't get those ridiculous puny scooter tire as spare. \n9. the car actually looks good IMO.",
        "user_name": "Overthere",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    },
    {
        "review": "What I do not like1. wipers do a terrible job\n2. under carriage has zero noise insulation\n3. manual folding side mirrors\n4. no arm rest \n5. matt silver portion of the steering wheel not durable. maybe my thumb skin too thick. XD\n6. sides of the boot panel (that piece that covers the spare tire) is made of soft fabric\n7. interior sides of boot is hollow. don't smash your luggage or it'll bend inwards.",
        "user_name": "Kurty",
        "car_name": "Perodua Bezza",
        "brand": "Perodua",
        "price": "$63,800 "
    }
]