[
    {
        "review": "ReviewI own Renault Grant Scenic for one year. Overall Experience and Renault service experience was good. \n\nLong drive gives good road grip and smooth ride experience. \n\nOverall I recommend the car but day-time Air-con is not good. \nAfter service also Air-con cool remains with same problem on day time.",
        "user_name": "ismailraja",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "What I like* Good Engine Power\n* Excellent service from Renault Service Engineer (Dennis)\n* Enough Inside space for big family\n* Good Road grip during long drive",
        "user_name": "furprice_extra",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "What I do not like* Poor Air condition during day time\n* Intermittent Dashboard blank screen. \n* Mileage full tank is 600KM not 1200 KM.",
        "user_name": "Soreloser",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "ReviewRecently collected this car with a friend and got a chance to try it. \nThe ride is true conti comfort. The diesel engine is a bit noisy, but decent performance. \nThe besr part is the exterior outlook, very unique in a world of me too cars. \n\nNow comes full disclosure and just one huge issue which I told the SE also: I will not buy this car, as I previously owned another Renault. Not old model mind you, 2016 car and it gave me so many problems from gearbox to electrical to rattling noises to engine whining. I was glad to eventually get rid of it, losing a lot of value in the process. \nIn addition after seeing complaints of ABS, ESP, parking brake warning lights coming on on brand new Grand Scenic, I feel that French cars still have not to shake the reputation of the old days.\nParts take a long time to come in for my car, and also not cheap.\nBased on all this, I would think twice before putting money down unless I have money to burn, not just on repairs, but on depre which inevitably will be the worst of any cars.",
        "user_name": "yishunite",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "What I likeNice styling outside. Comfy interior, decent performance.",
        "user_name": "opgamerkkhk",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "What I do not likeReliability, reliability, one word, reliability.",
        "user_name": "mazdafever",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "ReviewAlmost put my money into getting the Grand scenic. Lots of things that I like about this vehicle. The reasons why I did not get it includes high road tax, and everyone I spoke to warned about expensive spare parts (even for the most slightest accident).",
        "user_name": "Laojiao",
        "car_name": "Renault Grand Scenic Diesel",
        "brand": "Renault",
        "price": "$109,999 "
    },
    {
        "review": "ReviewA spontaneous visit to the showroom over the weekend led to a pleasant discovery. The Renault Scenic turned out to be a well designed car that has been thoughtfully put together. During the test drive the car proved to be agile during turns and quick in its pick up. \n\nThe salesperson, Rinee, was also very helpful and not pushy. I was very impressed by her professionalism and she offered a very good deal. My wife was also impressed by Rinee and the car. \n\nThe potential low running costs due to the diesel engine and the sporty exterior design makes the Scenic a very attractive car.",
        "user_name": "scotch500",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    },
    {
        "review": "What I likePlenty of storage space \nSliding center armrest \nFrugality of diesel engine and good acceleration \nVisibility due to large windscreen \nSporty 20 inch rims\nSturdy feel typical of continental cars",
        "user_name": "wonderboxchow",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    },
    {
        "review": "What I do not likeNot really sure if there's potential problems",
        "user_name": "Seabreeze",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    },
    {
        "review": "ReviewBeen driving my new Renault Scenic 1.5T Privilege dCi (A) for almost 4 months now and I must say I love it more and more. \n\nThe trendy design (lemon yellow with panoramic sun-roof) couple with excellent fuel economy and many hi-tech equipment included is more than I have bargained for. I spent only about S$75 for diesel and it average 1,000+ km per full tank of 53 litres.\n\nAuto parking and auto real seat reclining are an added plus amongst other excellent features.\n\nThis is not a super fast car but it carry sufficient punch when I need it.",
        "user_name": "opgamerkkhk",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    },
    {
        "review": "What I likeThe trendy look.\nThe technology.\nIts frugal\nSufficient power with turbo built in",
        "user_name": "Hsjose",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    },
    {
        "review": "What I do not likeThe 8 inch infotainment needs to be better streamline and updated.\nDid a few upgrading but so far did not see any significant improvement.\nBack aircon vent air flow is a bit weak.",
        "user_name": "PingPing",
        "car_name": "Renault Scenic Diesel",
        "brand": "Renault",
        "price": "$102,999 "
    }
]