[
    {
        "review": "ReviewComing from a 1.2T CVT, Ateca 1.4T DSG feels like such a big improvement in responsiveness and drivability.  Always feel planted and in control even at high speed cornering or rain, thanks to the on demand 4WD.  \n\nThe TPMS (tyre pressure monitoring system) is really useful, once the tyre got a small nail and I was still able to drive normally without feeling puncture but the TMPS was able to detect leakage and able to point out exactly which tyre is leaking air.  The adaptive auto cruise is a joy for long distance drive, I even use it on ECP or AYE.  Auto hold is also useful at stop and also ensure you do not \"Creep\" Which is bad for DCT transmission.  The one problem I have initially is the car tend to veer to the left, but was solved after a few trips to the workshop, they were nice and helpful.\n\nI feel the best thing about the car is the 1.4T DSG engine/transmission which is the same as the more expansive VW Tiguan.  There is plenty of torque from 1500 RPM, most time the RPM stays around 1.5K-2K RPM for light footed drives.\n\nI have been driving Ateca for 8 months now, granted that the car is still new, so far there isnt any issues yet and I have driven into Msia for 4 times so far and stuck in immigration jams plenty, it has perform satisfactory.\n\nEvery day I look forward to driving coz it is a car that is really a joy to drive.",
        "user_name": "Weezersg",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "What I like1)  Nice clean design\n\n2) Alcantara seat is really comfortable\n\n3)  Interior mood lighting\n\n4)  Very responsive engine and smooth transmission\n\n5)  On demand 4WD\n\n6)  Spacious interior\n\n7)  360 degree camera view 2D and 3D",
        "user_name": "Lash15",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "What I do not like1)  Plain interior\n\n2)  Does not come with Park Assist  ( Arona has it )\n\n3)  Higher road noise than my previous car",
        "user_name": "starlord555",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "ReviewBuying a car from SEAT SG has been a Breeze. No frills, no hidden costs. Non guaranteed COE but they are sincere to get the bid almost guaranteed. (I had a bad experience with another German make, under PSA group, they either bid low or didn't even bid!)\n\nI'd recommend my SE Eamon, very patient and shares his views openly. Cheers.",
        "user_name": "Elaz",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "What I like- highly spec FR\n- loads of safety features\n- power, 4wd\n- almost feels like a hatchback, fun to drive\n- fuel economy is good for suv\n- straightforwardl dealer",
        "user_name": "Badieboy",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "What I do not like- nice if can include with park assist, sunroof, virtual cockpit.",
        "user_name": "Mervynwm",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "ReviewI started my hunt for my next car 3 months ago and finally settled on the Xcellence model. Have seen and test driven most of the SUVs  (Japs and Conti) within the $120K to $130K+ bracket and decided that this model offers the best features to price ratio. I do not find the ride to be overly firm as read from many overseas reviews , maybe due to the version we getting here uses multi-link rear setup instead of torsion beam for the 2WD version. Overall i feel the ride quality is well balanced.",
        "user_name": "bahomet",
        "car_name": "SEAT Ateca",
        "brand": "SEAT",
        "price": "$115,400 "
    },
    {
        "review": "ReviewTook this Arona FR model for a test drive. For driving performance, gas pedal was really responsive and i totally underestimated the 1 litre turbocharged engine! I tried hard acceleration (pedal literally down to the floor) when traffic light turns green and i can feel my body pushed further back to the seat as the turbo kicks in and effortlessly reached 80km/h. Didn't pick up any wind noise at 80km/h. One thing that is disturbing is the engine will have a small vibration for about half second as it accelerates and will noticeably stop when the turbo kicks in even when i move off gently. Guess it's the nature of this 3-cylinder turbo engines. Went around a roundabout and some sharp quick lane change and it proves to be very nimble, agile and doesn't feel 'floaty' on corners at all. Went over a few bumps and it handles well too. Not awesome but just good enough\n\nInterior wise, it's just meh. But I'm surprised that there weren't any handle bars on top of the window. Given how this thing drives on the road, i feel handle bars are mandatory apart from seat belts. Another  surprising thing is that there's no top light where the rear passenger is. I have a young kiddo who loves to throw things in the floor and will be a pain if we have to use a flashlight from our phone and search it especially night time (a big turn off for me). Infotainment system is dead awesome. Has both apple carplay and android auto. Park assist is awesome too though as drivers, parking on our own will definitely be faster. Boot space is not really that great. Probably can fit 4 bags for travelling. Probably just enough to fill in stuff for a family of 4.\n\nFor exterior, side mirrors are too small. Yeah yeah, there's blind spot monitoring to compensate for it but i still don't get it why thecside mirros have to be small and pointy and the far edge. Overall aesthetics is actually not bad. Love the look at the front and back. Doesn't look too rugged and sporty or luxurious.",
        "user_name": "blackouts",
        "car_name": "SEAT Arona",
        "brand": "SEAT",
        "price": "POA"
    },
    {
        "review": "What I like- the drive. Such power, it's disgustingly exhilarating and addictive.\n- road tax. Paying less than $500 for a car than drives better than a 1.8L? It's a no brainer!\n- infotainment system. \n- the price. A worthy contender to all compact SUVs.\n- passenger and driver seats are ergonomically good! Supports your whole hamstrings to the back of your knee. Means good for long distance traveling.\n- spacious. I'm surprised too! Huge leg room and head room!\n- good visbility to check blindspot effectively.\n- fatigue recognition.\n- front and back assist.\n- cruise control as standard\n- keyless for entry and ignition\n- part of the VW group.",
        "user_name": "donnyh",
        "car_name": "SEAT Arona",
        "brand": "SEAT",
        "price": "POA"
    },
    {
        "review": "What I do not like- no handle bars\n- no top light at rear passenger seat\n- boot more on the smaller side\n- small side mirror\n- hump in the passenger row\n- FR model comes in fabric seats as standard and does not have a pocket at the back of the seats. \n- no 24hr roadside assistance (major turn off)\n- 3+2 years warranty when others are offering at least 5+3 years and pretty much the standard. (another major turn off)",
        "user_name": "Ericwur",
        "car_name": "SEAT Arona",
        "brand": "SEAT",
        "price": "POA"
    },
    {
        "review": "ReviewI bought the FR version, Red with and Black top in Nov. So far so good, but still skeptical about the spare parts availability. The car is still new, and hope there is no need to find out too much though.",
        "user_name": "Benji7",
        "car_name": "SEAT Arona",
        "brand": "SEAT",
        "price": "POA"
    },
    {
        "review": "What I likeExterior: \nStylish exterior overall. Fierce headlights, sharp side mirrors.\n\nInterior:\nDashboard has leather trim, flat end steering, very comfortable front seats, overall design is very stylish, boot size is quite remarkable.\n\nFeatures:\nInfotainment system and dashboard is like the Volkswagen Golf, there are so many features in it I have not been able to figure out all even after 3 weeks. Adaptive cruise control, pedal shifter, auto-park feature, blind sport warning, CBTA... just name it, it has everything I can think of.\n\nDriving: \nVery acceptable road noise, very good acceleration for a 1.0 engine, gear changes are very smooth (but do not let it roll in D too much or the clutch may wear out sooner than expected, its a DSG), all controls are very intuitive, great height of an SUV, suspension is good for comfort, headlights are bright.",
        "user_name": "gamer2030",
        "car_name": "SEAT Arona",
        "brand": "SEAT",
        "price": "POA"
    },
    {
        "review": "Review3 months of driving the LEON for this review and feel its time to put some words in perspective.\n\nMost asked me what car were you driving and why downgrade? (Was driving a bigger engine TSI capacity and boot space before this....And I really wanted to carry on with a continental ride.) \n\nEven more honestly, I never intended to go with SEAT but I read the reviews online, watched the videos and looked up the car on Instagram- still wasn't 'wowed' over yet and then decided Why not give it a test drive...Nothing to lose right? \n\n\n*Cut short.....And I DID and I am GLAD and I am happy enough to put in a review.(my time is precious)\n\nThis car had been made real good-IMHO.",
        "user_name": "Blackflyz",
        "car_name": "SEAT Leon",
        "brand": "SEAT",
        "price": "$95,900 "
    },
    {
        "review": "What I likeMany things to like here.....\nbut my number 1 like is saving $$$.....so IT SAVES- Saves- saves me comparing to my previous ride...road tax/gas/insurance....etc.\n\nI can get 600km++ on driving this car...just use the better gas...\n1.0 liter engine? No way...it feels like it...\nEverything else - (keyless,rear a/c, push start/stop.)\n\nGreat interior quality, sleek exterior design...nice in my eyes",
        "user_name": "BryJo",
        "car_name": "SEAT Leon",
        "brand": "SEAT",
        "price": "$95,900 "
    },
    {
        "review": "What I do not like1. Driver leg room space is smaller - so cannot open too wide to relax/stretch.\n\n2. Not much aftermarket accessories since SEAT is the new kid on the block.\n\n(Nothing much NOT too like for now because my mind tells me its a great car...and is an unbiased thought.)",
        "user_name": "No_worries",
        "car_name": "SEAT Leon",
        "brand": "SEAT",
        "price": "$95,900 "
    },
    {
        "review": "ReviewCollected my new Leon last weekend! I must say it was a great purchase. I was looking at small hatchback since my requirement is just to drive to work and back home everyday. I went to VW to view their Golf initially. Then I was browsing on SGCARMART and came across this car (SEAT Leon), read some of its features and decided to pop by at their showroom in Ubi area. \n\nOnce I stepped into their showroom I was instantly greeted by their friendly sales consultant. He explained to great lengths to me about the car (Leon), he was professional and very patient with me because I had many questions. Once I saw the car I fell in love with it, it looked gorgeous, with its sharp features and not to mention the price was better than others. \n\nAfter that we went for a test drive and I really liked the handling and the comfort level in the car. Once we ended the test drive I had no hesitation but to sit down with the Sales consultant to discuss the details of the purchase.\n\nDrove my new ride for coming to a week now, I must say my love for my new Leon grew everyday. I would not hesitate to recommend SEAT cars to anyone. In fact this is a good time to buy their cars before they grow more reputation, by that time I am sure their car prices will go up!",
        "user_name": "vwlover",
        "car_name": "SEAT Leon",
        "brand": "SEAT",
        "price": "$95,900 "
    },
    {
        "review": "ReviewFun drive, attractive price but reliability of the 7spd DSG and the local dealer support is questionable.\n\nThe car is nice to drive and packs many features for the price. However, the local dealer used to distribute Chery cars in Singapore and suddenly moving to such an advanced brand which may make you question if the aftersales support is up to par. \n\nA visit to the showroom doesn't give the assurance that the dealer is here to stay for long. Certain sales consultants also have left a bad taste in the mouth.\n\nSalesman who brought me for a test drive of the vehicle was not very assuring regarding the DSG Mechatronic issue saying it has been 'mostly' fixed and that it's a 'small' issue that will cost around $3000-4000 'only' to fix if something happens to the mechatronic unit. One lady owner who just collected her car had a DSG issue just after 2 days of driving as shared on the SEAT owners group on FB.",
        "user_name": "MarkerPen",
        "car_name": "SEAT Ibiza",
        "brand": "SEAT",
        "price": "$85,900 "
    },
    {
        "review": "What I likeFun to drive\nGood build quality\nFeature-packed car\nGood price",
        "user_name": "Jiakpahliao",
        "car_name": "SEAT Ibiza",
        "brand": "SEAT",
        "price": "$85,900 "
    },
    {
        "review": "What I do not likeReliability of DSG gearbox in the long run\nQuestionable dealer support if warranty will be upheld \nOnly a 3 year warranty\nSeveral bad reviews regarding aftersales support.",
        "user_name": "LuminouX",
        "car_name": "SEAT Ibiza",
        "brand": "SEAT",
        "price": "$85,900 "
    }
]