[
    {
        "review": "ReviewI do not own this car but was under one of my shortlist after testing a friend's car out. Am in love with the torque and power for this model. For its price range, will definitely recommend this to anyone who loves the kick from what's under the hood.",
        "user_name": "Sherleo",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I likeSuitable for those with a \"Need for speed\"\nA relatively higher seating for a strong sporty type sedan for those who may like an elevated view when driving\nLarge interior, suitable for families too\nRather huge boot\nMemory seats!\nThe shape of both the exhaust tip looks MEAN",
        "user_name": "jemsg",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I do not likeNo sunroof\nExterior can be more enticing\nNeed more usb ports\nNo electric parking brake and still using traditional handbrake\nPricey but understandable",
        "user_name": "Wasteland",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "ReviewThe Octavia is a fun and practical car. With an engaging drive as well as a luxurious but well thought out interior, this car is a no-brainer as compared to other cars in its category. Other small details such as puddle lights at the side mirrors, compartments to hold umbrella etc were a pleasant surprise. Highly recommended!",
        "user_name": "AnandVijayakumar",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I like1) Just a slight top-up in pricing compared to Jap / Kor cars for a conti car\n2) Fun yet smooth to drive\n3) Good noise isolation and sturdiness in door panels compared to some cars\n4) Premium interior feel of cabin with lots of features\n5) Puddle lights at side mirrors really useful.\n6) Huge boot and interior cabin size\n7) Chiseled and masculine exterior and front-grilles\n8) Infotainment > what we will get from Jap cars",
        "user_name": "chantyeroop",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I do not like- DSG wording on the gear stick.\n- Not enough USB ports",
        "user_name": "josephannnn",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "ReviewDecided to pay a visit to Skoda and try out the RS245.\n\n1st look at the show room car, the looks, either you hate it or you can live with it, I don't think anyone will love it deeply. Interior feels plain, nothing spectacular, given that most conti cars nowadays have some form of digital display.\n\nBuild quality....Is pretty bad to be honest. Lots of plastics used inside the console. The door handle seems flimsy, when I close the door, there is a rattling sound, sound of a lose plastic at the rear roof top. Try hitting the black front grill, made of cheap plastics, try it and you will know what I mean. \n\nGranted this is a show room car that is abused everyday, but if I were to own this car for 10yrs, I assume it will deteriorate to the same conditions. Boot seems solid and tough when closing it. Ilike the big t shape hooks that can be sped for securing plastics bags or recycle bags.\n\nEngine is pretty much what you would expect from a gti engine, powerful and responsive, delivers the power when you need it. Very aggressive in sports mode, during idling in sports mode, the rpm is at a high of 1.1k rpm, ready to pounce.\n\nCan't reallly test the stability due to the usual lk test route that consist of straight roads.\n\nI believe that this car, at its price and with the power it delivers, you are only paying just because of the gti engine, cos everything else in terms of quality and features are pretty bad in my opinion.",
        "user_name": "Jster",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I like- Powerfull and responsive engine\n- the big t shape hooks at the boot",
        "user_name": "Lockkeng",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I do not like- power quality of materials used inside the car\n- not much features provided \n- still using hand brakes\n- cheap plastic used for the front black grill\n- the red bbk looks Nice from far, but at close look, it looks like any normal brakes with red color painted over it\n- don't like the alcantra material, seems to absord human sweat, when I took over the car from another customer, there was a stench emanating from the seats, never experienced this before in any car",
        "user_name": "Carbuyer55",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "ReviewTest drive the Octavia on 12th Aug as part of the national day promo in their lengkee showroom. The 1.4T engine was super responsive and felt great. The cabin was neatly made out with tons of features. The 8 inch touch screen display was easy to use as well. Rear leg room was plenty and boot was humongous.. Placed a down payment and awaiting delivery...",
        "user_name": "opgamerkkhk",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I likeSpace inside the car \nefficient & powerful engine \nfeel like a car from one category above \nsturdy body & road presence \ngreat safety features  many of which are missing in it's nearest rivals from Japan & Korea \ncustomer service was great and they made a great $$ deal too",
        "user_name": "Dkyl77",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "What I do not likelower resale value as singaporean's always value the brand lower than a honda or toyota  \nexternal appearance could be better to make it more appealing to the sporty preference customers",
        "user_name": "MatthewLee",
        "car_name": "Skoda Octavia",
        "brand": "Skoda",
        "price": "$102,900 "
    },
    {
        "review": "ReviewAfter driven the car for the past months, I personally feel that the car is better then quite a number of luxury cars out in the market that is pricer.\nTested this car back to back with the 2L harrier. The pick up seems to be faster despite being heavier and being in a disdvantaged 1.4l engine.\nIf you are coming from a jap car or basic continental car. This bear will not fail you in your expectations, except maybe their aftercare service.",
        "user_name": "LYC",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I likeQuiet interior, Low NVH\nSpace and Flexibility of additional 2 more seats at the back when needed\nThe drive feel\nThe ride height is just nice, not too tall, but still slightly taller then the crossover cars\nFull Sunroof that gives an airy feel\nAuto Park and exiting lots, good feature for those who can't park or gauge your distance\nAll round sensors and reverse camera as standard",
        "user_name": "Kodiaqer",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I do not likeVery lousy aftercare service. Bought the car for 2 months. The car was in service centre for almost 1 month due to damages done by servicing staffs and for repeat rectification works that are not done properly.\nPlasticky interior, but can be easily solved by doing your own leather wrapping over the plastics.\nNo GPS on HU for the 1.4L\nNo auto open or \"kick open\" for rear boot lid\nLousy locally fitted leather for the 1.4L",
        "user_name": "Infohigh",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "ReviewDriving since Oct 2018.  Sufficient power for safe driving with reasonable FC.  So stable and comfortable that my main passenger the wife commented always feel sleepy in journey.  The journey always comprise acceleration, overtaking, filtering, cornering and sometimes quick braking.",
        "user_name": "SesameStreetGuy",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I likeACT\nLarge boot toggle with 3rd row seats\nPDC\nPark assist\nAnti collision e brake",
        "user_name": "Alechi",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I do not likeNo ACC",
        "user_name": "Mervynwm",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "ReviewMoving from a Honda MPV of 3 years, Kodiaq has taken up my drive up by two notches.\n\nThe drive.\nThe comfort.\nThe space.\nThe features.",
        "user_name": "Badieboy",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I likePro\n----\nDrive - Turbo-charged. Able to speed up even with 6 full-size adults effortlessly, despite mine being 1.4 only. Feel nimble like my previous Honda MPV. 10/10.\nComfort - Leather seats for all, with ample cushion. Driver and front passenger sink comfortably into the seats. Have good support for driver with additional cushions on the sides of the seats and the armrest. 10/10.\nSpace - Width is long. 3/2 adults able to sit comfortably side-by-side on either row. 3rd row leg space is cramped through. Not suitable for tall adults. 8/10.\nInterior looks - Nice soft plastic on the dashboard and side doors. Feel luxury to touch. Sunroof add fun to children and adults. Provide ample light during the drive. 10/10.\nExterior looks - Look manly or bearly with the LED light. 11/10.\nHU -8 inch screen for 1.4 are large enough for use. Leverage on Android Auto for use of Waze of Spotify.\nSpeaker- No subwoofer for 1.4, but is clear especially with the good soundproofing of 1.4. 8/10.\nSoundproofing - Quiet. 10/10.\nBoot - Look narrow when the 3rd row seat is up, but it still can hold the mid size luggage. And you can hid a lot of your tools or essential stuffs under the boot's mat. So the 3rd row always appear neat or empty. 11/10.\nSales - I got a very helpful and friendly sales person who took care of my presales and delivery need. 11/10.\nDistribution - This is under VAG directly, instead of AD. Hence this allows selling price to be lowered and I assumed better support subsequently. Hope this really will be the case. 8/10.",
        "user_name": "Mervynwm",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "What I do not like1) Misrepresentation of the test car 1.4 - The test car has 360 camera and electric chair. I thought these are standard features of 1.4, but is bit disappointed when they are not. From a sales+product angle, I understand that product info and final product might be mistranslated along the way. As such, I took it in my stride and the salesman (11/10) has been very helpful.\n\n2) Big - Big space translated to bigger vehicle. Parking is a bit of pain. Now I have to be more wary of which car park lots I should go. I can't afford to go to places with narrow car park turns.",
        "user_name": "andrealcolon",
        "car_name": "Skoda Kodiaq",
        "brand": "Skoda",
        "price": "$142,900 "
    },
    {
        "review": "ReviewI have owned the 2nd generation Superb 2.0TSI for close to 4.5 years (with close to 160K Km on the clock when I sold it), and through out the period of ownership, nothing breakdown or need extensive repair (except for a faulty headlight module).\n\nNaturally when the new Superb was launched, I am keen to check it out, and everything has been improved. The improved EA888 engine, with 10% More horsepower (now at 220ps) and 25% More torque (now at 350Nm) than the 2nd gen Superb, make this well built car feel more like a compact sedan, and can propel the car to 100Kmh in a time shorter than what claimed on the technical spreadsheet (my butt feel).\n\nThe Dynamic chassis control (DCC) works well, and is now able to control the gearbox setting with just a simple selection via the HU. Using the sport mode, the gear will be automatically be set to sport model, and coupled with the stiffened suspension, the car feel like having unlimited torque, able to tackle step slope with ease, even with full carload of people.\n\nThe large infotainment panel sitting at the centre of the dash is very user-friendly, with simple and easy to navigate interface. Sound quality (on the top of the line L&K trim) is worth the premium, as it make the car like a mini theater. The built-in Android Auto and Apple Carplay allows seamless connection of any Android or Apple phone to the HU, enhancing safety and usability.\n\nOne of the attraction of this sedan is the huge amount of leg space available at the rear, thanks to the extended wheelbase (2,841 to be precise). It make passenger in the rear felt like there are in a standard wheelbase 7 series / A8, no joke. The current gen Superb is also wider than it predecessor, and now should space at rear is not longer an issue.\n\nLast, boot space. My 2nd gen allows me to transport a 3 ft fish tank with metal stand, and the new Superb with >600 ltr volume seems like able to do much more... Based on my trial, it has no problem to load in 4 full size (28\") luggage, marvelous!",
        "user_name": "Carbon82",
        "car_name": "Skoda Superb",
        "brand": "Skoda",
        "price": "$129,900 "
    },
    {
        "review": "What I like- Smooth yet powerful engine\n- Dynamic chassis control (DCC)\n- Generous leg and boot space\n- Great Canton sound system\n- Blind spot detect with rear traffic alert\n- Reasonably priced",
        "user_name": "Thaiyotakamli",
        "car_name": "Skoda Superb",
        "brand": "Skoda",
        "price": "$129,900 "
    },
    {
        "review": "What I do not likeNone",
        "user_name": "Kowfangl",
        "car_name": "Skoda Superb",
        "brand": "Skoda",
        "price": "$129,900 "
    },
    {
        "review": "ReviewComfort 5/5: Very comfortable car due to long wheelbase, it adds more space for rear passenger. Comes with leather seat and good seating that support our back, suitable for up north trip. \n\nReliability 5/5: skoda brand came out as one of most reliable brand in Europe. Add on with support of VAG sg for 5 years warranty, offering peace of mind\n\nHandling 5/5: the steering very precise, the car is well planted and gives you more confidence at cornering. The steering setting can be adjusted to normal or heavier sport which is good for high speed and corner. \n\nExterior styling 5/5: very executive look, comes with 18 inch rim for ambition plus and nice L shape DRL. \n\nInterior design 5/5: good quality of material used, nice dashboard and styling is pretty similar with its cousin Passat. \n\nFeatures 5/5: comes with blind spot assist; Reverse cam, rear traffic alert, apple carplay, nice sound system. Get the L&K for more sophisticated features which most japanese rival dont offer\n\nValue for money 5/5: cheaper than camry or accord, has more feature, more power, conti feel, better handling, more spacious, big boot. If this car rebadged as vw it might sell for 180k\n\nEngine performance 5/5: with 217 bhp and 350nm torque, i think this is a beast that disguise in executive look. Full throttle and the car launch like a rocket with screeching tyre, with quick 6 speed wet clutch DSG, it can hit 100kmh in mere 7 seconds, faster than most rival in its class. Engine also very quite due to 5 acoustic filter in engine bay. \n\nOverall, i have been driving this car for almost a month, the amount of space for passengers are almost similar as 7 series and yet the boot is biggest in its class. Given its features, power and reliability, this car is definitely underrated and i dare to say that Skoda Superb is the best in its class and definitely value for money. Its like a luxury performance car at the price of japanese",
        "user_name": "Mervynwm",
        "car_name": "Skoda Superb",
        "brand": "Skoda",
        "price": "$129,900 "
    },
    {
        "review": "ReviewI just gotten this car for 1 month. Upgraded from a 1.6L sedan. Love the instant power coming from the 1.5L turbo engine and DSG. Super big boot and it comes with many practical design in the car. Heard many horror stories for the dry DSG DQ200 gearbox, only time will tell. But I love this car a lot now.",
        "user_name": "Daniu82",
        "car_name": "Skoda Karoq",
        "brand": "Skoda",
        "price": "$122,400 "
    },
    {
        "review": "What I like- instant power from the engine, super fast pickup and easily reach 70km/L\n- big boot, very useful for couple with a young kid\n- boot comes with hooks which you can hold lots of things\n- decent price",
        "user_name": "choang",
        "car_name": "Skoda Karoq",
        "brand": "Skoda",
        "price": "$122,400 "
    },
    {
        "review": "What I do not like- engine noise sometimes a bit loud\n- price difference between ambition and style versions is quite big",
        "user_name": "Ano727",
        "car_name": "Skoda Karoq",
        "brand": "Skoda",
        "price": "$122,400 "
    },
    {
        "review": "ReviewCollected this car just after easter break and have driven it for about two weeks. \nThe car is value for money IF everything was working as expected. My advice, check the car thoroughly and ensure everything is in order before driving away with the car. The Sales man won't respond and will direct you to aftersales.\n\nAfter collecting my car, I noticed the leather seats were poorly fitted. Leather fitting on the front passenger seat was very loose. It was like the seat had lost 30kg and needed a skin remove surgery. The loose fitting in the rear seats resulted in the baby seat clips to fall off very easy. Contacted the Sales guy and was told that the I didn't know how to clip it. In my mind, I was thinking how difficult would it be to clip the plastic? I question if Skoda has quality assurance process in place before delivering the car to the customer. \n\nAs for the rattling noise, \nDay 2 - Rear passenger seat\nDay 5 - The rear book cover\nDay 8 - Front passenger.",
        "user_name": "Mervynwm",
        "car_name": "Skoda Karoq",
        "brand": "Skoda",
        "price": "$122,400 "
    }
]