[
    {
        "review": "ReviewI was at cars@Expo promo weekend at Toa Payoh. Checked out the forester and didn't find the car, offer or package any interesting. No 360 camera, no android auto or apple carplay. Indeed, sound of radio was horrible. Didn't enjoy the test drive either. Very noisy cvt engine. Although the seats look comfortable but they are not. Unfortunately, car looks like a box on wheels. Thanks to the reviews below and when I asked about solar film for windscreen the answer was a plain - \"Cannot apply\". Friend who owns a 4th generation forester advised against buying the 5th generation (current) forester and said has lots of problems and service standard is bad. LOL, I was witnessing it when I was there. Gave the salesman benefit of the doubt but he seemed very unenthusiastic. I was given a very low quote for my trade-in car and no discount for new car. Walked out of showroom and into Mazda. Day and night difference in service and enthusiasm. I got $9k more on my trade-in car at Mazda. Mazda CX-5 event car was going at 120k from 160k. Booked one immediately. Better offerings and package as compared to forester. CX-5 a much handsome car from in and outside - very conti. Much better price. Fantastic drive. Powerful 2.0L engine. Android auto and Apple carplay as standard. Bose sound system - it rocks! Lucky didn't buy forester would have regretted big time.",
        "user_name": "TankoMank",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I likeNothing really, hence I didn't book this car.",
        "user_name": "codeone",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I do not likeService standards - just look at Google reviews\nSalesmen attitude\nNew car price\nUnable to apply solar film on windscreen\nTrade-in Car price\nNo android auto or Apple car play\nNo 360 deg camera\nUncomfortable seats especially for tall passengers\nNo wireless charging\nLooks in and out\nLousy entertainment unit and speakers\nweak aircon and one vent is covered by steering wheel... LOL!",
        "user_name": "Nivlek96",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "ReviewI was at the Toa Payoh show room on a weekday and to my surprise I was the only customer there. Saw about 5 salesman seated at the reception area. Very unnerving as it felt all eyes were on me. However, none approached me until I started meddling with the car.\n\t\nCar seem ample big but the fittings are extremely poor. Front chrome grill seems as though it's made up of the cheapest plastics they could find. In the rear my daughter scratched her foot when she accidentally rubbed it against the plastic cover of the seat rail underneath the driver chair. Noticed the electric boot was a little finicky, not the best I've seen. Test drove the car and felt engine was underpowered. CVT droning sound was very obvious. Air-conditioner seemed very weak and lastly, extremely lousy lousy speakers. They should just do away with the (ugly orange) sports package offering and provide with a better sound system/speakers instead.\n\nCar's OMV is 17k and to sell it over 114k is so ridiculous. Although, the salesman lowered the price to 105k for the i-S variant but I think it's just too expensive especially, the way it is made with low quality fixtures and fittings. Only winning point depends on how you see it is the AWD but then again, in Singapore context not much of use with our smooth roads. Only thing AWD does is consume more fuel.\n\nAnother point I found out from the Salesman was that you are unable to apply solar-film on the windscreen due to the eyesight system that may malfunction and warranty may be void on eyesight because of this. I'd say folks, get ready to be barbequed under the Singapore sun!\n\nThere seemed to be more cons than pros for the forester and in the end, decided against buying one. Prospective buyers please look out for the above problems before parting with your money. Hypothetically speaking, let's say car was in total good shape without all the above (and below stated) problems I would at most, AT MOST part with not more than 100k on this car and not a cent more.",
        "user_name": "SGCMHondajazz",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I likeSpace seems ample with rear folding seats pull of a leaver and the fold. Memory seats, and dual electric seats.",
        "user_name": "petrolpump",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I do not likeLooks to dated. Weak Aircon, can't apply solar-film on windscreen and must pay additional to apply solar-film on sunroof. (roll eyes). Map/Dome light in cabin not standardised front is white back is ugly yellow. CVT engine droning sound and being underpowered. Extremely lousy speakers. Ridiculous pricing and bad after sales-service - experience from colleague's BIL.",
        "user_name": "Burningwxl",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "ReviewWas curious about the new Forester S Eyesight and decided to check it out.\nIt is surprisingly a very nice car to drive and the features and specifications are excellent.\nThe new Forester S Eyesight is comfortable and offers lots of space for 5 passengers.\nProvides excellent value for money, with features that are not found in basic versions of many German sport utility vehicles.\nWas seriously considering the Mercedes GLC since I currently own 2 Mercedes cars.\nEventually I purchased the new Forester S Eyesight.\nSounds unusual and unorthodox but that's what happened!",
        "user_name": "BruceLee_99461",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I likeHighly comfortable.\nExcellent driving position.\nLots of space within the cabin for 5 adult passengers!\nExcellent visibility with its large windows and the car's height.\nEyesight safety system and other features like lane departure warning, blind spot warning, cruise control with distance adjustments, etc.\nExcellent value for money.",
        "user_name": "Mervynwm",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "What I do not likeLooks are somewhat dated, but with the Ranger sports kit with Orange trim plus a nice set of black sports rims, it looks much better now!\nSound system is not excellent, but you can always change the speakers for better sound quality.\nWould have been nice if the touchscreen system had Apple Car Play but unfortunately it doesn't, which was disappointing.",
        "user_name": "BruceLee_99461",
        "car_name": "Subaru Forester",
        "brand": "Subaru",
        "price": "$113,800 "
    },
    {
        "review": "ReviewI want to come back and say more about this SUV after 12,000 km. Got used to no turbo for almost seven months of driving this car. The engine run in after 1000 km and the the petrol consumption started to see about between 10 - 12 km/ltr. Done the 10k service. The car is now very smooth. Drive it gently to save on FC.\nTo people who are looking at this car, I would say, compare with the market, this is a good buy with a lot of safety features such as Eye-sight, ACC, etc. But, if you can wait, maybe for the upgraded models such as Hybrid or future Turbo models.\nIf you must buy it now, still a good deal when the COE is low.",
        "user_name": "Lmy102",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I like1. Lower fuel consumption compared to my previous 2014 Forester XT.\n2. Many very basic features which will probably save money from maintenance in time to come.\n3. The ride is comfortable and negotiates corners just like a saloon car or better.\n4. Compare to what is offered in the market this time of the year, February 2019. This is a good bargain buy.\n5. Got used to the CVT transmission system and now drive at a moderate speed.\n6. Not a fast car compare to many on the road but still very fast if you get used to it.",
        "user_name": "Cent50",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I do not like1. The Panasonic system has no Apple Car Play and the speakers. I got rid of them and install my head set with Apple Car play and new Pioneer speakers.\n2. Very noisy at first and I did sound proofing on the doors. Now it is very silent. Of course you pay some money to get your ideal ride.\n3. Paintwork was quite dull so I did Ceramic coating and washing is so easy and never have to worry about bird poo again. The gloss is always there with ceramic.\n4. No other dislikes until the maybe 30k review.",
        "user_name": "Gibbon28",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "ReviewDriving my XV 2.0i-S for 2 months now. So far it has been a comfortable car with awesome AWD and Eyesight capabilities. I use the adaptive cruise control pretty often and really impressed with how Eyesight works. \n\nPreviously drove IS250, Rav4 and Tiguan, hence, the FC is pretty acceptable.. Getting 11-12km/l for 60:40 urban:highway conditions. It's not the perfect car, but for its price, it is quite value for money.",
        "user_name": "Lmy102",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I like1. Eyesight system, works like a charm with solar film (though the distributor has advised against). \n2. Daytime LED running lights. Looks great (but cannot be turned off).\n3. Symmetrical AWD. Handling is superb even when the car is high.\n4. Quiet drive even at 90km/h.\n5. Comfortable leather seats. Made in Japan.\n6. Paddle shifters makes it easier to overtake.\n7. Acceptable FC given my daily commute is mostly urban. Cannot compare to other makes which are lower in engine cap/FWD. Many avoid Subarus because of its notoriety being fuel guzzlers. I find the XV not too bad.  \n8. Sufficient space for rear passengers. Easy to climb in/out.",
        "user_name": "Ingenius",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I do not like1. Cheap Panasonic unit. GPS slow to load. No Apple carplay / Android auto.\n2. Inferior and under performing speakers. \n3. CVT needs time to get accustomed with. Rev up more to prevent jerking as low speed gears. \n4. Several features on Impreza/other countries' XV not on local XV, e.g. lane keep assist, Auto dimming rear view Mirror, blind spot detection, reverse automatic braking, sunroof, electronic seats. \n5. Boot space is small.",
        "user_name": "kohderek",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "ReviewAfter driving the car for 3 months, it is a comfortable car but keep in mind that the car is not fast. I used to drive Conti car, so I find the overall interior built quality for the XV are not that great. MI should bring in the highest spec car like the sunroof and blind spot monitoring etc. MI should not compromise on safety features.",
        "user_name": "6GHz",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I likeEyesight",
        "user_name": "GiveWay",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I do not likeNo rear air con vent\nNo rear USB for charging\nNo auto tailgate\nSuper low end head unit with no bass speaker.",
        "user_name": "ahbeng5220",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "ReviewGot my XV in August 2018, 3 days after registration. I like the car, but I may not recommend it to a friend. The Forester 2.0i could have been a better buy on hindsight.   This is only my first month owning the car, so I will review it after 10,000km. I could have gone for the 2017 Forester 2.0i-s, it's much better equipped. A bit regret buying the XV too fast. So think again before you take the plunge. I got mine because COE was low, so don't let the low COE affect our decision.",
        "user_name": "Edwinteo",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I like1. It has the familiar engine roar like my Subaru 2.0XT, 2014 (which I sold earlier this year). But not the pick up as the torque is only 198 Nm and 153 Bhp.\n2. External design of the XV 2018 is good looking but the Motor Image version lack the sun roof. \n3. Interior improvement is good and leather seats is impressive but very soft.\n4. It's a small SUV so feel light at the steering.\n5. I think Insurance is cheaper because of Eye-sight system.",
        "user_name": "Sarion",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "What I do not like1. Start up of the Head Unit system very slow and had to wait several minutues before the Navigation system gets ready. \n2. No Apple Car play. Speaker system is inferior, so I had to upgrade it locally.\n3. Road noise very high, especially coming from the tires. I had to do after sales sound proofing otherwise quite unbearable.\n4. The Motor Image version lack the Sun Roof, feel a bit cheated. Future buyer should consider this.\n5. The auto start-stop system is annoying so switch it off most of the time. \n6. The Eye-sight system is not fantastic in spite of all the advertisement. Takes a longer time to be familiar with it, best suited to use when cruising on highways.\n7. The body panel is soft and easily get dented when hit by other car doors.\n8. Petrol consumption is no less than the 2.0XT, which I own earlier.\n9. I will come back after 10,000 km usage. Let's see if there is anymore disappointment.",
        "user_name": "6GHz",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "ReviewHave owned and driven the 2.0 with Eyesight for 5k km so far.  Was considering Hyundai Tucson, Kia Niro, Kia Sportage and the XV.  Initially it was the design that won me over, but after a test drive, it was the comfort that set it apart from the rest.",
        "user_name": "drivinghazard",
        "car_name": "Subaru XV",
        "brand": "Subaru",
        "price": "$96,800 "
    },
    {
        "review": "ReviewOwner of a Impreza 2.0i-S EyeSight 4d for over a year and this is my honest review of the car. \n\nInterior\nDecent with carbon fibre-like trims, leatherette-lined stitched dash top. Sturdy, solid build quality, with acceptable quality plastics and some soft-touch materials. An info screen on top of the dash shows geeky information like oil temperature, tilt angle and AWD grip. Main driver touch points like sporty 3 spoke leather-lined steering wheel and aluminium pedals are nice touches. \n\nRide \nThe car is the first Subaru on the new Subaru Global Platform (SGP). Front MacPherson Struts and rear Double Wishbones endow this car with a plushness not seen in cars with less sophisticated torsion beam rears common in this class. It tackles uneven surfaces with aplomb and refinement/noise is exemplary with the stock 17\" Enkei rims shod with Bridgestone Turanza T001 comfort biased tyres. \n\nHandling\nImpreza shines with its SAWD stability especially during heavy rain. Steering is well-weighted with good feedback. Traction gives confidence during cornering.\n\nPerformance \nNot a sports car or especially fast, but fast enough for most merging and overtaking manoeuvres. Coming from a 300+bhp manual performance car, I would say this car's performance is more than adequate for its class - the family bread & butter segment - a notch above 1.6NA or 1.0T cars and even on a par with lower powered 1.4T cars, without the low-end shove. The key to harnessing the power is mastery of the Lineartronic CVT gearbox. To extract maximum performance, one has to counterintuitively dab the throttle lightly, before more fully depressing the throttle. Once revs hit 4500rpm, the car picks up briskly. \n\nFC for my commute of 90% Rush-hour traffic in city conditions is ~10km/l. One can't beat the laws of physics at 1415kg with SAWD, but for those with a more forgiving commute, I hear from other owners 15km/l is possible. YMMV.\n\nConclusion\nUnderrated car which won the Japan Car of the Year 2016-17. Handles well, rides well and performs well. Safe, family ride and tremendous value for money.",
        "user_name": "PremConti4eva",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I like- Made in Japan fully loaded car with all options ticked except for lane keep assist, bonnet airbag, heated front seats and 18\" rims. \n\n- Safety. 7 airbags, EyeSight Safety with Adaptive Cruise Control, Pre-Collision Braking, Lane Departure Warning. Blind Spot Monitor with Rear Cross Traffic Alert and Reverse Automatic Braking. \n\n- Ride comfort due to sophisticated double wishbone suspension.\n\n- Handling is good with SAWD and active torque vectoring.\n\n- Performance a step above the bread and butter class from a 2.0 NA engine.\n\n- Reliability: no issues, to be updated as the car ages.",
        "user_name": "Oonp",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I do not like- 8\" Panasonic head unit has blocky graphics with no Apple Carplay or Android Auto.\n\n- Some build quality issues. Chrome wrapped door handles peeled after a year, but replaced under warranty. \n\n- Paintwork seems a little \"thin\" compared to continental/premium continental makes with corrosive tree sap/bird poo seemingly penetrating the topcoat easily. \n\n- Lineartronic CVT can be slightly jerky with hesitant and light throttle inputs.",
        "user_name": "Philipkee",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "ReviewThis car is heavy, man. But having said that, it cruises very nicely on the expressway.  The queuing to JB across causeway does drink a lot on FC, but once the car is on 3rd gear and cruising, it is comparable to conti.  Happy so far",
        "user_name": "Limweiyao",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I likeSolid build\npick up when on 3rd",
        "user_name": "Brass",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I do not likecar slows down quite a bit when going uphill",
        "user_name": "Swiftgolfer",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "ReviewI did not drive this car but I was the backseat passenger while my brother was test driving it with the sales executive. It was like wow a very nice car.",
        "user_name": "tang_sh",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I likeVery spacious\nQuite powerful\nA lot of nice gadgets",
        "user_name": "Bxcow20",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I do not likeNot really don't like but it's very quiet.  The insulation is very good, to the point you can almost hear a pin drop.  So not used to it.",
        "user_name": "Mervynwm",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "ReviewJust reading the write-up on the new Subaru Global Platform (SGP) will make anyone excited. Impreza is the first of the Subaru range to utilize the SGP. Test drove many other cars before making a decision to sign with Subaru for my very first brand new car.",
        "user_name": "hellosgcar",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "What I like1) the driving experience due to the stability of the car - handling is confidence and lesser body roll compare to other brands.\n\n2) the interior - love the carbon bits and the aluminium pedals\n\n3) the sporty exterior \n\n4) the safety - 7 airbags and good crash ratings with ventilated disc brakes\n\n5) Big screen!",
        "user_name": "drivinghazard",
        "car_name": "Subaru Impreza 4D",
        "brand": "Subaru",
        "price": "$93,800 "
    },
    {
        "review": "ReviewThis new Subaru WRX handles better, looks better, and the interior feels better than the previous generation WRX.",
        "user_name": "Savagetosh",
        "car_name": "Subaru WRX",
        "brand": "Subaru",
        "price": "$160,800 "
    },
    {
        "review": "What I likePowerful engine.\nLooks good.\nHandles very nicely.\nNice and nimble exhaust sound.\nHas everything a WRX needs.\nTorquey, especially at the low end.\nImproved fuel consumption of the FA20DIT as compared to the older EJ25 engine.",
        "user_name": "DerrickD",
        "car_name": "Subaru WRX",
        "brand": "Subaru",
        "price": "$160,800 "
    },
    {
        "review": "What I do not likeAvailability in CVT. (What??? CVT on a WRX???)",
        "user_name": "S4vtec",
        "car_name": "Subaru WRX",
        "brand": "Subaru",
        "price": "$160,800 "
    },
    {
        "review": "ReviewChecklist\n\nPrice - Check\nPower - Check\nTorque - Check\nHandling - Check Check\nBody Styling - Check\nJapan Made - Check\nLED Light - Check\nSafety Rating - Check Check Check Check Check",
        "user_name": "Sirp",
        "car_name": "Subaru WRX",
        "brand": "Subaru",
        "price": "$160,800 "
    },
    {
        "review": "What I likeWhat's there not to like?\nHandling, Power, Torque.\nConsistently high rating by IIHS, EuroNCAP.",
        "user_name": "Jerryong",
        "car_name": "Subaru WRX",
        "brand": "Subaru",
        "price": "$160,800 "
    },
    {
        "review": "ReviewThis is my 3rd Subaru. Started from a 2005 Auto WRX, followed by a 2009 STI, and now a 2013 BRZ. Although not as quick as the WRX or STI and not AWD, it is a joy to drive as I love the low driving position and superb handling going around bends, especially South Bouna Vista Road. The car remains flat and does not wobble!",
        "user_name": "shortass",
        "car_name": "Subaru BRZ",
        "brand": "Subaru",
        "price": "$138,800 "
    },
    {
        "review": "What I likeLooks like an expensive car for the price you pay.\nFantastic low seating position and handling.\nCar does not wobble round bends and stays almost completely flat.",
        "user_name": "Boxerfan",
        "car_name": "Subaru BRZ",
        "brand": "Subaru",
        "price": "$138,800 "
    },
    {
        "review": "ReviewPrice, design, technology is what prompts me to give Subaru a try. \n\nFor the feel, the moment i test drive XV and Impreza, both my wife and me fell in love with it. We ended up choosing Impreza as it is low enough for my mum to get in and out of it.\n\nHaving driving it for 2 months, my comments are:\nEyesight is decent, works when needed.",
        "user_name": "Shrio1978",
        "car_name": "Subaru Impreza 5D",
        "brand": "Subaru",
        "price": "$94,800 "
    },
    {
        "review": "What I likeStability feel, being a 4wd. Not easily swept away by puddle of water or doing a cornering or u-turn. \n\nAdaptive cruise control. good to use when traveling to Malaysia\n\nGood braking.",
        "user_name": "Ivantanjh",
        "car_name": "Subaru Impreza 5D",
        "brand": "Subaru",
        "price": "$94,800 "
    },
    {
        "review": "What I do not likeMileage is about 10.5 to 11.5km/ltr, as compared to stated 15km/ltr (way too off)\n\nAt low speed, the auto gear shifting is rough, whether you are accelerating or decelerating.\n\nWhen stationary on the road, the idle stop hold is rough, whenever i start to drive again, thus I've turn it off.\n\nNo apple Play.\n\nThere isn't a good location to mount your phone holder that will not obstruct your view.\n\nEngine performance is so so for a 2 ltr car.",
        "user_name": "bahomet",
        "car_name": "Subaru Impreza 5D",
        "brand": "Subaru",
        "price": "$94,800 "
    },
    {
        "review": "ReviewDidn’T want to buy a car this year, but my beloved Golf GT decided that it was time and made that decision on my behalf, so I took 2 days from scouting to signing on the dot line. \n\nWas dead on to buy a K3 or Elantra, because I am cheap skate and didn’T want to spend too much on a liability since my pocket does not have spare changes to spare, but wasn’T exactly happy with K3 for its light steering and it is scary if I can say, and Elantra interior does not really excited me too much, so I went to test drive Mazda 3, C-HR, Impreza and for the budget I was willing to spend, this look to be best deal for the dollar, at least like my friend say, I won’T be cursing too much whenever I stepped in the car.",
        "user_name": "Quistation",
        "car_name": "Subaru Impreza 5D",
        "brand": "Subaru",
        "price": "$94,800 "
    },
    {
        "review": "ReviewOwning outback 2018 for slightly more than a year. So share some of my views on this ride. \n\nThe engine is the same as last generation outback, a 2.5L NA. So performance wise should be the same. What is new on this car is memory seat, eye sight, upgrade console supporting car play. Some car mag also highlighted some CVT optimization, which I have no idea. \n\nPower wise, decent but definitely can't outrun a turbo charged hot-hatch. In sport mode, and a heavy right foot however, I can do overtaking with ease, thanks for the good handling. \n\nIt has permanent 4WD, so I can corner with high speed if I ignore the comfort level of the back-seat passengers. (normally, I will get an earful from Mrs if I do that). During one of the trips to the north, we encountered pouring rain. But the car performed very well. I could still drive at 80km/hr without worrying about aquaplaning. I think it must be the 4WD helping to plant the car on the ground. \n\nThe car is very roomy, and high ground clearance than normal sedan. It is comfortable to sit in. With high ground clearance also means I can drive through puddle of water where sedans have to park at the side and wait. \n\nIt comes with eye-sight, which packs with all the high tech features like lane departure warning, collision prevention, blind spot monitoring and adaptive cruising. They are useful but I can also turn them off if I want. Other features like electric tail gate and harman kardon speakers.",
        "user_name": "Sarapo",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I like1. Permanent 4WD\n2. eye sight\n3. Spacious\n4. high ground clearance",
        "user_name": "junda07",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I do not like1. 2.5L is not powerful enough.\n2. FC is bad for heavy right foot.",
        "user_name": "Oceanwidegroup",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "ReviewMy first Subaru was a 2005 Forester and I have grown to like Subaru's AWD system. I owned an Outback since 2016 and enjoyed the car ever since. The exterior styling was striking with strong lines and stance. The interior is typical Subaru and could use a little updating especially with the headunit that came without Apple CarPlay or Android Auto. \n\nSpace in the Outback is aplenty with a carnivorous boot, you will never run out of space. WIth the 2nd row seats folded down, you can easily fit a whole road or mountain bike in it with the wheels attached. There will still be space left over for many other things. \n\nThe 2.5L Boxer never failed to perform, chugging out torque when you need it. You could tell the difference between driving a 1.4L or 1.8L turbo engine vs a 2 or 2.5L engine. The CVT is smooth and linear giving a very comfortable drive behind the wheel. Sure the fuel consumption can't be compared to a smaller engine car but one should expect that when considering a Subaru. I averaged 450km per 40L of petrol with 50% Highway.\n\nThe AWD system like all subbies allow the Outback to be solidly planted to the road. I am always confident behind the wheel whether the road is dry or wet. \n\nIn summary, the Outback is a great family hauler with distinct Subaru characteristics. I only wish the the infotainment system is more modern.",
        "user_name": "kcng",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I like- Subaru AWD system\n- Smooth CVT\n- Relatively quiet cabin\n- Boot that swallows everything\n- Electric Tailgate\n- Commanding view of the road\n- On point steering",
        "user_name": "Eclipse1",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I do not like- Body is a little soft. Getting dents seem to be a given. Then again, could be where I park.\n- Dated infotainment system. Almost useless voice assist.\n- Purchasing and delivery of vehicle experience ain't that great. I collected the vehicle at the sheltered car park in Subaru Leng Kee.",
        "user_name": "mrkkhk",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "ReviewI was wondering does the all new Subaru Outback comes with a 3.6L with the new eye sight system?\nOR\nThe 2.5L comes with the eye sight system?",
        "user_name": "plskcarmart",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I likeSeen the video on youtube, and it seems to be a very good system where safety is concern, especially where singapore road user are impatient as well as road congestion.",
        "user_name": "Thunderchief",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I do not likeLack of options to choose from.\nLack of lumbar support.\nLack of auto seats & seats memory for both fronts seats.\nLack of rear air con.",
        "user_name": "Surveillancevideocamera",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "ReviewTest drive on 5 Sep 2016, together with FXT.\n\nThe exterior is great, car is lower than FXT, which mean more comfort for the passengers, especially for backseat passengers.\n\nThe interior is spacious, backseat passengers felt more comfortable compare to FXT, we squeezed in 3 adult and 2 kids inside, same as FXT.\n\nDriving is pleasure, smooth and comfort, lack of Turbocharge engine will mean lack of surge of powerful push when acceleration, even though it is a 2.5l engine. Due to the lower height of car, the passengers backseat felt lots more comfortable then FXT, also because of this car is slightly wider than FXT, also because there is air-con vent for backseat.",
        "user_name": "soonsoonsoon",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I likeLarge spacious.\nGreat visibility.\nMore stable due to lower height compare to FXT.\nBlind spot sensor.\nGood handling.\n18\" rim.\nHarman/Kardon audio system.\nAir-con vent for backseat.",
        "user_name": "Purplexus",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "What I do not likeFuel Consumption due to AWD\nEngine not powerful enough for 2.5l\nHigher road tax compare to FXT (around SGD200/year)\nLack of front collision sensor.\nSmaller sunroof compare to FXT\nOnly 3 times of free serving. (1K,5K,10K)",
        "user_name": "bahomet",
        "car_name": "Subaru Outback",
        "brand": "Subaru",
        "price": "$137,800 "
    },
    {
        "review": "ReviewI always wanted to test a Levorg but had no chance. Testdrives don't count as it's too difficult to give an accurate feedback for a 10min drive. Finally managed to rent a Levorg in my holiday trip in Japan. \n\nAs an owner of the current 2014 Forester XT, I'm quite familiar of the modular Subaru layout and displays. The trim and equipment level of the rental Levorg is bare minimum so I will not compare them. The rental does have the Eyesight collision mitigation system which is not equipped in our local version, so I shall always not touch on that.\n\nIn general, the car looks much better in flesh and online pictures didn't quite do justice to how sleek it can be. I like how it tries to be executive with those chrome trimmings yet hinting a sporty underbelly with it's intercooler scoops and twin exhaust. This car is perfect for young dads who wants to have fun.",
        "user_name": "Pocus",
        "car_name": "Subaru Levorg",
        "brand": "Subaru",
        "price": "$145,800 "
    },
    {
        "review": "What I likeThe car may look small from the outside but its surprisingly spacious, and I'm not talking about the boot. For a 1.8m person I sit comfortably with plenty of head room and my back passenger still get loads of legroom. The boot is deep too as I managed to lug 2 large full extended luggage and 2 duffel bags without issues. Of course I had to remove top tonneau cover so I can stack them vertically but the cover can be easily kept at the under boot compartment so there's a lot of flexibility there.\n\nOn a fully loaded car, how competent is the drivetrain and power? Before I go further, I travelled from Tokyo up Wang an to southeast Chiba. I had a fair mixed of busy traffic, jams, slow layback town traffic and NS highway-like Wangan traffic. I'd say the 1.6 turbo engine is adequate under this conditions. The turbo lag is almost non-existence compared to my XT back home and there is no sign that the car is in any stress even that high speed. Wangan traffic is very fast and the car had no problem keep up with the 130-140kmh traffic at the overtaking lane. However you have to set your expectations correct. The 1.6 turbo version is not built to win drag races or overrun other sports-oriented cars, but it can keep up with SG traffic, esp. those high-torque Taxis. \n\nAs with the Forester, the Add to Lineartronic CVT is sure, tight and decisive. There is no rubberband effect like those 1st generation CVTs and the inclusion of paddle shifters made tackling the corners more exciting.\n\nDue to the low height and AWD setup, this car performs like a charm in the corners. The steering is a bit light and need some time to get used to but being an estate tourer, don't expect this car to tackle the bends like a sedan or hatchback.",
        "user_name": "Harris85",
        "car_name": "Subaru Levorg",
        "brand": "Subaru",
        "price": "$145,800 "
    },
    {
        "review": "What I do not likeOf course, this car is not without is things to consider. As an 4690mm estate tourer, it's one of the longest car I've driven. You will have to get used to driving in tight spaces and take care of the length during turns. Parking will also be a challenge and you need to be mindful of the rear. But of course if you are already looking at this car, I'd expect some skills & experience from you already.\n\nAnother issue I had is the FC. In my Japan trip, I drive mainly at smooth highway out chiba. slow traffic and city traffic accounts to 30% of my total driving trip. I'm getting 12.5 to 13 km/l max.(JDM levorg displays in KM/L) A far cry from the advertised 17km/l. If I've getting such FC in Japan, I think you have to minus at lest 2km/l in SG conditions. 10.5 to 11km/l will be an accurate representation. For a Direct-injected turbo I was expecting better FC. It could be due to my 70kg lugguage load or the fact that I'm force to consistently drive at at least 120km/h which is not an efficient FC speed.\n\nI also hear a faint whining some from the CVT at low speed if I mute my radio. The whining is not intrusive and sounded a bit like the whine you hear in buses, except that it much softer. I'm not sure if it's an issue but take note anyway.\n\nIn anycase, the Levorg met my expectations in my roadtrip and is a nice car to drive. I reckon the 135K price tag is abit too high but considering the high OMV it's not too bad of a deal.\n\nIf the Levorg had entered SG market much earlier, I might have considered it rather than the Forester XT. Trading off Adequate power, better handling and lower road tax doesn't sound that bad.",
        "user_name": "ernestthia",
        "car_name": "Subaru Levorg",
        "brand": "Subaru",
        "price": "$145,800 "
    },
    {
        "review": "ReviewThe Subaru Levorg may not be the fastest Subaru car around, but young fathers who don't want to give up their cars so quickly for yet another \"Family\"-looking car like the Toyota Wish, Honda Shuttle, etc. Will find joy in this sporty Levorg with ample space for your family shopping and baby items (parents with strollers will understand what I mean). I fell in love with the looks of this car at the showroom, and the test drive confirmed it all - excellent handling, good and smooth pick-up, and overall a very comfortable drive. I immediately dropped the Honda Civic Turbo for this, and also got the very attractive STI performance package add-on!",
        "user_name": "The_mark",
        "car_name": "Subaru Levorg",
        "brand": "Subaru",
        "price": "$145,800 "
    },
    {
        "review": "What I like- Sporty styling, particularly the front with WRX type curves, lights and scoop\n- STI performance package makes it look, and perform, even better\n- Excellent handling\n- Good and smooth pick-up, for this range speedy enough (under 8.9s) for the century sprint\n- Good array of useful features that it not over-compensating\n- Quality interior that has not seen compromises common in Japan-to-Thailand cars, like the new Honda Civic (looks okay but feels cheap and not the best made; try the boot flap, seats and doors)\n- Large boot perfect for families\n- Competitively priced with high OMV\n- Not that many on the roads, which personally makes this car more unique (you don't really want to be the driver of yet another another Civic, Vezel, Elantra, or Corolla, do you?)",
        "user_name": "Bonafidestack",
        "car_name": "Subaru Levorg",
        "brand": "Subaru",
        "price": "$145,800 "
    },
    {
        "review": "ReviewSmall boot compared to conti rivals\nComfort orientated\nGood crash test ratings\nFlimsy doors\nPoor interior materials\nSmall and short thigh support\nFeels cheap overall",
        "user_name": "opgamerkkhk",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I likeGreat amount of features\nSpacious enough, better than mazda 6",
        "user_name": "Speed123",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I do not likePoor handling\nRoad noise was outrageous in such a car",
        "user_name": "wpy",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "ReviewI have this car for less than 2 years.  As with other reviews, I agree this is a good car, good pickup, great performance. Other than the voice activation, no complaints about the car.\n\nHowever, I had the Blackvue with Power Magic Pro installed at delivery. Then on first service at Motor Image, they convinced me to add the mirror closing features. That worked well for a few months but broke down. I took it back to Motor Image and they replaced the actuator for free. That's when the problem started. The blackvue keep shutting down every morning when I start the car. I had it checked at Motor Image and they couldn't fix the problem.  I lived with it but if I leave the car for a couple weeks while on biz trip, the battery would go flat. I have changed 2 batteries now.  \n\nCar is good, not too sure about the level of competence service at Motor Image. Shame.",
        "user_name": "U820661",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I likeGood pickup\nValue for money\nComfortable ride",
        "user_name": "Jamie77",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I do not likeVoice activation\nPoor service at agent Motor Image",
        "user_name": "Muser",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "ReviewOne of the most comfortable cars I've driven, especially for its price. It's spacious, quiet, handles really well and is loaded with features. We also own a GLA 200 and I feel the legacy  surpasses that one in terms of comfort and ride, plus the legacy sedan is an all wheel drive while the GLA, a crossover, is only a front wheel drive . The irony! Go figure! Even my teenaged children much prefer riding in the Legacy. Before deciding on this car, I test drove several others including the Teana 2.5, Peugeot 508, Optima, Camry, Accord, Mazda 6 and Sonata. Based on comfort, price and specs/features, it really was a no brainer for me. Fuel consumption is on par with the Accord, Camry, Sonata and Optima, but loses out a little to the Teana 2.5 and Mazda 6 2.0. Notwithstanding, it sweeps the 6 under the rug as far a comfort goes. In terms of exterior styling though, I think the 6 tops the list of cars I tried, but the back seat just didn't work for us. It felt far too tight for a car that size. Moreover, the wife said NO, the minute she sat it in it ;-). All in all, i think if you're looking for a family sedan, you really can't go too far wrong with any of the Japanese cars (honestly, even the Korean cars are pretty darn good). But the clincher for me was the price of the Legacy. It's unbeatable for all that you get. Just love the car",
        "user_name": "Hyundaielantra2012",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I likeSmooth and comfortable ride\nquiet\nSpacious interior\nloaded with features (too many to list)\n18in alloy wheels \nall wheel drive (great for those rainy days when you drive over puddles of water at relatively high speeds. )\nDecent fuel consumption. not the best in its class, but a great improvement over Subarus of old. Made even better by the fact that it's an all wheel drive.",
        "user_name": "swishhhh",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "What I do not likeWish the side mirrors had auto fold when you lock the car. They do fold but you have to press a button to activate it. My previous cars mostly had auto fold, so sometimes i forget to shut them when i get out. \n\nExterior design is not the most exciting. I'd have to give that to the Mazda6\n\nI'm being picky but I wish they threw in more freebies like free rust proofing. I thot it would've come as standard, but only found out after buying the car that it's a separate charge of $300. Suggest you try asking for them to throw it in foc before signing.  To be fair though, they did include a free navigation software which doesnt come standar, but which they installed in the entertainment system for me foc. I wasnt expecting that, so it ended up being a nice surprise.",
        "user_name": "JonL123",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    },
    {
        "review": "ReviewThis is the 2nd Subaru Legacy I have own after BL5 NA. Better fuel.Consumption, leg room for rear passenger,  wider car body, 18inch sport rim, sunroof.And the most important is AWD handling &.Active safety feature. A ideal car for family & people who aporeciate AWD at tropical country with snow but with lots of rain.",
        "user_name": "drivinghazard",
        "car_name": "Subaru Legacy",
        "brand": "Subaru",
        "price": "$139,800 "
    }
]