[
    {
        "review": "ReviewA very nice looking sedan with a powerful 2.0L engine and DSG 6 speed wet clutch gearbox.\n\nWas pleasantly surprised that the infotainment interface has been upgraded to a touchscreen when the brochure is still showing the previous traditional system.\n\nActually test drove the R-Line Variant version as they do not have a 2L sedan for test drive.  Pickup and ride comfort was very good and more than sufficient for the average driver like me.\n\nDefinitely among the top of my shortlist!!!",
        "user_name": "Lotr",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I like1. Powerful GTI engine\n2. Fast and smooth DSG gearbox\n3. LED headlights\n4. Ventilated seats with memory\n5. Virtual cockpit\n6. 18\" rims (just nice for me in terms of looks and running cost, not too big or too small unlike in some other models)\n7. Heads Up Display",
        "user_name": "Wasteland",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I do not like1.  Lacks the latest active-passive safety features such as ACC, blind-spot detection, autobrake etc\n2.  Very high profit margin, I estimate it to be around 49k.  My biggest gripe actually (would have gotten one if the discounts were similar to those of the 1.8L versions)",
        "user_name": "opgamerkkhk",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewThis car has been around for afew years new model coming out soon, but don't see much improvement on the new model.\n\nPretty good looking car out side, inside the dashboard is decent And well laid out. I Like the virtual cp display, pretty much like Audi, but there are some differences.\n\nDouble insulation on the front wind screen(that's whatt was told to me), making the car very quiet when driving. Rear seats space is one of the best in class, spacious fro 3 adults. Rear boot is also big. For a family sedan, it ticks all he boxes if you want a big real estates.\n\n1.8 engine is pretty decent for Singapore roads. Power delivery is more than enoug and its pretty quiet.\n\nThe 2 liter engine, used in GTI, however delivery's a different drive. Very sporty, reach to launch forward, and when you accelerate heard the engine growl. If you prefer quiet go for the 1.8 engine. If sporty sound than the 2 liter will suit you.",
        "user_name": "jj29",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I like- spacious room every where\n- door auto retract back when entering and exiting \n- 2 liter engine is powerful and punchy\n- Pretty good quality for a conti car that cost less given the specs and engine performance",
        "user_name": "micjenn",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I do not like- VW reliability, welll know for the dsg gear box problem in the intitial years (same as audi gear box issues) not sure if it has improved\n- 1.8 engines should be using the dry gb that has more problem, the 2litre should be using the wet gd due to its power output, which should has lesser problem?\n- low resale value",
        "user_name": "tanyb678",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewBest badge that you can get under 130k in its class. Great handling and looks. Not style without substance. Huge boot, great acceleration, great ability for tuning. Stage 3 has 350HP. Comfy cruiser but super sporty when you want it to be. So quiet inside almost like EV. More quiet than prius when travelling 100km/h.",
        "user_name": "NoMore",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I likeEffortless power delivery\nGood amount of features\nGreat build quality as we would call it \"SOLID\" XD\nMuch better than some other d-seg sedans namely MZD 6, Camry and Legacy",
        "user_name": "Tiramisususu",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I do not likeSmaller rear legroom compared to superb\nSmaller boot\nLess performance than superb \nLess features than superb",
        "user_name": "BMWX1",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewA car every family should look out for and have when it comes to comfort and safety. -Family of six.  :) :) :) :) :) :)",
        "user_name": "alex976",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewGot my first VW Passat 1.8 highline last week. Great car to drive. Fast acceleration. Very spacious interior and nice interior lighting ambience at night. Interior finish is nice with clean design. Sunroof added a spacious feel. Nice infotainment system which includes GPS, Carplay support, Auto Android and Bluetooth for mobile. Massage and memory function available at driver seat. Spacious boot. Back seats fully foldable. Exterior design is simple and clean look. LED head lights with daylights LED. 5 years warranty!\nNot sure why there are negative comments about Passat. But price wise, this car provide more values as compared to XE, 318, A4 and C180.",
        "user_name": "Fishy",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I likeNice interior finishes\nNice ambience lighting during night\nSunroof\nMassage function at driver seat\nParking Assist sensors to aid parking\nSpacious back seats\nSpacious boot space\nFoldable back seats\nGood infotainment system with Carplay and GPS support\nFast and stable car\n5 years warranty",
        "user_name": "razormustard",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I do not likeMaps update must be done at VW at a cost\nVW carnet service not available in Singapore",
        "user_name": "Power_Torque",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewNo value for what you pay!\ntesting car sound insulation is good. But delivered one is different. May be tires, engine oil, tuning are different.",
        "user_name": "Matoonia",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "What I likeventilating function seats\nleather steering wheel",
        "user_name": "Tanyachua88",
        "car_name": "Volkswagen Passat",
        "brand": "Volkswagen",
        "price": "$132,400 "
    },
    {
        "review": "ReviewThere is a reason why Golf wins the title for Car of the Year for many years.\nHave driven the 1.4 TSI Golf MK7 for 5 years, and it is still in good condition. I like to accelerate aggressively, but petrol consumption stays at about 15km/L. \n\nEasy to drive, simple to handle. Ideal car for everyone.",
        "user_name": "xiaohe",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I like- Excellent handling\n- Superb fuel consumption\n- Small Engine but powerful with Turbo\n- Space inside is bigger than you expect\n- Great sound insulation",
        "user_name": "Mlkong",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I do not like- maintenance is not cheap as Japanese cars \n- you need to have luck to avoid the DSG issue.",
        "user_name": "Allusionz",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewHaving driven 3 Toyotas & 2 Hondas in the past 20+ years, I finally bought a Golf MK7 R-Line thinking the DSG issue is history. During the 3 years warranty period, besides the 3 servicing that are included, I have to bring the car to VW Leng Kee for troubleshooting 5 times. 1. DGS issue, gearbox needed new parts 2. Air con sensor was spoiled & no in house stock   3. Auto hold is not working, need repair  4. Battery problem, need to be changed,  5 Start-stop button need change. The warranty was just expired last month, this week the car stalled on the road twice during morning rush hour traffic. After waiting for more than 6 hours in VW workshop, they told me it is Mechatronics fault, costs $4k to replace since the warranty is just over by 2+ weeks. After long negotiation with the servicing manager, he offered 20% Discount which is still $3k+! I am not sure how many major parts are yet to be replaced if I continue to keep this car in the remaining 6+ years...",
        "user_name": "R0etem",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I likeNicer to drive than most Japanese cars",
        "user_name": "LesterLam",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I do not likeReliability is also much worse than Japanese cars. I consider myself a smooth & experience driver, all my past Japanese cars have no requirement for major repairs & I am accident-free after 20+ years of driving. VW told me since they offer better technology, more repairs are expected. They even asked me to trade in my cars since it has just past 3 years & new cars nowadays offer 5 years warranty. Who knows if I won't get another lemon & how much time have I wasted taking my car for repairs? Anyway, this is the last VW I will own. Strangely a relative who stays in Canada recently gave me the same advice, he used to own a VW & it gave him so much problem that he has to quickly get rid of it. He advised me to do the same now.",
        "user_name": "Danls79",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewDriving it for the past 4 years. No regrets. Excellent handling from the best chassis. Smooth gear change and great acceleration when needed. Amazing power from this 1.4 variant. Fuel consumption is surprisingly good.",
        "user_name": "Savagetosh",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewHave been driving Golf for 2 months now. On the exterior, I love how it's not loud, being sharp and simple at the same time. Not a luxurious continental car but definitely one of the best in its class. \n\nFor interior, I like how it provides really good all-round view from all the windows and screens. Built quality is impeccable for its price point with decent noise insulation, materials used and attention was given to minor details.\n\nFuel economy, quick pick up speed are great for city driving. Audio and air-con are also better than most in its class to enjoy even while stuck in slow traffic.\n\nMaintenance can set you back a little bit more and you have to really pay attention to oil changes/parts replacement intervals to minimize serious problems from arising. \n\nOverall, weighing the pros and cons, its a definite recommended car for its comfort and quality.",
        "user_name": "Raychay",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I likeSmooth acceleration \nQuick pick up\nFuel economy\nDecent audio system\nGreat infotainment system\nGood visibility all-round for driver\nErgonomic seats",
        "user_name": "Eevee",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I do not likeHard suspension\nStart/Stop function can be annoying\nInclined to using OEM recommended parts (Still worried about failing components in the future)\nLack of mode of customization like european/other countries.\nHump at the middle of rear passengers' space\nPotential carbon build up issues common with direct injection engines",
        "user_name": "neski",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewI have been driving 1.0L TSI since jul18. \nthis is the MK7.5 version, hope the gearbox issue is a history for car owners now.\nprefer hatchback due to the spacious interior vs sedan.",
        "user_name": "Jem_Q",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I likeGear change was smooth, acceleration was fast even for a 3 cylinder engine.\nInterior is quite standard nothing too fanciful, but also has nothing to complain.\nInterior space is quite spacious, actually bigger than some sedan brands that i test drive.\nTail light is pleasing to look at.",
        "user_name": "Laserghia",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I do not like20KM/L listed on SGCARMART was dubious and requires verification.\n\nI'm a careful driver and i dont accelerate too much at all, but the max i achieve was 670KM at 47L tank. This equates to 14KM/L. \nIn order to achieve 20KM/L, driver will need to achieve 900KM in a 45L tank usage. How is this even possible?",
        "user_name": "algo85",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewI have been driving the 1.4 highline for two month plus already. Seems like mine was the first to be on road in singapore :)nothing to complain about. The handling and interior of the car was good.",
        "user_name": "BMWX1",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "What I likeEverything was good till now. Especially the digital display and the various sensor around the car that got me out of accident for few times. As for the 1.4 engine there is nothing to complain as it is a proven one.",
        "user_name": "mrkkhk",
        "car_name": "Volkswagen Golf",
        "brand": "Volkswagen",
        "price": "$105,900 "
    },
    {
        "review": "ReviewTiguan highline is almost perfect to me,the only down side is the power is not strong enough,but it also provide you fuel economic.If you really think the power is not enough you can modify the software of car by a few hundreds dollars(100% No harm to the car).",
        "user_name": "JuanwenSheng",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "What I likeEverything\nEspecially the looking,interior and outside. All show you the premium.\n\nAlso after ten years when you kill your car,you can get 20000,much better than other competitors",
        "user_name": "opgamerkkhk",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "What I do not likeNothing\nIf someday you think the power is not enough,just modify the software with a few hundreds dollars,can get 10-20% improve",
        "user_name": "andrealcolon",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "ReviewThis car kills the cx-5 totally, yes including the top spec 2.5. Interior is so spacious and airy with huge windows. Great sound proofing like typial VAG group cars. Looks is just nice and not overdone like current cx-5 and not as ah pek like harrier turbo. 3008 is lacking in interior quality and new engine. Best NVH and driving in class. Suspension works wonders like new X3. Am seriously impressed.",
        "user_name": "Mervynwm",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "What I likeFeatures Eg.cylinder deactivation which is really effective not like mazda's\nSpacious boot and interior\nSlick shifting 6 speeder, not unreliable 7 speed dsg DQ200 found in passat and golf\nHeavy doors",
        "user_name": "Nivlek96",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "What I do not likeThough it has best handling and quality in class, it cannot match the passat at both handling and acceleration due to high centre of gravity and hefty weight",
        "user_name": "chaihot",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "ReviewThe Volkswagen Tiguan is presented only in diesel fuel trim in a couple of grades: Comfortline and Highline. The exterior styling is a bit different from the European counterpart, while the features on offer have also been reduced as compared to the Europe-spec model. Still, the Tiguan SUV comes with a lot of bells and whistles, whether it is comfort and convenience, or the safety compartment.",
        "user_name": "vroom1963",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "What I like+Impeccable Safety Features\n+Extremely Spacious with Best Boot Capacity\n+Decent Mileage",
        "user_name": "Tanyachua88",
        "car_name": "Volkswagen Tiguan",
        "brand": "Volkswagen",
        "price": "$151,400 "
    },
    {
        "review": "ReviewIts been 1 month since I got this car and its fuel efficiency is getting better as the days pass by.The handling performance is one of the best its way better than the Toyota I used to drive.Although the price of this car is only a bit more expensive than the average Japanese car, I don't know why the sales volume are smaller  compared to other Japanese cars.",
        "user_name": "AQIANG",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I likeThe quality of the German car\nHandling performance one of the best  \nGood petrol efficiency \n7 SRS Airbag",
        "user_name": "Loner911",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I do not likeThe back door does not have a manual sunshade\nThe seats do not have electronic adjustment",
        "user_name": "Jeff0704",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "ReviewOwning it for 7 weeks with 1100km on the odometer, the DSG struck. Car been jerking so bad and at times goes half clutch. Towed back to VCS and found no issues. Did a software reload, drove home and immediately the problem came back. Got worse instead with gear grinding badly, car lost power, and suddenly surge forward. Not sure about the reliability of this car is able to last beyond 1 year. Probably it's a part and parcel to be stranded by road side in a Volkswagen",
        "user_name": "opgamerkkhk",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I like- handling is superb\n- very fuel efficient at 14km/L\n- ease of getting in and out of car due to wide door opening\n- 5 isofix seats",
        "user_name": "opgamerkkhk",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I do not like- DSG reliability, seriously avoid at all cost! What salesperson claim that issue solved is a mystery, it's a lie to me. \n- car rattled badly inside. \n- no option for electric seat. Difficult to switch between Wife and myself driving position.",
        "user_name": "yokechye",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "ReviewI've driven this for the past 13 months. Its comfortline model.\n\nThe 3 individual seats in the middle are comfortable. The last row is for really meant for kids. The drive is good overall. However be very careful during turning due to the high center of gravity. The interior is similar to golf. Its quite basic to me, the storage compartments are sufficient.",
        "user_name": "Kefuz",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I like- Drive\n- All Round Parking Sensor\n- The driving view\n- Price. 11-12k Depre 1 year ago.",
        "user_name": "superbyron",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I do not like- Turning\n- Reliability. DSG Gear Box. Still have another 2 years warranty.\n- Cheap plastic interior",
        "user_name": "Incubus22",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "ReviewThis is a supplement to my previous review. Went to Kedah with family of 6. I have been getting 15+km/ so fal. Idiotic start stop is a pain in the ass and will be looking to modify the system at outside workshop. Dynod the car and it produces close to 155 Hp and 274.6 Nm of torque, higher than VW suggests. Friend offered to re map the car to produce an estimated 170+ Hp and around 340+ Nm of torque",
        "user_name": "Sgho5754",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I likeAll that i stated before.\nAdditionally,\n1.Low end torque, easy overtaking on NSHW, drive about 190-200 km/h to Kedah\n2.Silent wipers\n3.Intuitive infotainment system compared to my porsche's\n4.Steering adaptive lights makes driving in malaysia's backroads easy\n5.Very easy to park, small size\n6.Air-con pretty strong and effective, third row also can feel within a short moment of turning on the air-con\n7.Pretty easy to find aftermarket parts(Changed my exhaust manifold, Exhaust tips and brakes. Changed the front lights to leds also)",
        "user_name": "kcng",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "What I do not likePrevious review alr stated\nBoot a big problem now for me, even fold one side down still insufficient on malaysia trips\n2wd cause a lot of wheel spin during hard acceleration, always happens when i accelerate from malysia tolls",
        "user_name": "BabyStar",
        "car_name": "Volkswagen Touran",
        "brand": "Volkswagen",
        "price": "$127,400 "
    },
    {
        "review": "ReviewTested this and the Odyssey back to back\nWith honda cvt having problems occuring, the 6-speed wet clutch Dq250 is much more reliable. Additionally, it is more responsive. Coupled with the GTI engine and  solid body, this mpv makes for a spirited drive. Sound proofing is excellent, just enough for families, not too slow like an mpv with torsion beam (XD). Great soft touch materials you would expect from vw grp cars. Super solid doors and great safety rating, unlike a japanese mpv with paper doors and poor safety rating!!",
        "user_name": "yokechye69",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I likeSound proofing\nReliability unlike Honda's cvt\nSufficient power\nSpacious\nSolid built\nPremium materials\nReasonable price\nAftermarket parts",
        "user_name": "Sakurecca",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I do not likeFuel consumption. 10km/l on 50/50 for past 2 years",
        "user_name": "jojovinu",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "ReviewSharan being a continental car, is rather expensive in its segment though it is the most powerful car in its class however being a family segment car, I don't think there is a need to be this powerful and alot of money is being wasted on many of its useless and impractical specifications and fittings. The drive is smooth, pickup is good but too strong for a family, good insulation, expected interior but outdated exterior. The leg space and sitting space is not as expected spacious given its sheer size, more cramped compared to odyssey.",
        "user_name": "opgamerkkhk",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I likeBig size vehicle",
        "user_name": "Presea",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I do not likeExpensive\nCramp leg space\nuncomfortable hard sittings",
        "user_name": "Xfire",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "ReviewI had a chance to test drive volkswagen sharan during an MCF event . My first impression was , this is a Big car and after test drive I realized that , this is the best Family SUV . \n\nIn interior it is really spacious and can accommodate my big family of 4 children and the boot is quiet big as well to carry the Lugguage.",
        "user_name": "Whiskeylime",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I likeThe Engine is more powerful , and easy handling as well.",
        "user_name": "Keithdylan",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "ReviewThe sharan is super big on the inside and out, parked next to estima/odyssey looks like giant. Selling price only 157 k and comes with a lot of features. Can you believe such a huge car with a 2 litre engine accelerates 7.8s??? It is faster than the miatas auto and suzufi swift sport aka poor ah beng chia. Third row spacious can fit seven adults comfortably, got money i confirm buy but now already book touran, almost 40k cheaper",
        "user_name": "Wolfverine",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I likespace\npower, when full load still very fast\n5 year warranty,3 year servicing\nhuge boot\nfeatures\nbuilt in booster seats\nsteering feel and handling\nVW materials and fit&finish top notch\nMany freebies from SE",
        "user_name": "lichya",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I do not likestylig starting to age but aging well\nbuild in portugal\ndifficult to park, can specc with pARK ASSIST THOUGH\nrims a tad too small\ntoo powerful, in mscp step too much will fly",
        "user_name": "Vjsi1316",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "ReviewStepping from the Passat which we owned for 9 years, this is an easy buy.\nThe car is huge on the inside, with the basic items that most would like in a people mover, including full size 3rd row of seats, easy to slide/move/adjust 2nd row, sun&moon roof, lots of cubby holes for storage.\n\nThe engine is an easy to love item, powerful enough to pull forward from standstill with sufficient poke to startle almost any standard car. The 350nm of torque also means that this huge car surges forward at the prod of the throttle, quickly reaching illegal speeds and beyond.\n\nThe new multi-media interface provides a bunch of customisations in addition to the built-in rear view camera view. From bluetooth connectivity, to a reduced set of phone applications (Android Auto and Automate compatible).",
        "user_name": "Seahkw",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "What I like- The Size and Spaciousness\n- The Power of the engine\n- The quick DSG gearbox\n- Autohold!",
        "user_name": "Sean_philip_lim",
        "car_name": "Volkswagen Sharan",
        "brand": "Volkswagen",
        "price": "$170,900 "
    },
    {
        "review": "ReviewWith a combination of style, comfort and power, the GTi, is only for those who have special appretion for cars and they’Re capabilities. Amatures won’T under the art under this baby’S hood. Nor can a wannabe make out what it’S made off. Only a true driver knows, the Beauty, of the beast",
        "user_name": "Philemon27",
        "car_name": "Volkswagen Golf GTI",
        "brand": "Volkswagen",
        "price": "$178,400 "
    },
    {
        "review": "ReviewOwned one for 10 years before i send it for scrap, first car i owned that long so it says alot. I have my fun driving it but same time spent many money to keep it running fit for ten years. Repair along cost me more than $40,000 over 10 years",
        "user_name": "OtsapmiHcstik",
        "car_name": "Volkswagen Golf GTI",
        "brand": "Volkswagen",
        "price": "$178,400 "
    },
    {
        "review": "What I likefun to drive even when it was stock yet has many potentials to enhance the power. many aftermarket parts are readily available too.",
        "user_name": "Nivlek96",
        "car_name": "Volkswagen Golf GTI",
        "brand": "Volkswagen",
        "price": "$178,400 "
    },
    {
        "review": "What I do not likeexpensive repair. even a 6 speed DSG will fail and its not cheap to repair. wear and tear is not as bad for daily drive. Oil leak is a common problem too,  Fortunately there are many many VW AUDI specialist workshops in singapore now",
        "user_name": "KennyLee83",
        "car_name": "Volkswagen Golf GTI",
        "brand": "Volkswagen",
        "price": "$178,400 "
    },
    {
        "review": "ReviewThe Golf GTI is one of the best sports hatches in the market. Acceleration is superb. Handling is great. Interior is well appointed and electronics are updated. Cabin space is good for 4 adults but gets too tight for 5. Price is slightly high for a face-lifted car. Fantastic car to drive around town and just enjoy the drive.",
        "user_name": "Pocus",
        "car_name": "Volkswagen Golf GTI",
        "brand": "Volkswagen",
        "price": "$178,400 "
    },
    {
        "review": "ReviewI bought my vehicle, a VW Sportsvan in Aug 2017. The car has been serviced by VW SG since then. From July to Sept this year, I had to send my car in for repairs and servicing 3 times; Car failure due to throttle body failure, regular servicing and clutch replacement. Just last week, I found the air conditioning system to be faulty and have to make arrangements to send my vehicle in again tomorrow. \n\nThe quality and level of servicing provided by Volkswagen SG just doesn't cut it. On hindsight, I will be happy driving a Jap/Korean vehicle.",
        "user_name": "Onizuka_eiji",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "What I likeMaybe the nice design of the logo?",
        "user_name": "Jon77",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "What I do not likeAlmost everything else",
        "user_name": "vroom1963",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "ReviewGood handling, enough comfort despite the large rim and sport suspension. Very spacious front and rear cabin. All for less than 4.4m in length. So that my wife can drive without me worrying too much.\n\nIt's a car that makes a lot of sense for a family man who wants the handling of a hatch/sedan while enjoying the extra space and easy for the young and elderly to enter and come out.\n\nAnd it doesn't roll around like any oversold SUV!\n\nToo bad Volkswagen will stop the SV line after the current iteration. Yeah SUV is THE global trend. But they really don't come close in terms of driveability.",
        "user_name": "SesameStreetGuy",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "What I likeGood handling\nResponsive DSG gearbox\nSpacious cabin\nClean and modern interior\nGreat 40-70km acceleration",
        "user_name": "Ivantanjh",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "What I do not likeErratic, sometimes harsh auto start stop\nTyre noise can be better insulated\n11 km/l fuel consumption below expectation\n0-40km not as powerful as 40-70km\nA bit worried about longevity of the DSG gearbox",
        "user_name": "Jan75",
        "car_name": "Volkswagen Golf SV",
        "brand": "Volkswagen",
        "price": "$116,900 "
    },
    {
        "review": "ReviewDesign/Comfort/Entertainment:\n*8 inch infotainment system is easy to use, good to look at with sharp, crisp graphics, menu buttons are clearly laid out, and comes with Apple Carplay or Android Auto\n*Dashboard material is soft touch plastic, with gun metal like glossy finish plastic trim across the dashboard; Together with piano black plastic and the 8\" Screen, the dash design feels modern, high tech & smart looking\n*Steering wheel is nicely designed, looks good & feels good to grab with quality leather\n*LED headlights w/ DRL comes as standard for both Comfortline & Beats edition locally, which looks cool & unique\n*Road and wind noise barely noticeable at cruising speeds\n\nSpace/Practicality:\n*Shares same platform as Golf so MK6 Polo has larger interior & boot space\n*Knockdown rear seats for added utility\n*Under boot floor storage to hide stuffs\n*Decent amount of leg & head room\n\nSafety/Convenience:\n*6 airbags, traction control, auto headlights, rain sensing wipers, keyless engine start, retractable side mirrors, cruise control, front & rear fog lamps, all round parking sensors - All are standard kit\n\nPerformance/Drivetrain:\n*MK6 isn't heavy so the 1.0 TSI performs adequately - 114BHP 200NM 0-100km/h in 9.5 seconds\n*Throttle response is good but you'll feel slight vibration from the 3cyl turbo engine - Just need to increase throttle input\n*Full torque of 200NM comes in early at around 2000 RPM so it's easy to get going\n*DSG shifts seamlessly & smoothly under acceleration, most of the time you don't even notice it, unless you're driving slowly in carparks then it can feel slightly jerky\n*Comes with paddle shifters for added fun & control\n*Overall, the new Polo is zippy around town areas and does well to keep up with others on the highway, with minimum hassle for overtaking\n\nConclusion:\nFor its price ($8x K when I bought it), you're getting a grown up, more practical & sensible Polo, with decent engine & transmission enough to have abit of fun, and together with its smart looking, well designed interior & good equipment list (in its segment), VW managed to not constantly remind you that you're buying the cheapest car in its range (unlike other brands) - Which is a good thing!",
        "user_name": "Hotbod",
        "car_name": "Volkswagen Polo",
        "brand": "Volkswagen",
        "price": "$96,400 "
    },
    {
        "review": "What I likePerky, responsive engine & transmission\nEasy to drive, predictable handling w/ small turning radius\nCool looking LED headlights with DRL\nSmart looking, modern interior\nSteering wheel design & feel + paddle shifters\nIncreased cabin & boot space (from previous model)\n8\" infotainment system w/ Apple Carplay\nLevels of NVH kept to a minimum\n5 year warranty & 3 x free servicing",
        "user_name": "MarkerPen",
        "car_name": "Volkswagen Polo",
        "brand": "Volkswagen",
        "price": "$96,400 "
    },
    {
        "review": "ReviewTest drive was the shortest i have ever done in the Alexander area. Probably i caused it because i just honestly told the SE I bought a new car just last year. Could see immediately he was going through the motion in getting the test drive over asap. Without realizing that the intended user was in the back seat. Cute.\n\nImagine i asked for the best price and SE told me the list price... Wow.. Just wow..",
        "user_name": "SuPerBoRed",
        "car_name": "Volkswagen Beetle Cabriolet",
        "brand": "Volkswagen",
        "price": "$129,900 "
    },
    {
        "review": "What I likeCar was surprisingly quiet considering it is a cabriolet.",
        "user_name": "mazdafever",
        "car_name": "Volkswagen Beetle Cabriolet",
        "brand": "Volkswagen",
        "price": "$129,900 "
    },
    {
        "review": "What I do not likeThe SE left an extremely bad taste after test driving.",
        "user_name": "jdmrockz",
        "car_name": "Volkswagen Beetle Cabriolet",
        "brand": "Volkswagen",
        "price": "$129,900 "
    }
]