[
    {
        "review": "ReviewNice car, decent ride but felt a little hollow as compared to its bigger siblings the XC60/90. Hate the fact that aircon controls are baked into touch screen and no direct physical buttons. Also, not nice was the price tag of 176k for a BASE model! Laughable. Go and test drive the car. Have fun. But I would NOT personally part with my money on this half chinese/swedish car especially, at that ridiculous price tag. Wearnes is getting over their head, to demand such funny price. OMV for the XC40 is only 24k and a Honda CR-V is at 28k and Honda is still much cheaper than the Volvo! That's comparing apples to apples.\n\nAs of 1 Aug 2019\n\nSubaru Forester 105k\nMitsubishi Outlander 109k\nOpel Grandland X 120k\nPeugeot 3008 130k\nHonda CRV 137k\nVolvo XC40 176k...  :P\n\nI would ONLY consider this car if price tag was between 115-120k, not a cent more. Besides, Volvo falls under the Wearnes Automobile group makes me cringe even further.\n\nMy previous Land Rover gave me many problems which I believe a competent workshop could have solved but being under the Wearnes group the service I got from the workshop was simply, sub-standard to the very least. People are friendly but many service staff seems to know nuts about these conti cars. Friend whom have recently bought a Renault (also under Wearnes) has complaints after complaints not over the car but on the service of vehicle. Another one of my wife's friend owned a Jaguar (under Wearnes) sold it for a Mazda due to same reasons. Fix one problem and create another one, in her exact words. Wearnes need to up their game especially, when it comes to proper customer service and training like what Borneo/Kah Motor is doing if they want a slice of that pie.\n\nSince Jan 2019 to June 2019 Volvo has sold approx 425 units of all cars vs Honda during same time period has sold over 7000 units. One must be doing something wrong and the other, something right. Go figure.",
        "user_name": "petrolpump",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "What I likeThor design lights\nexterior styling\ntransmission",
        "user_name": "Mervynwm",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "What I do not likeall stated on review column above",
        "user_name": "ahbui8",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "ReviewHope its not too late to write this...\n\nTested this some weeks back for a friend deciding between XC 40 and XC 60 (which has no issue with budget). \n\nTried the T5 than T4 as T4 was heard quite under power for a Volvo car weight.\n\nBeing sharing the same 2.0L engine (248bhp in XC 40 vs 254bhp in XC 60) but the larger sibling seems to be having little more issue in the \"Push\" Of the car due to its size.\n\nFrom the outside, its a smaller sibling of XC 60 with a better styling, better looks too. The \"THOR\" Lights are a norm to all Volvo now.\n\nInside is a typical high end continental car leather and details with the tablet mounted and flushed across the dashboard compared to others which juts out and seems like \"Additional\" Piece of equipment to me. Inside had high headroom and wider viewing span, compared to the sharpness in design that makes it smaller in GLA, QX30 and others in the same bandwidth.\n\nDrive off was GREAT as sufficient torque was given to \"Push\" This little fellow ahead. Gear changes was quite quiet and smooth too. Changing to sports mode was no issue as it kicks in almost in seconds.\n\nThe nimbleness to maneuver this small SUV was a breeze with all the alerts in traffic for you, known to be safe as a Volvo.\n\nA great to get if you are looking at a sizable SUV with great styling, gear changes, pickup and smooth drive, unless you need the slightly more people and boot space, then the next larger sibling, XC 60 is of your consideration and of course the max space, power and boot space consideration shall be none other than the eldest sibling namely XC 90.\n\nBottom line, Volvo offers 3 different taste of SUVs to your consideration from compact, mid and large to consider if pocket consideration is at you least.",
        "user_name": "Vincentfm",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "What I likeMany gadgets close to XC 60\nMore nimble drive\nGreat styling",
        "user_name": "Naughty9795",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "What I do not likePrice too steep at $180k (As at 7th Oct 2018)",
        "user_name": "chrisleong67",
        "car_name": "Volvo XC40",
        "brand": "Volvo",
        "price": "$168,000 "
    },
    {
        "review": "ReviewTested the T5. Good looking car. Like the Thor hammer head lights.\n\nInterior is good looking too compared to previous generation. The iPad size control panel is a good idea, the only other car that have such a big screen is Tesla, but that looks even better when compared to Volvo's.\n\nInterior is comfortable and e epseats are very comfortable, comparable to Lexus seats.\n\nCar drive is quiet and comfortable, like the high clear view It provides. The car is heavy at 1.8 tons, even tough it has a powerful 2 liter engine, it can't give you that woah feeling when you accelerate, maybe the T6 is required if you want to feel the acceleration slamming your head against the head rest.\n\nLots of safety features as expected of Volvo. This would be the suv you should drive, unless you want to pay more for a bmw, which may. It be as good as this.",
        "user_name": "Wasteland",
        "car_name": "Volvo XC60",
        "brand": "Volvo",
        "price": "$202,000 "
    },
    {
        "review": "What I like- good looks exterior and interior\n- good quality built on the dash board and steering wheel\n- Large touch pad control screen\n- Well known for being a car that protects its passengers\n- comfortable seats\n- quiet drive\n-T5 decent engine for the size and weight",
        "user_name": "Ripclaw",
        "car_name": "Volvo XC60",
        "brand": "Volvo",
        "price": "$202,000 "
    },
    {
        "review": "What I do not like- car is heavy, may need the T6 if you want more power to weight ratio",
        "user_name": "bahomet",
        "car_name": "Volvo XC60",
        "brand": "Volvo",
        "price": "$202,000 "
    },
    {
        "review": "ReviewSimple reason. It beats the rest of the competition out there for this price range. With a Polestar tuned T6, it churns out 345hp which is almost 100+hp more than the rest of the competition with same 2L engine platform. Super stylish and elegant front. The sexy back is like marmite: you either love it or hate it. This car packs top of the range road safety features which of course comes standard. Semi-autonomous driving is standard as well. Interior has the cleanest and simplest layout. Big center console screen for simple and intuitive maps, music, settings and aircon. All wheel drive for the T6 ensures you leave the rest of the pack in dust from stationary launch.",
        "user_name": "learjet45",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "What I likePowerful engine.\nIntellisafe safety features.\nSensus all in one maps (free lifetime upgrade), music and other settings center console.\nAutonomous driving.\nThor LED headlight.\n19' rims on T6.\nWide legroom space.",
        "user_name": "Winsonyk69",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "What I do not likeThe all important 360 camera only comes as optional indent.\nHeads up display not provided.\nStandard windscreen instead of laminated mirror for better noise reduction.\nNo blind spot monitoring systems (another optional item).\nPlastic dashboard instead of leather cover.",
        "user_name": "Richard_8289",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "ReviewLooking to replace my 4 year old F10 and have been researching quite a bit recently. \n\nToday I went to revisit the S90 T6 and took it for a test drive. \n\nThe performance was excellent and definitely good value for money. Seriously considering it now.",
        "user_name": "Wolfverine",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "What I like1. Superior horsepower and torque. \n2. Nice handling. \n3. Super comfortable seats. \n4. Boot release and close with foot sensing mechanism. \n5. Sunroof. \n6. 19\" rims. \n7. Auto-park. \n8. Generous leg room for front and back seats. \n9. Big boot.",
        "user_name": "Mervynwm",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "What I do not like1. No soft close door. \n2. 6 month road tax. \n3. High loan interest rate.",
        "user_name": "VinW",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "ReviewTested the s90 T5 yesterday. These are my view \n\nExterior - downstated but fresh different look from all the German Marques.Only outstanding conversation pieces are  the T LIGHTs aka. THOR hammer lights, the extra large front grill that dont seems to make it more fierce and the weird acquired taste rear lights \n\nInterior - T5 momentum is decent enough with added spaces almost a LIMO standards. The \"IPAD\" Command console is easy enough to use and has lesser buttons then any of the german cars. T5 wont have all that fancy LED interior color lights. Only T6 has that. Leather is comfy and cool . The T5 mid console is lacklustre with little space for anything else and has a rubberry like cover which cheapens the car \n\nEngine and performanace - from the start,the t5 is already raring to go and very powerful. For a sedan, its accelaration is worth a note and handling is smooth with some noise at hard acceleration. Over all handling is a sports sedan feel esp on dynamic mode. The rest of the modes are too soft or whimsical for my liking ( then again i drive hard ) \n\nThe T6 will have even faster acceleration and handling with the AWD and increased power.Imagine a 2 litre car with 300+ HP.",
        "user_name": "StreetFight3r",
        "car_name": "Volvo S90",
        "brand": "Volvo",
        "price": "$199,000 "
    },
    {
        "review": "ReviewVolvo was never really on my selection list.  Although when they announced the XC90 I remember thinking thats a very good looking car.  It looked quite similar from the back I thought, so it can't be that much different.  \n\nI needed to upgrade my car and I need/wanted something bigger.  I looked around and liked a few cars and I nearly decided on the Q7.  The Q7 was very nice and I've been an Audi fan for sometime.  Audi offered me a ridiculous low price for the Audi I was trading in and so I thought I'd take a look around.\n\nI was very surprised by the XC90.  It is feature rich, the engine is surprisingly punchy for a car that size (even the T5 version), it was extremely comfortable and quiet and I couldn't think of anything that I wanted that it didn't have (except blind spot monitoring).\n\nSo after a few months I can report that I am not at all disappointed.  The car drives like a small car.  The space in the cabin is superb, even in the the 3rd road.  I love the Volvo Sensus system that controls everything in the car and the digital dash coupled with the large LCD monitor in the middle is just brilliant.  Better in my view than other digital dashboard so far.\n\nJust before purchasing I had one more look at he Q7.  Compared to the XC90 it was quite feature poor.  The Q7 had nothing in comparison with the automated cruise, city asset, lane keep assist, 'matrix' LED head lights, etc making the XC90 a much better option.\n\nCertainly no regrets and I'd suggest you to just put it on the list to look at.  I've never thought of Volvo before.  I find them boring and the insides very bland and with minimal technology.  The XC90 shattered all these previous thoughts.",
        "user_name": "asiaroadwarrior",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "What I likeWicked styling, I think its the best looking 7 Seater/SUV available\nHigh quality finishing all over\nFeature rich all as standard equipment\nSensus touchscreen system is the best on the market at the moment\nVery spacious well thought out cabin with plenty of room",
        "user_name": "bb16",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "What I do not likeNo blind spot monitoring (given how much technology it does have this is an interesting omission)\nTurbo lag on the T5 is noticeable (if I had a few more dollars I would buy the super/Turbo charged version)\nA bit noisier than I originally thought\nNo drive mode selection option on the T5 (such as sport, comfort etc)",
        "user_name": "Wolfverine",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "ReviewI am in the market to buy a car and I must say I am impressed. The passenger experience is better than a Q7, X5 or GLE400. Only the RX350/450h has a better passenger experience. \n\nThe interior design is outstanding for its cool and quiet ambience. \n\nThe power from the dimunitive 4 cyl 2 liter is very impressive. Surprising. Handling is also surprising for a car this size. The car is very silent for a 4 cyl but achieves this through sound insulatioin rather than a quiet engine. Which is a slight negativel. \n\nThe car is quite large and can be challenging to drive and park in land scarce Singapore.",
        "user_name": "carfanB",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "What I likeExterior styling is nice. Clean lines and imposing presence. \nInterior styling is very nice. Again, clean and uncluttered. A very relaxing greenhouse. \nRide was comfortable with little roll. \nPowerful and small engine.",
        "user_name": "Mervynwm",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "What I do not likeThe sound of the 4 cylinder engine is disconcerting in a car in this price range. \nThe car is quite big and unwieldy. In Singapore car parks, expect to have lots of micro dents from opening car doors. \nA small displacement, 4 cylinder engine sounds good on paper but in the long run will struggle to keep up with a larger and more relaxed V6.",
        "user_name": "CarbonFalcon",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "ReviewI drove the XC90 T5 and T6 and I must say that I am very impressed with this 2l Drive-E engine with super and turbo charge. The numbers on paper (320hp; 400Nm) for this 2l engine really live up to my expectation and dare I say is comparable to my IL6 producing 320hp/450Nm. Of course the delivery is not as smooth but then again this is comparing a 6cylinders to a 4cylinder! Responsiveness is even better when the drive mode is set to Dynamic... Overall, must say the engine performance for this new batch of Volvo has really changed my view of what Volvo used to be!\n\nFeatures wise, I must say the base Momentum model is already quite well equip as noted by many reviews. I had the opportunity to also ride in the R-design model which is approx $35k more. The price difference gets you couple of key items as follow:\n1) Sun roof\n2) Drive mode control\n3) Nappa leather interior\n4) Host of R design equip both external (body kit) as well as internal (seat, steering, etc)\n5) 20\" Alloy wheels\n6) 12.3\" Adaptive digital display\n\nIMO, the $35k is well justified and worth splurging.",
        "user_name": "KC83",
        "car_name": "Volvo XC90",
        "brand": "Volvo",
        "price": "$290,000 "
    },
    {
        "review": "ReviewI have reviewed this earlier after a test drive and was deciding on this vs E220D estate brought in by Parallel importers for about the same price. I finally went for this with a 5 +5 year service and warranty plan. The Benz was a diesel which I had no chance to test out and therefore decided against it and the warranty was for only 1 year and no free service. \n\nAfter 2 full months the car is riding well. The Pilot assist is great to have on highways and when you are having a conversation with your passengers or fiddling with the ICE. The ICE very occasionally hangs. The car can be customised to 2 main drivers and one guest to appropriate key fobs . The drive is serene and more comfortable then anything else I have  driven except for the LS 460 it replaced. It is quiet but the AC fan is a little weak. Need to set it at 22 for sufficient cooling. Its perhaps surrounded by windows making it bright and airy but warm in the sun despite V-cool film. The drive is good but its no not hatch despite its 265 bhp. It will keep one very comfortable on long drives as the seats are firm and orthopaedically supportive. Interestingly there is no BLIS on the Momentum model and the TFT screen shows only one dial with Map on ICE screen but there is surround sensors making it beep and tweet a lot! Also the auto emergency brake system can be jarring at times but has potentially save me once from backending the front car.",
        "user_name": "Purplexus",
        "car_name": "Volvo V90",
        "brand": "Volvo",
        "price": "$235,000 "
    },
    {
        "review": "What I likeComfortable, luxurious and very soothing to drive.\n\nAmazing safety features especially Pilot Assist that keep you in lane.\n\nService at 15K intervals.",
        "user_name": "Purplexus",
        "car_name": "Volvo V90",
        "brand": "Volvo",
        "price": "$235,000 "
    },
    {
        "review": "What I do not likeAbsence of BLIS and touch screen interface which is not sensitive enough and the screen looks smeared very often. A toggle like in the Lexus or Benz would be better. The weak AC can be improved.",
        "user_name": "Jan75",
        "car_name": "Volvo V90",
        "brand": "Volvo",
        "price": "$235,000 "
    }
]