[
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nMercedes-Maybach GLS on course to face Bentley Bentayga in 2019https://www.autocar.co.uk/car-news/new-cars/mercedes-maybach-gls-course-face-bentley-bentayga-2019\n \n \n\n \nMercedes-Benz’s upmarket Maybach sub-brand is preparing to extend its line-up beyond the S-Class with a plush range-topping version of the upcoming third-generation GLS (formerly GL).\nMaybach is considered an important brand for Mercedes to develop given the rising demand for luxury models, particularly in the SUV sector, with rivals such as Bentley and Land Rover having notable success with their respective Bentayga and Range Rover.\nMercedes has also seen strong growth from its AMG performance arm, which achieved 131,970 sales in 2017, and it would like to emulate this success with Maybach on a smaller but profitable scale.\nThe SUV, which was reported to be on the cards by Autocar in 2016, is set to make its debut as a lightly veiled concept car at the Beijing motor show in April. It will then be revealed in production guise at theLos Angeles motor show in November. The car is tipped to be priced above £120,000 when sales begin in 2019.\nThe new Mercedes-Maybach GLS will build on initiatives taken with the two-year-old Mercedes-Maybach S-Class (below).\nThe new Maybach SUV will share the same basic aluminium and steel bodyshell and advanced four-wheel- drive underpinnings as less heavily specified versions of the new GLS. However, Autocar has been told its upmarket positioning will be underlined by a series of subtle exterior design tweaks and a significantly more luxurious interior than standard versions of the US-built SUV.\nInsiders involved in the development of the Mercedes-Maybach concept car, known internally as the Maybach 9, say it will not only preview the look of the new model, with a bold new grille among the elements aiming to provide it with added exclusivity, but will also highlight the sort of upmarket features, including autonomous driving functions, to be offered on the production version of the SUV\nA high-level official told Autocar: “We have been quietly surprised by the sales success of the Mercedes-Maybach S-Class, which is proving extremely popular in many key markets. The plan now is to extend the exclusivity surrounding the Maybach name into the upper end of the SUV segment. We’re confident this new model will leave little to be desired in terms of luxury.”\nThe basis for the new GLS is Mercedes-Benz’s MHA (Modular High Architecture) platform. A development of the existing MRA platform, it is intended to underpin a series of new models, including the new GLE and GLE Coupé.\nIt provides a significant reduction in kerb weight, the capability to support a 48V electrical architecture and the very latest in radar, camera and sensor-supported driving functions.\nThe Maybach-badged GLS is likely to be offered exclusively with the Mercedes-AMG-developed M177 V8 petrol engine. In the recently launched S560, this twin-turbo 4.0-litre V8 produces 462bhp, setting up the possibility of the new model being called GLS 560 for production.\nThe new engine, which features a cylinder-shutdown function for added fuel savings in city driving, will replace the twin-turbo 4.7-litre V8 used by today’s GLS 500.\nAlso under discussion for the new Mercedes-Maybach model is the plug-in petrol-electric drivetrain recently unveiled in the S560e. It combines Mercedes’ new turbocharged and electronic supercharged 3.0-litre in-line six-cylinder petrol engine, developing 362bhp, with a 121bhp electric motor. In the new GLS, it is claimed to use a lithium ion battery for a pure-electric range of up to 31 miles.\nWith the GLS produced exclusively at Mercedes’ Tuscaloosa plant in Alabama, the luxury SUV will be the first Maybach model to be produced in the US.\nAs well as providing stiff competition to the Bentayga, the Maybach GLS has also been conceived as a rival to the likes of the Rolls-Royce Cullinan and Range Rover SVAutobiography.\nMeanwhile, Mercedes-Maybach is planning to launch an upgraded version of the S560 at the Geneva motor show in March. Among the changes planned for the saloon is a newly designed grille that will set the tone for all future Maybach-badged models.\nWhat the Maybach GLS must beat: \nBentley Bentayga:\nBentley got there first with its Bentayga, which has been a major lifeline for the brand. A 4.0-litre V8 diesel has gone down well alongside the W12 and a hybrid arrives this year.\nRolls-Royce Cullinan:\nThe Cullinan (its name has yet to be finalised) arrives this year. Rolls’ first four-wheel drive shares its architecture and 6.75-litre V12 with the new Phantom.\nLamborghini Urus:\nThe 641bhp Urus, on the roads in spring, is expected to double Lamborghini’s sales to 7000. The firm insists it is a high-performance car and achieves 0-62mph in 3.6sec.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Jamesc",
        "comment": "\n\t\t\t\n\nMercedes-Maybach GLS on course to face Bentley Bentayga in 2019\nhttps://www.autocar.co.uk/car-news/new-cars/mercedes-maybach-gls-course-face-bentley-bentayga-2019\n \n \n\n \n\n \n\n \nBoth competing to see who can have the uglier face.\n \n\"My face is uglier than yours. Take that Bentley.\"\n \n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\n\nBoth competing to see who can have the uglier face.\n \n\"My face is uglier than yours. Take that Bentley.\"\n \n \n\nLet's hope it remains just an ugly rendering.\n \n \n \nReal car better don't look like this. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\tMaybach is fugly\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nMaybach is fugly\n \nThis?\n \n\n \nOr this?\n \n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\tBoth\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nBoth\n \n \n \nI just saw the S class Maybach on the roads today.\n \nLooks ok to me. Maybe the rims in the picture makes it look ugly. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Hamburger",
        "comment": "\n\t\t\t\nMade for the sake of making.\n \nOver size ugly looking hatchback.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Thaiyotakamli",
        "comment": "\n\t\t\t\n\nThis?\n \n\n \nOr this?\n \n\nDesign wise not wow but level of quietness is something that the rivals cant match\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Nonewposts",
        "comment": "\n\t\t\t\n\n\n \nI just saw the S class Maybach on the roads today.\n \nLooks ok to me. Maybe the rims in the picture makes it look ugly. \n\n\n \nthis rim is much better\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Steptronic",
        "comment": "\n\t\t\tBoth are ugly. I would go for Bentley, at least the batch is powerful.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\n\n \nI just saw the S class Maybach on the roads today.\n \nLooks ok to me. Maybe the rims in the picture makes it look ugly. \n\n \nIn Beijing, i saw it almost everyday.\n \nThe more i see it, the more i feel it is fugly.\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nDesign wise not wow but level of quietness is something that the rivals cant match\n \nWhich rival?\nBentley Mulsanne\nor\nRolls Royce Phantom\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Thaiyotakamli",
        "comment": "\n\t\t\t\n\nWhich rival?\nBentley Mulsanne\nor\nRolls Royce Phantom\nEver read a report for world most quiet car and maybach 62 which won the title over other competitors even RR\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Renegade777",
        "comment": "\n\t\t\t\n\nBoth competing to see who can have the uglier face.\n \n\"My face is uglier than yours. Take that Bentley.\"\n \n \n\n \nThese are the new handsome.\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited March 17, 2018 by Renegade777\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Jamesc",
        "comment": "\n\t\t\t\nThese are the new handsome.\n \nIf ugly is the new handsome\n \nthen I am very ugly.\n \n   \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "camrysfe",
        "comment": "\n\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "ER-3682",
        "comment": "\n\t\t\tDoes these \"Petrol Guzzlers\"  still got a Place in Earth.?   \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Koster",
        "comment": "\n\t\t\t\nDoes these \"Petrol Guzzlers\"  still got a Place in Earth.? Yes but not so in Singapore.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "mistergoh",
        "comment": "\n\t\t\twhy the nostril so big?\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Koster",
        "comment": "\n\t\t\t\nwhy the nostril so big?Need to compete with BMW on the nostril size mah\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Sdf4786k",
        "comment": "\n\t\t\t\nDesign wise not wow but level of quietness is something that the rivals cant match\n \nwow.. next time run over a bicycle in mayback can say did know .. too quiet\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nThe new Mercedes-Benz GLS is Mercedes-Benz's largest and most luxurious SUV and, above all, offers more: more space, more comfort, more luxury. The confident presence of its exterior stems from its impressive dimensions, which are even larger than those of its predecessor (length +77 mm, width +22 mm). One of the benefits of the 60 mm longer wheelbase is interior spaciousness, especially in the second row. The three fully electrically adjustable seat rows offer all passengers a generous amount of space and outstanding seating comfort. The seats in the third row can be lowered into the floor to increase the boot space (up to 2400 litres), while the seats in the second row fold flat. Furthermore, a six-seater variant with two luxury individual rear seats in the second seat row is available for the first time. Celebrating its world premiere in the GLS 580 4MATIC is an electrified V8 engine featuring EQ Boost - a 48-volt system with integrated starter-generator.\n \nThe E-ACTIVE BODY CONTROL active suspension on 48-volt basis offers outstanding suspension comfort, agile handling and a high degree of off-road capability. Like the GLE, the GLS features the latest generation of Mercedes-Benz driving assistance systems giving cooperative support to the driver. The new 4MATIC ensures great agility on the road and strong performance off the beaten track. The new GLS has impressive aerodynamics in its segment, with a Cd figure of 0.32. It has a new Carwash function, which enables the car to be prepared for entry into a carwash with a single press of a button.\n \n\nAs the S-Class of SUVs, the new GLS indulges its passengers, especially those in the rear. The key comfort features at a glance:\n \n- MBUX Rear Seat Entertainment System: Two 11.6-inch touchscreens for movie, music and internet enjoyment\n- Rear Comfort package Plus: Separate tablet for controlling all of the MBUX comfort and entertainment functions from the rear seats\n- Electrically adjustable seats throughout as standard, as is the Easy-Entry function, which makes it easy to get into and out of the third seat row\n- Simple folding-down of all rear seats at the push of a button\n- Choice of either three-seater rear bench seat or two luxury individual seats with armrests in the second row\n- Two fully fledged seats in the third row (for people up to 1.94 m tall)\n- Heated seats and separate USB charging ports for the third row, too\n- Five-zone automatic climate control available.\n \n\"The new GLS is the S-Class of premium SUVs. It embodies luxury, confidence and intelligence like almost no other vehicle,\", states Ola Källenius, the member of the Board of Management of Daimler AG responsible for corporate research and Mercedes-Benz Cars development.\n \n\"The GLS combines modern luxury with the character of an off-roader,\" says Gorden Wagener, Chief Design Officer at Daimler AG. \"Powerful highlights of the off-road design idiom combine with an elegance reminiscent of a classic luxury saloon. The interior is a synthesis of modern, luxurious aesthetics, hallmark SUV practicality, and digital high-tech. In our view, the new GLS therefore offers the best of all these worlds.\"\n \nSince 1997, when the M-Class was introduced, Mercedes-Benz has been building premium SUVs in the USA - the main market for these vehicles worldwide. The GL full-size variant offering space for seven people was launched in 2006. In 2015, a facelift emphasised the luxury character of the large SUV's second generation and also heralded the changing of the name to GLS. On top of that, it is the market leader in its segment - just like the S-Class Saloon.\n \nAt present, Mercedes-Benz offers seven models in the SUV segment (GLA, GLC, GLC Coupé, GLE, GLE Coupé, GLS, G-Class). The SUVs are a major structural pillar in the Mercedes-Benz product portfolio, and greatly contribute to the growth of the brand. To date, more than six million customers worldwide have purchased a Mercedes-Benz SUV.\n \nThe new Mercedes-Benz GLS was presented to the public for the first time at the 2019 New York International Auto Show. It will be in the dealerships in USA and Western Europe by the end of 2019. The GLS is produced in Tuscaloosa (Alabama/USA).\n \nExterior design: powerful presence\n \nModern luxury both on and off the road: that is the design message of the new GLS. Its aesthetics are based on the confident presence that its impressive dimensions alone create (length 5207 mm, width 1956 mm). The wheelbase of 3135 mm, which is 60 mm longer than that of its predecessor, makes the vehicle beneficially longer and gives it harmonious proportions, emphasised by the understated, elegant side design. The GLE follows the design strategy of Sensual Purity, and dispenses with individual edges and beading in favour of generously sculptured surfaces.\n \nThe front section of the new GLS exudes presence and power: this is ensured by the upright radiator grille in an octagonal SUV interpretation, the prominent, chrome-plated underguard in the front apron with the bone-shaped air inlet grille, and the bonnet with two powerdomes. This striking appearance is emphasised by the distinctive headlamp design by day and night. The GLS has MULTIBEAM LED headlamps as standard, with a total of 112 LEDs per headlamp. These produce the maximum light intensity permitted by law, which results in the brightness of the main beam headlamps only falling below the reference value of 1 lux after a distance of more than 650 metres. The daytime running lights with three LED segments underline the status of the GLS as the S-Class of SUVs.\n \nThe GLS cuts an imposing figure from the rear, too. This is particularly ensured by the powerful shoulder muscle extending from the rear doors to the tail lights, which enables the GLS to strike an imperious pose on the road. The two-piece tail lamps are based on LED technology, and their high-calibre, three-dimensional look conveys depth and solidity. The reflectors are relocated lower down, giving the tail lamps a flatter appearance. They are crowned by a slender, continuous chrome trim strip. The rear is strikingly rounded off with the chrome-plated underguard.\n \nAerodynamics: exquisite fine-tuning\n \nThe new GLS achieves cd figures as low as 0.32 - a clear improvement compared with its predecessor (cd 0.35) and an impressively low figure in the large luxury SUV segment. The excellent aerodynamics help to firstly reduce fuel consumption and secondly limit wind noise, one of the areas on which development work focussed specifically.\n \nSpecial attention was paid to the underbody and the air flowing through the engine compartment. Not least because the hallmark SUV shape, with its upright front end and high ground clearance, makes these areas susceptible to low-frequency airflow noise. A host of details was optimised with numerous computation loops, CAE simulations (computer-aided engineering) and measurements in the wind tunnel in Sindelfingen.\n \nInterior design: luxuriously elegant and powerfully progressive\n \nThe interior of the new GLS is all about luxuriously elegant aesthetics, as evidenced straight away by the leather appointments, which come as standard. They combine the comfort of a Mercedes-Benz luxury saloon with the robustly progressive detailing of an SUV. The central element in the dashboard's design is an impressively sized screen unit embedded in a distinctive dashboard support. The dashboard support flows into the door panels, and the integral trim element likewise extends to meet the doors.\n \nThe prominently wide, raised centre console creates a robust contrast with the free-floating appearance of the dashboard. As a typical feature of off-roaders, there are two prominent grab handles on the centre console. Apart from good ergonomics, fluent leather surfaces create a modern, luxurious impression, rounded off by a broad area of trim and flush-fitting sunblinds. The controls with haptic and audible feedback appear to have been milled from a solid metal block.\n \nThe large touchscreen of the MBUX infotainment system allows all the GLS comfort features to be controlled from the driver's seat. Very fine chiselling and the pyramid structures of the trim surfaces show the desire for perfection and craftsmanship. The new multifunction sports steering wheel with its striking spoke design accentuates the impressive appearance of the SUV's interior.\n \nInterior: generous amount of space in the second and third seat row, too\n \nThe new GLS has a considerably longer wheelbase than its predecessor (3135 mm, an increase of 60 mm). This creates more space, especially in the second seat row, which can furthermore be adjusted fore and aft. Legroom here is increased by 87 mm when the seats are in their rearmost position, which also makes it easier to get into the vehicle.\n \nAs standard for the European market, the second row has a 60:40-split folding rear bench seat with adjustable 40:20:40-split backrests. Alternatively it is possible to order the American standard configuration with two luxury individual rear seats with armrests, between which it is possible to access the rearmost seats with ease. This is particularly useful when child seats are fitted in the second seat row.\n \nAll seats are electrically adjustable as standard. The same applies to the EASY-ENTRY function, which makes it easy to get into and out of the two individual seats in the third row. For this, the seats in the second row move a long way forwards and fold forwards.\n \nThe seats in the third row are fully fledged seats that are suitable for people up to 1.94 m tall and are heated for the first time. There are also separate USB charging ports here.\n \nIf the GLS is equipped with the five-zone automatic climate control, the third row has its own zone with climate control vents in the roof. This zone is supplied by its own, electrically powered heater and air conditioner.\n \nA push of a button is all that is required to stow away the comfortable seats and make full use of the 2400-litre boot space in the GLS. The switches on the left and right of the load compartment and on the front of the wheel arches on the front-passenger side in the C-pillar area allow the seats in the rear rows to be folded completely flat. It is also possible to fold down all the seats simultaneously by pressing the \"ALL\" button. The carpet-trimmed backs of the backrests form part of a flat, practical load area. Another push of a button lowers the boot sill by approx. 50 mm to make it easier to load heavy items.\n \nEven more comfort in the rear: MBUX served on a tablet\n \nLuxury in the new GLS is shared generously among all passengers, particularly if the Rear Comfort package Plus is ordered. It includes a 7-inch Android tablet in its own docking station in the second row's larger luxury centre armrest. The tablet allows control of all the MBUX comfort and entertainment functions (see next section) from the rear seat rows, such as access to radio, TV, media, phone and web browser. It can also be used to control the Rear Seat Comfort package and the five-zone automatic climate control for the rear seats. The driver can assume control of all options and features from his or her seat at any time, of course.\n \nThe centre console also offers a wireless-charging compartment for smartphones and additional USB ports. Rear passengers are indulged further still thanks to luxury head restraints with additional cushions and the rearward-extended centre console between the front seats with cup holders.\n \nIt is even possible to order luxury seats with lumbar massage function and climate control as an additional option for the Rear Comfort package Plus in the second row.\n \nThe MBUX Rear Seat Entertainment System is available for all seating variants - for even more entertainment and convenience. It includes two 11.6-inch touchscreens that allow passengers in the second row to enjoy movies or music, use the integrated web browser, or call up and input trip information. Each screen displays the content selected by the individual user. In addition to the options offered by the MBUX infotainment system, users can also play their own media from a mobile phone, tablet or laptop. If the GLS is equipped with the optional MBUX rear tablet, this can also be used to control the MBUX Rear Seat Entertainment System.\n \nMBUX with Interior Assistant\n \nThe GLS is equipped with the latest generation of the infotainment system MBUX (Mercedes-Benz User Experience). Upgrades compared with the A-Class, in which the revolutionary system made its debut, include two large 12.3-inch/31.2 cm screens. The information on the instrument cluster and media display is easily legible on the large, high-resolution screens. An emotive presentation with brilliant graphics underlines the comprehensibility of the intuitive control structure.\n \nThe optional MBUX Interior Assistant also allows intuitive operation of different comfort and MBUX functions by movement recognition. A camera in the overhead console registers movements of the driver's and front passenger's hands and arms. When a hand approaches the touchscreen or the touchpad on the centre console, the media display changes and individual elements are highlighted. The system is able to distinguish the driver's hand from that of the front passenger, and therefore knows for whose seat the massage function is to be activated, for example.\n \nIn addition there are functions that can be controlled by simple hand gestures: the reading lamp can be switched on and off by extending a hand towards the interior mirror, for example. Furthermore, the driver and front passenger can each store personal favourite functions, e.g. \"navigate home\" or \"call office\".\n \nA unique feature of MBUX (Mercedes-Benz User Experience) is its learning capability thanks to artificial intelligence. With its predictive functions, MBUX anticipates what the user would like next, for example. For instance, anyone who often telephones their mother on Tuesdays during the journey home will receive her telephone number as a suggestion in the display on this day of the week. Anyone who regularly switches over to a radio station with news at a certain time also receives this as a suggestion.\n \nAlso available is a next-generation full-colour Head-up Display, which sets new standards with a resolution of 720 x 240 pixels and an extended projection distance.\n \nPowertrain: all petrol engines have integrated starter-generator and EQ Boost\n \nThe high aspirations of the new Mercedes-Benz GLS are likewise clearly apparent in its engine line-up. Powerful six and eight-cylinder engines deliver the motoring comfort and effortlessly superior power that suit the characteristics of this luxurious car.\n \nShortly after the model series launch, the introduction of the GLS 580 4MATIC will mark the world premiere of a new, electrified V8 petrol engine with 48-volt on-board electrical system and integrated starter-generator. It has an output of 360 kW (489 hp) and 700 Nm of torque, with a further 250 Nm of torque and 16 kW/22 hp available via EQ Boost over short periods. The integrated starter-generator (ISG) is responsible for hybrid functions such as EQ Boost or energy recuperation, while allowing fuel savings that were previously reserved for high-voltage hybrid technology.\n \nISG eliminates the need for a belt drive for ancillary components at the front of the engine, which reduces its overall length. The slim design of the in-line engine, together with the physical separation of intake/exhaust, creates space for close-coupled exhaust aftertreatment. The 48 V on-board electrical system serves not only high power consumers, such as the water pump and air-conditioning compressor, but also the integrated starter-generator (ISG), which also supplies energy to the battery by means of highly efficient energy recuperation.\n \nThe Mercedes-Benz GLS 450 4MATIC, a six-cylinder in-line engine electrified with 48-volt technology, is only available outside of the EU. Its performance data: 270 kW (367 hp) and 500 Nm of torque, with a further 250 Nm of torque and 16 kW/22 hp available via EQ Boost over short periods.\n \nDiesel: six-cylinder engine for Europe, Russia and other markets\n \nThe two diesel-engined GLS models are powered by the OM 656, the six-cylinder in-line engine from the current engine family. It is available with two ratings, depending on the particular market launch: as the GLS 350 d 4MATIC with 210 kW (286 hp) and 600 Nm and as the GLS 400 d 4MATIC with 243 kW (330 hp) and 700 Nm torque. In both versions, the powerful engine already complies with the Euro 6d- standard (RDE/Real Driving Emissions Step 2), which does not come into force until 1 January 2020 for new models and one year later for all vehicles, even in demanding driving conditions.\n \nThis is achieved with, among other things, an additional selective catalytic reduction (SCR) converter with an ammonia slip catalyst (ASC) in the exhaust tract of the GLS. This allows dosing of the AdBlue reducing agent that is even more closely aligned with the individual driving characteristics because any excessive ammonia surplus in the second SCR converter is broken down further. The AdBlue tank has a capacity of 31.6 litres. As before, refilling is convenient via a separate pipe behind the fuel filler flap.\n \n4MATIC all-wheel drive: agile on the road, superior when off-road\n \nIn all variants of the new GLS, power is transmitted by the 9G-TRONIC automatic transmission. The broad ratio spread of gears one to nine allows a clearly perceptible reduction in engine speed and is a decisive factor behind the high level of energy efficiency and ride comfort. A transfer case with electronically controlled multi-plate clutch is likewise fitted as standard. This allows a variable transfer of drive torque from 0-100 percent (torque on demand) between the axles.\n \nAlso new, and available as an option, is a transfer case specially configured for superior off-road driving characteristics. In addition to the controlled multi-plate clutch with torque-on-demand function, it also features a reduction gear for off-road driving.\n \nAlso when driving on the road, and particularly when cornering, the two fully networked transfer cases with torque-on-demand function allow a further improvement in handling safety and agility by specifically influencing the degree of yaw to induce oversteer or understeer.\n \nDriving assistance systems: even better support\n \nThe new GLS is equipped with the latest generation of Mercedes-Benz driving assistance systems giving cooperative support to drivers. These systems further enhance the level of active safety.\n \nWhen Active Distance Assist DISTRONIC with route-based speed adaptation is activated, the new GLS is able to recognise and respond to tailbacks or slow-moving traffic with the help of information from Live Traffic before the driver becomes aware of the hazard. When a traffic jam is detected on the motorway (and if the driver does not choose a different response), for example, DISTRONIC reduces the speed to around 100 km/h as a precaution.\n \nA new feature of Driving Assistance package Plus: When actually driving in a tailback on the motorway, Active Stop-and-Go Assist is substantially able to perform the tasks of keeping in lane and maintaining the safety distance with a high level of availability at speeds up to around 60 km/h. Moving off can be automatic up to one minute after coming to a stop. Once the tailback clears, the GLS accelerates back up to the speed preset for Active Distance Assist DISTRONIC with route-based speed adaptation. If traffic signs differ from this, the signposted speed limit is automatically given priority.\n \nTrailer Manoeuvring Assist is available as an option for the GLS in Europe. This makes reverse manoeuvring easier for drivers who are not so familiar with towing trailers. And it is also of benefit to more experienced drivers when towing longer trailers.\n \nSuspension: AIRMATIC air suspension as standard\n \nThe GLS comes with the enhanced AIRMATIC air suspension system with Adaptive Damping System Plus fitted as standard. This setup uses highly complex sensor systems and algorithms to adapt the damping characteristics to the road condition and driving situation in real time. All components have been enhanced compared with the previous generation, and the wheel suspension mountings have been optimised to maximise ride comfort. In addition to this, the air suspension keeps the car at the same level, regardless of the load on board.\n \nCarwash function: ready for cleaning\n \nOne new, standard feature is the Carwash function - which comes in very handy, especially for a large vehicle like the GLS. When this function is selected, the suspension moves to the highest position, which reduces the track widths due to the axle geometry. This makes it easier to drive into a carwash as well as remove any dirt remaining in the wheel arches from the last off-road trip. The Carwash function also:\n \n- Folds in the exterior mirrors.\n- Closes the side windows and the sliding sunroof.\n- Suppresses the rain sensor information so that the windscreen wipers remain switched off in the carwash.\n- Switches the climate control to air-recirculation mode and , after eight seconds, activates the 360° camera's front image to assist the driver when driving into the carwash\n- Deactivates these settings automatically when the driver drives out of the carwash and accelerates to a speed above 20 km/h.\n \nOutstandingly intelligent suspension: E-ACTIVE BODY CONTROL\n \nEven better ride comfort and agility plus new functions such as recovery mode are provided by the optional E-ACTIVE BODY CONTROL suspension, which is combined with the newly developed AIRMATIC air suspension. This is currently the only system on the market that can individually control spring and damping forces at each wheel. This means that it not only counteracts body roll, but also pitching and squat. Together with ROAD SURFACE SCAN and the curve inclination function CURVE, E-ACTIVE BODY CONTROL makes an exceptional level of comfort possible, and supports the claim of Mercedes-Benz to build the world's most intelligent SUV suspension.\n \nE-ACTIVE BODY CONTROL operates with a voltage of 48 V, and is available as an optional extra. On poor road surfaces the system is even able to recuperate energy, roughly halving the energy requirement compared with the preceding system in the S-Class. The hydropneumatics generate dynamic forces that overlay the air suspension forces and actively support and dampen the vehicle body, e.g. during linear and lateral acceleration or when driving on uneven roads.\n \nThe off-road functions include recovery mode: if the GLS has become bogged down in a sand dune, for example, this can help to free the vehicle more easily in many such situations. If possible the suspension level is automatically raised and lowered several times, which changes the ground pressure of the tyres and therefore improves traction - the GLS rocks itself free. Individual wheel actuation is another function for off-road driving. This allows the level at each wheel to be individually adjusted via the touchscreen of the media display, thus improving the vehicle's alignment on rough terrain when one wheel is stuck in a ditch or a wheel spring is fully contracted, for instance. This also helps to increase traction and the torque at the wheel.\n \nE-ACTIVE BODY CONTROL in the GLS also has the curve inclination function CURVE: like a motorcycle, the GLS leans into bends and thereby allows cornering in three stages with practically no centrifugal force. If the GLS is equipped with a stereo multi-purpose camera, ROAD SURFACE SCAN becomes possible: the camera continuously scans the road surface, while the suspension responds in advance to any undulations before the vehicle drives over them and largely compensates for them. In this way, the GLS improves the perceived road quality.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vinceng",
        "comment": "\n\t\t\t\nMaybach is fugly\nTo be seen in one is a strong statement of your financial status\n \nhttps://www.sgcarmart.com/used_cars/info.php?ID=797014&DL=1177\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "camrysfe",
        "comment": "\n\t\t\t\n\nTo be seen in one is a strong statement of your financial status\n \nhttps://www.sgcarmart.com/used_cars/info.php?ID=797014&DL=1177\n\t\t\t\tDepreciation\t\t\t\t\t\t\t\t\t\t\t\t\t\t$357,960 /yr\t\t\n\n\t\t\t\n\t\t"
    }
]