[
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nA petrol engine making more torque than diesel equivalent?? The dream have come true...   \n \nMercedes-AMG Details Most Powerful 4-Cyl Ever, Makes 416 HP 500 Nm\n \n\n \n\n \n\n \n\n \nLook for this engine in the A45, CLA 45, and GLB 45 in the near future.\n \nMercedes-AMG finally announces the official specs for its new 2.0-liter turbocharged four-cylinder engine that goes under the internal designation M 139. In the higher-spec S trim, the mill offers 416 horsepower (310 kilowatts) and beats the previous-gen A45 with 375 hp (280 kW) to take the title as world's most powerful factory-offered four-cylinder engine ever available in a production vehicle.\n \nIf we want to split some very thin hairs, the Mitsubishi Lancer Evolution FX-440 MR made 440 hp from its 2.0-liter four-cylinder, but production amounted to just 40 units exclusively for the UK.\n \n\nSpecifically, the S version of the M 139 makes 416 hp at 6,750 rpm and 500 Newton-meters of torque between 5,000 and 5,250 rpm. The redline hits at 7,200 rpm.\n\n \n\nThere's also a standard variant of the M 139 that produces 382 hp at 6,500 rpm and 480 Newton-meters between 4,750 and 5,000 rpm. The redline is the same 7,200 rpm.\n\n \nBoth versions of the M 139 use a twin-scroll turbocharger. The S variant can produce up to 30.5 psi (2.1 bar) of boost, but the standard model goes to 27.6 psi (1.9 bar).\n \nTo get into the nitty-gritty details, The M 139 weighs 160.5 kilograms. The four cylinders each have a bore of 83 millimeters and stroke of 92 millimeters. The mill features both direct injection and indirect injection through the intake manifold. There are two overhead camshafts operating on 16 valves, and the drive train is capable of tweaking the valve operation on both sides, in addition to Camtronic valve opening adjustment for the exhaust side.\n \nThe M 139 engine will be available in a variety of models in the near future. The first of them to debut should be the new A45.\n \n\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\n\nA petrol engine making more torque than diesel equivalent?? The dream have come true...   \n \nMercedes-AMG Details Most Powerful 4-Cyl Ever, Makes 416 HP 500 Nm\n \n\n \n\n \n\n \n\n \nLook for this engine in the A45, CLA 45, and GLB 45 in the near future.\n \nMercedes-AMG finally announces the official specs for its new 2.0-liter turbocharged four-cylinder engine that goes under the internal designation M 139. In the higher-spec S trim, the mill offers 416 horsepower (310 kilowatts) and beats the previous-gen A45 with 375 hp (280 kW) to take the title as world's most powerful factory-offered four-cylinder engine ever available in a production vehicle.\n \nIf we want to split some very thin hairs, the Mitsubishi Lancer Evolution FX-440 MR made 440 hp from its 2.0-liter four-cylinder, but production amounted to just 40 units exclusively for the UK.\n \n\nSpecifically, the S version of the M 139 makes 416 hp at 6,750 rpm and 500 Newton-meters of torque between 5,000 and 5,250 rpm. The redline hits at 7,200 rpm.\n\n \n\nThere's also a standard variant of the M 139 that produces 382 hp at 6,500 rpm and 480 Newton-meters between 4,750 and 5,000 rpm. The redline is the same 7,200 rpm.\n\n \nBoth versions of the M 139 use a twin-scroll turbocharger. The S variant can produce up to 30.5 psi (2.1 bar) of boost, but the standard model goes to 27.6 psi (1.9 bar).\n \nTo get into the nitty-gritty details, The M 139 weighs 160.5 kilograms. The four cylinders each have a bore of 83 millimeters and stroke of 92 millimeters. The mill features both direct injection and indirect injection through the intake manifold. There are two overhead camshafts operating on 16 valves, and the drive train is capable of tweaking the valve operation on both sides, in addition to Camtronic valve opening adjustment for the exhaust side.\n \nThe M 139 engine will be available in a variety of models in the near future. The first of them to debut should be the new A45.\n \n\n \n\n\n \namazing. this can replace many v6 and inline 6 now.\n \nand a few more years down the road, v8 might become history\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Volvobrick",
        "comment": "\n\t\t\t\nThey should mate 2 of this to get a 4.0 V8 with 832 HP!  \n \n\namazing. this can replace many v6 and inline 6 now.\n \nand a few more years down the road, v8 might become history\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\nThey should mate 2 of this to get a 4.0 V8 with 832 HP!  \nhaha, it could be possible\n \nidea for the next hypercar......w8 + electric motor\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "mersaylee",
        "comment": "\n\t\t\tCan’t say no horse run, can I?\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nI am impressed how fast the counterbalancing shaft will be spinning \n\namazing. this can replace many v6 and inline 6 now.\n \nand a few more years down the road, v8 might become history\nV6 maybe. \nIL6 no way.  Merc moved back IL6 2 yrs ago under 53 moniker \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Angcheek",
        "comment": "\n\t\t\t\nThey should mate 2 of this to get a 4.0 V8 with 832 HP!  \n \nwaaa U wan to race with TP ?  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\ncompact, light and clean......\n \n \nWonder what is the VES when A45 hits Singapore..... \n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Wt_know",
        "comment": "\n\t\t\t\nyes, the new F40 M135i 2L turbo pump out 302bhp/450Nm can only smell the tailpipe? \n \nCan’t say no horse run, can I?\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 7 by Wt_know\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nyes, the new F40 M135i 2L turbo pump out 302bhp/450Nm can only smell the tailpipe? \n \n\n \nA35 302bhp vs F40 M135 306\n \nA45 416bhp vs ????\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\n\ncompact, light and clean......\n \n \nWonder what is the VES when A45 hits Singapore..... \n\n \n capped at 20k so that elite dont need pay so much  \n\nA35 302bhp vs F40 M135 306\n \nA45 416bhp vs ????\n\n \nF40 LCI M145 500bhp...huat ah  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n F40 LCI M145 500bhp...huat ah  \n \nBoomzzzz\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nwaaa U wan to race with TP ?  \n \nTBH...sibay powderful but wear and tear also sibay fast one...last time NA still no horse run \nBoomzzzz\n \noh yah...what happen to \"boomzzz\" \n \nlast known was stealing customer wallet right? \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "fanwater",
        "comment": "\n\t\t\tNot very impressive. The max torque come in only at very late rpm, i.e. >5,000rpm \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "STiYaKuzA",
        "comment": "\n\t\t\t\n\nTBH...sibay powderful but wear and tear also sibay fast one...last time NA still no horse run \n \n \noh yah...what happen to \"boomzzz\" \n \nlast known was stealing customer wallet right? \nYeah man can't imagine running this past 10 years; even if it runs well the power loss could be quite significant already.. \nNo replacement for displacement! Though the road tax for an NA equivalent with this kinda power would be suicide haizz\nNot very impressive. The max torque come in only at very late rpm, i.e. >5,000rpmYeah everyday driving seldom rev till 5k sia.. Characteristics look like that of NA liao\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Wt_know",
        "comment": "\n\t\t\t\nit’s built for Autobahn ... not PIE or AYE ... lol\nno 5k rpm no talk\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 7 by Wt_know\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Ahbengdriver",
        "comment": "\n\t\t\tI am quite sure they cannot solve the noise in these type of 4 cyl T engine, which sounds like a diesel or subaru engine.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Sdf4786k",
        "comment": "\n\t\t\t\nI am quite sure they cannot solve the noise in these type of 4 cyl T engine, which sounds like a diesel or subaru engine.I am sure they cannot solve the fake pipe in exos thru the speakers which sounds very thrash \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "TeamAMG69",
        "comment": "\n\t\t\t\nI am quite sure they cannot solve the noise in these type of 4 cyl T engine, which sounds like a diesel or subaru engine.\n \nloudspeaker exhaust for the win  \nhttps://www.facebook.com/maxhaustasia/videos/825259191193704/\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nHow the engine was assembled, by hand.\n \n\n \n\ncompact, light and clean......\n \n \nWonder what is the VES when A45 hits Singapore..... \n\nIf a ZERO emission Tesla S can be slapped with a $15K CEVS surcharge (instead of getting up to $30K rebate), what do you think would be the fate of this clean AMG engine? \n\n capped at 20k so that elite dont need pay so much  \n \n \nF40 LCI M145 500bhp...huat ah  \n\n2.0L vs 3.0L, NO Count  :D\n \nAnd where got M145? Don't big cannon fairy lah. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nMercedes-Benz Hints Its New Turbo Four Could Get More Than 415 HP!\n \nMercedes-AMG will launch its new 2.0-liter turbo four in a handful of AMG 45-badged models in the very near future and has suggested that it could get more powerful.\n \nThe M139, as it is code-named, has already been officially confirmed with a peak output of 416 hp and 500 Nm of torque. Power per liter sits at an impressive 208 hp, making this the most powerful mass-production four-cylinder road car engine ever.\n \nCompared to the M133 that powered the previous-gen AMG 45, the M139 has been flipped 180 degrees, with the turbocharger and exhaust manifold now facing backwards. The turbo also features roller bearings and the engine incorporates an improved exhaust manifold helping to prevent individual cylinders from negatively influencing one another during load cycles, while it runs on 0W20 oil (!) and still needs servicing every 20,000 miles or once a year, whatever comes first...\n \nProducing a turbocharged four-cylinder engine with so much power is an impressive feat, made possible by numerous upgrades that range from new oil- and water-cooling systems to forged aluminum pistons and an ultra-strong crankcase, but Affalterbach’s engineers don’t appear finished with this powertrain.\n \nDuring a recent presentation, Mercedes-AMG head of engine development Ralph Illenberger indicated to Car Sales there is more grunt on the agenda.\n \n“There will be more to come. There’s always room for improvement. But 421 PS is really quite a high number, especially when it’s also street-legal. That was the challenge. We’ll see what the future will bring,” he said.\n \nIf AMG does boost horsepower and torque figures from this engine, we could end up with some very exciting performance cars. And to think that a blue-blood supercar of the early 2000s, like, theFFerrari 360 Modena, had “only” 395 horses at its disposal (and less torque) – and, from what we recall, was ferociously fast.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nThe new engine can be found in the new AMG A45 / A45S and CLA45 / CLA45S.\n \n\n \n\n \nThe engine note is simply intoxicating... \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nHow Mercedes-AMG made the most powerful turbo four-cylinder engine in the world\n \n\n \nMercedes-AMG recently unveiled the all-new M139 2.0-liter turbocharged engine. It’s a complete redesign of the previous-gen M133 four-cylinder motor in the outgoing Mercedes-AMG A45, CLA45, and GLA45. And, with up to 415 horsepower and 369 pound-feet of torque available, the M139 earns the title of the most powerful four-cylinder engine in the world.\n \nThe old M133 is by no means lacking in power. Mercedes tuned it for 208 horsepower in the current GLA 250, and 375 horsepower in the GLA 45. Time, tide, and an appetite for horsepower waits for nobody, however, and combined with toughening emissions requirements and the desire for the smallest and lightest package, the power-hungry boffins at Mercedes-AMG went to work and burned the midnight oil to create the new M139.\n \n\n \nThe result is 382 horsepower in its standard form, which is a reasonable jump from the 375 horsepower output of the old motor. In its most potent ‘S’ form, however, the M139 churns out 415 horsepower and 369 pound-feet of torque.\n \nHowever this new motor isn’t just about a hike in power figures. The aim was to alter the torque delivery, too, with the screaming action of an F1 motor as AMG’s inspiration. If there’s one thing missing in the old M133, after all, it’s the lack of torque at higher engine speeds. The previous engine had a tendency to dump its power at low engine speeds like a diesel motor, but then flatline as the engine reaches the upper limits of the rev range. In contrast, the M139 aims for a rush of acceleration regardless of the engine speed.\n \n\n \nMercedes says the new 2.0-liter four-cylinder produces peak torque at 5,200 rpm. However, it also generates higher amounts of torque between 1,000-2,000 rpm compared to the old engine. The most vigorous push comes as early as 3,000 rpm, the automaker promises, with the M139 shaping up to provide instant shove without the need to bury the gas pedal. And, since the engine torque is better distributed, you also get a driving feel more similar to that of a naturally-aspirated, big displacement motor.\n \nAchieving all that required tossing out the old blueprints and coming up with new plans. The M139 engine is entirely new, only carrying over a handful of nuts and bolts from its predecessor. Mercedes-AMG developed a lighter – yet stronger – cylinder block, that withstands 160 bar (2,320 psi) of combustion pressure.\n \n\n \nMercedes says this new alloy block is as strong and rigid as the cylinder block in a modern diesel motor. It’s also designed to mimic the strengthening characteristics of a diesel engine block with a closed-deck design, part-closed crankcase, and strengthening skirts in the cylinder housing.\n \n\n \n\nThen there are larger valve seats and exhaust valves, a new water jacket, and segregated coolant plumbing for the cylinder head and block. The engine also benefits from electric water pumps that operate independently to the engine: they mean the motor can continue to cool down the engine block, cylinder head, and turbocharger even after turning off the engine. Additionally, Mercedes-AMG bolted on a new 16-valve cylinder head with Camtronic variable inlet and exhaust valves. This system combines two camshaft profiles to deliver enhanced throttle response and better fuel economy.\n \n\n \nArguably the most interesting aspect of the M139 is the dual fuel injectors found in each cylinder. In normal driving, the fuel is delivered by the single piezo-injector on top of the motor. At higher engine speeds or under hard acceleration, though, a second fuel injector in the inlet manifold tract kicks in. It supplies more fuel to sustain the boost delivery inside the combustion chamber.\n\n \n\n \nThere’s also a new and larger turbocharger residing between the engine and the front bulkhead. This unusual location necessitates better cooling techniques to prevent the blower from overheating under sustained high-rpm operation. This is achievable thanks to the new coolant plumbing, but most of it has something to do with the new engine cover that directs cooling air to the turbocharger. Mercedes says the 415-horsepower ‘S’ version of the M139 also utilizes cooling air from the HVAC system when needed. The turbocharger itself is a low-friction roller bearing design with an electronically-controlled wastegate.\n \nThe most powerful four-cylinder engine in the world is no mass-produced motor. Each engine is still built by hand in accordance with AMG’s tradition of the ‘one man, one engine’ method. However, Mercedes established a more streamlined approach in engine building using the latest in modern technology. Each person on the line makes use of special power tools that electronically record the torque applied to each fixture and the assembly sequence. Mercedes claims this new approach allows the AMG manufacturing facility to churn out 140 engines each day in two alternating shifts. It also reduces production time by 20- to 25-percent.\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nAMG Says Next-Gen Sports Cars Will Be Less Noisy\n \n\n \n\n \nEurope says, “Shhh!”\n \nSometime soon, whether you slip into your new Mercedes-AMG or spot one cruising past, it may sound a bit different – at least from the outside. Thanks to new European regulations, exhaust notes are getting quieter, and not even AMG’s burly performance cars, nor its competitors, can avoid them. And that involves AMG cars outside Europe, too.\n \n\nIn an interview with Motoring, Bastian Bogenschutz, Mercedes-AMG’s head of product planning for compact cars, told the publication all markets are affected by Europe’s legislative changes. It’s too expensive to design specific exhausts for each individual market. That includes the U.S., which means AMG’s other means of auditory delivery will have to suffice. The regulations are also getting more stringent about every two years, which further complicates the problem.\n \nTwo of the first vehicles these new regulations are quieting is the 2020 Mercedes-AMG A 45 S and 2020 Mercedes-AMG CLA 45 S, which also happen to pack what Mercedes calls the world’s most powerful four-cylinder engine. European regulators don’t want you to hear it. However, thanks to technology, and the dissatisfaction of some, AMG is countering the new regulations by enhancing the in-cabin exhaust note. The company added the AMG pure performance sound, which takes the real exhaust sound and moves it inside.\n \nIn-car audio systems mimicking exhaust and engine noises aren’t new, as are other creative ways to enhance the driving experience. And it’s not an ideal solution either, but it’s better than nothing. While European regulations will quiet future AMG vehicles, the robust aftermarket scene should provide plenty of solutions to rectify the quietness. Sound is a visceral part of the driving experience, and nothing beats a series of loud pops, burbles, and wails from the a stellar exhaust system. But times are changing, which means there are new regulations automakers have to follow. \n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Angcheek",
        "comment": "\n\t\t\tElectric car got not much sound ........  \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Felipe",
        "comment": "\n\t\t\t\n\namazing. this can replace many v6 and inline 6 now.\n \nand a few more years down the road, v8 might become history\nU won't get the v6 sound though\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\nU won't get the v6 sound thoughTrue. But the new a45 does sound really gd for a 2l car. The right crack and pop\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nElectric car got not much sound ........  \nBut don't know why the BlueSG electric car is very noisy \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nTrue. But the new a45 does sound really gd for a 2l car. The right crack and pop\n \n\n\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\n Actually even the a35 sounds good haha\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Contipro",
        "comment": "\n\t\t\t\nnice engine.. \nbut some bro say turbo engine useless..\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "ER-3682",
        "comment": "\n\t\t\t\n\nnice engine..\nbut some bro say turbo engine useless..\n\nTurbocharged Engine's Sound not as nice as N/A...but Turbocharged Engine produced goot low end Torque,N/A Engine are nice,but need to buy V8 or V10 to have the 'Kick''.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nTurbocharged Engine's Sound not as nice as N/A...but Turbocharged Engine produced goot low end Torque,N/A Engine are nice,but need to buy V8 or V10 to have the 'Kick''.\n \nSound depends lo\n \nN/A IL6 2.2L on high rev also sibei nice.\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited July 31 by Davidtch\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\n\nSound depends lo\n \nN/A IL6 2.2L on high rev also sibei nice.\n\n \nlast edition was E46 320 and E60 520 after LCI gone liao...sad  \n \ninline six niceeeee \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "ER-3682",
        "comment": "\n\t\t\t\n\nlast edition was E46 320 and E60 520 after LCI gone liao...sad  \n \ninline six niceeeee \n\nThat is the reason i get the M240i instead of the 230i M-Sport.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Turboflat4",
        "comment": "\n\t\t\t\nThat is the reason i get the M240i instead of the 230i M-Sport.Nice. I have the M140i. We should chat about our cars. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nlast edition was E46 320 and E60 520 after LCI gone liao...sad  \n \ninline six niceeeee \n\n \nThat's why ILsex ftw.\n \n@radx i want to change my nick tio ILsex.  Can or not?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nThat is the reason i get the M240i instead of the 230i M-Sport.\nInline 6 no horse run \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\tInline 6 no horse run \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nMy Mini sound like taxi during idling.\nsame goes for my inlinefour B48 \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Sdf4786k",
        "comment": "\n\t\t\t\n\n \nAMG Says Next-Gen Sports Cars Will Be Less Noisy\n \n \n \n \n \nEurope says, “Shhh!”\n \nSometime soon, whether you slip into your new Mercedes-AMG or spot one cruising past, it may sound a bit different – at least from the outside. Thanks to new European regulations, exhaust notes are getting quieter, and not even AMG’s burly performance cars, nor its competitors, can avoid them. And that involves AMG cars outside Europe, too.\n \n\nIn an interview with Motoring, Bastian Bogenschutz, Mercedes-AMG’s head of product planning for compact cars, told the publication all markets are affected by Europe’s legislative changes. It’s too expensive to design specific exhausts for each individual market. That includes the U.S., which means AMG’s other means of auditory delivery will have to suffice. The regulations are also getting more stringent about every two years, which further complicates the problem.\n \nTwo of the first vehicles these new regulations are quieting is the 2020 Mercedes-AMG A 45 S and 2020 Mercedes-AMG CLA 45 S, which also happen to pack what Mercedes calls the world’s most powerful four-cylinder engine. European regulators don’t want you to hear it. However, thanks to technology, and the dissatisfaction of some, AMG is countering the new regulations by enhancing the in-cabin exhaust note. The company added the AMG pure performance sound, which takes the real exhaust sound and moves it inside.\n \nIn-car audio systems mimicking exhaust and engine noises aren’t new, as are other creative ways to enhance the driving experience. And it’s not an ideal solution either, but it’s better than nothing. While European regulations will quiet future AMG vehicles, the robust aftermarket scene should provide plenty of solutions to rectify the quietness. Sound is a visceral part of the driving experience, and nothing beats a series of loud pops, burbles, and wails from the a stellar exhaust system. But times are changing, which means there are new regulations automakers have to follow. \n\n \n\n \ninterestingly, when you start up the new A45s with the +plus paddle towards u, the roar is louder.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\n\tMercedes-AMG A45’s 2.0L Turbo Four To Be Utilized By Other Performance Models As Well\n\n\n\n\t\n\n\n\tThe most powerful series production 2.0-liter, four-pot currently resides in the Mercedes-AMG’s 45 and, in top form, kicks out a very healthy 421 PS (415 HP / 310 kW) and 500 Nm (369 lb-ft) of torque, directed to the all-wheel drive via an eight-speed, dual-clutch transmission.\n\n\n\n\tThis allows the new-gen A45 S and CLA 45 S to sit at the top of the food chain in the compact segment, edging out key rivals from Audi and BMW.\n\n\n\n\tBut why did they go to such great lengths (and investments) only to limit the offering to the high-end versions of the new A-Class and CLA? Well, according to the AMG head honcho, Tobias Moers, there’s much more to it than that.\n\n\n\n\tDuring the 2019 Frankfurt Motor Show, where the two 45 S models were on deck, Moers said: “The reason [why it makes so much power] is that we’re going to use it for further applications, which are not necessarily east-west applications.” In plain English, he confirmed that it can be mounted longitudinally as well, as opposed to the transverse application in the A45 and CLA 45, thus opening the door to numerous possibilities.\n\n\n\n\tNonetheless, it probably won’t give birth to a C45 or an E45, but could replace the ICE units of the 43 and 53 models, albeit with the help of electrification. Mercedes-AMG has already announced it will to go down this road, and adding an electric motor will make the already powerful engine even crazier.\n\n\n\n\tCould it, as some suggest, eventually take over even the 4.0-liter twin-turbo V8 found in modern AMG 63s, producing around 600 horsepower? Sure, downsizing and electrification are all the rage in the industry right now, though that seems like a very long stretch, especially for high-end AMGs where, we presume, four-bangers won’t sit very well with customers right now.\n\n\n\n\t\t\t\n\t\t"
    }
]