[
    {
        "userid": "SGCMHello",
        "comment": "\n\t\t\t\nWhy Mercedes skipped GLB when they’ve GLA, GLC, GLE, GLS?\n \nGLA too small while GLC too unnecessary, GLB would be just nice for a specific market segment.\n \nOnly if there is a B Class Grand Tourer, I would have bought it.  I waited for it ever since BMW came out with their 2 series Grand Tourer.  A futile wait.\n \nMerc is missing a market segment in the absence of these 2 models.\n \nAnyone interested if such models eixst ?  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\nWhy Mercedes skipped GLB when they’ve GLA, GLC, GLE, GLS?\n \nGLA too small while GLC too unnecessary, GLB would be just nice for a specific market segment.\n \nOnly if there is a B Class Grand Tourer, I would have bought it. I waited for it ever since BMW came out with their 2 series Grand Tourer. A futile wait.\n \nMerc is missing a market segment in the absence of these 2 models.\n \nAnyone interested if such models eixst ?\n\n \nHave GLB lah... I was waiting for more details before starting a thread on it. But never mind, I will just share what is available for now.\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nThe Mercedes GLB has been spotted testing for the first time under heavy camouflage and large body mouldings to disguise its shape. It’s set to go on sale in 2019, slotting nicely in between the GLA and GLC and based on the same underpinnings as the 2018 A-Class. It is also dubbed as a Baby G Wagon, as it boxy design is meant to create more interior space than the GLA.\n \nUnderpinning the GLB will be the same MFA2 architecture as the GLA. Despite the common platform, the GLB will be slightly larger than the GLA and can be expected to adopt some exterior styling inspiration from the all-new generation A-Class.\n \nIn the cabin, our sources tell us that the GLB will be quite similar to the A-Class as well. Consequently, the new MBUX infotainment system of the small hatchback will make an appearance in the SUV. The similarities between the A-Class and GLB won’t stop here.\n \nAs a matter of fact, various A-Class engines are on the cards, including a selection of hybrid and plug-in hybrid units.\n \nThe Mercedes-Benz GLB is tipped to arrive by the end of 2019 before landing in showrooms in 2020.\n \n \nThe CGI look very interesting, BUT please bear in mind this is NOT the real thing yet...\n\n \n\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited March 14, 2018 by Carbon82\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "kdash",
        "comment": "\n\t\t\tjudging by the CGI looks, apt name to call it the Baby G Wagon...\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "ER-3682",
        "comment": "\n\t\t\tMercedes Benz now too many Model,no wonder even Spare Parts Stockists also don't want to stock their parts,last time Tye Soon,got almost everything for W123,124 & 126....\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nSo this is SUV or MPV? 7 seater available?\nLooks very boxy but will know more when the camouflage is removed so shall reserve comments for now. Anyway thanks for the scoops bro @carbon82\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited March 14, 2018 by Spring\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nGLA - small sized SUV based on A class aimed to compete with BMW X2, Audi Q2, Volvo XC40\n \nGLB - mini version of the G wagen. Previously was a small SUV but not sold in Singapore. Direct competitor of the BMW X1.\n \nGLC - small entry level SUV based on C class aimed to compete with BMW X3, Audi Q3, Volvo XC60. I personally find the GLC the right sized for first time Mercedes Benz buyers who wants an SUV.\n \nGLE - mid entry level SUV based on E class aimed to compete with BMW X5, Audi Q5, Volvo XC90. Initially released as the M class.\n \nGLS - big luxury SUV segment based on the S class aimed to compete with Audi Q7 and upcoming BMW X7.\n \nG wagen - big SUV, true off roader. \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited March 14, 2018 by DACH\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\nGLA - small sized SUV based on A class aimed to compete with BMW X2, Audi Q2, Volvo XC40\n \nGLB - mini version of the G wagen. Previously was a small SUV but not sold in Singapore. Direct competitor of the BMW X1.\n \nGLC - small entry level SUV based on C class aimed to compete with BMW X3, Audi Q3, Volvo XC60. I personally find the GLC the right sized for first time Mercedes Benz buyers who wants an SUV.\n \nGLE - mid entry level SUV based on E class aimed to compete with BMW X5, Audi Q5, Volvo XC90. Initially released as the M class.\n \nGLS - big luxury SUV segment based on the S class aimed to compete with Audi Q7 and upcoming BMW X7.\n \nG wagen - big SUV, true off roader. \n\n \nNo quite right. In term of dimensions and ride height in Premium SUV category (leaving performance out of the comparison), it should be more like this:\n \nGLA (Low ride height crossover) = Audi Q2 / BMW X2 / Infiniti Q30 / Lexus UX\n \nGLB (compact upright SUV) = Audi Q3 / BMW X1 / Jaguar E-Pace / Range Rover Evoque / Volvo XC40\n \nGLC (Medium size SUV) = Audi Q5 / BMW X3 / Jaguar F-Pace / Land Rover Discovery Sport / Lexus NX / Porsche Macan / Volvo XC60\n \nGLE (Full size SUV) = BMW X5 / Infiniti QX70 / Lexus RX / Maserati Levante / Porsche Cayenne / Range Rover Sport / Volvo XC90\n \nGLS (Large size SUV ~5m or longer) = Audi Q7 / Bentley Bentayga / BMW X7 / Infiniti QX80 / Land Rover Discovery / Range Rover\n \n \n\nSo this is SUV or MPV? 7 seater available?\nLooks very boxy but will know more when the camouflage is removed so shall reserve comments for now. Anyway thanks for the scoops bro @carbon82\n\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited March 15, 2018 by Carbon82\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\n\nNo quite right. In term of dimensions and ride height in Premium SUV category (leaving performance out of the comparison), it should be more like this:\n \nGLA (Low ride height crossover) = Audi Q2 / BMW X2 / Infiniti Q30 / Lexus UX\n \nGLB (compact upright SUV) = Audi Q3 / BMW X1 / Jaguar E-Pace / Range Rover Evoque / Volvo XC40\n \nGLC (Medium size SUV) = Audi Q5 / BMW X3 / Jaguar F-Pace / Land Rover Discovery Sport / Lexus NX / Porsche Macan / Volvo XC60\n \nGLE (Full size SUV) = BMW X5 / Infiniti QX70 / Lexus RX / Maserati Levante / Porsche Cayenne / Range Rover Sport / Volvo XC90\n \nGLS (Large size SUV ~5m or longer) = Audi Q7 / Bentley Bentayga / BMW X7 / Infiniti QX80 / Land Rover Discovery / Range Rover\n \n \n \nGLB as the name imply, is more of an SUV than MPV. But rumors in the market is that Mercedes Benz is also considering a LWB GLB with 7 seat, to compete with BMW 2GT, which I reckon is a brilliant move, capturing both SUV and compact 7 seater market with 1 product.\n \nI will update this thread when more info surfaced. Stay tuned... \nThe naming convention is quite confusing after the change. The GLK, as mentioned in my post under GLB as previously sold, was actually a GLC predecessor. So the GLB is actually a new model. Even BMW X1 bigger than X2 is pretty weird. \nI believe Mercedes-Benz understands the popularity of SUV over MPV as a premium brand and thus more orientated to SUVs.\nB class is the only MPV model it has and the V class is a van derived mini bus? R class was killed off.\n \nEven BMW has only the 2 series MPV while Audi has none in its line up.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n7 seater Mercedes is coming after all, from the horses mouth... \n \nMercedes Sales Boss Announces A Seven-Seat Compact Model\n \nMercedes recently introduced the all-new A-Class and we’re starting to learn more about the other compact models that will follow in the next few years.\n \nWe’ve already seen several of the upcoming vehicles – including the A-Class sedan, GLB and CLA – and Mercedes will continue to offer the B-Class despite the fact that sales have fallen by nearly 50% since 2012. While is seems odd that company would continue to produce the slow selling model, Mercedes sales and marketing boss Britta Seeger told Automotive News Europe the B-Class is in a “significant and promising segment so we will replace it.”\n \nSeeger went on to say the company will offer a compact model with seven seats. While she wouldn’t reveal whether the seven-seat model would be a crossover or an MPV to battle the BMW 2-Series Gran Tourer, many are expecting a seven-seat version of the GLB. This makes sense as crossovers are significantly more popular than MPVs and they sell well in a variety of markets.\n \nWhatever form the seven-seat model takes, it will be one of nine compact models from Mercedes-Benz. The company hasn’t revealed all of the upcoming vehicles but the list will include the A-Class sedan and hatchback, the redesigned CLA and a new GLA. There will also be the B-Class and the all-new GLB.\n \nBesides talking about the upcoming family of compact vehicles, Seeger confirmed the next-generation S-Class will become the company’s first model to offer a Level 3 semi-autonomous driving system. She also said the company is “very satisfied” with its diesel engines and their sales.\n \nWhile diesel vehicles will remain in the company’s lineup, Seeger said approximately 15-25% of the company’s products will be electrified by 2025. The exact product mix remains to be seen as Seeger said “Time and consumers will tell us which percentage will be full-electric, plug-in hybrid, 48-volt hybrid, gasoline and diesel.”\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\tReminds me of the Daihatsu Terios 7 seater if the GLB crossover is a 7 seater.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Adrianli",
        "comment": "\n\t\t\t\n\nThe naming convention is quite confusing after the change. \nThe GLK, as mentioned in my post under GLB as previously sold, was actually a GLC predecessor. So the GLB is actually a new model. Even BMW X1 bigger than X2 is pretty weird. \nI believe Mercedes-Benz understands the popularity of SUV over MPV as a premium brand and thus more orientated to SUVs.\nB class is the only MPV model it has and the V class is a van derived mini bus? R class was killed off.\n \nEven BMW has only the 2 series MPV while Audi has none in its line up.\n\nAudi got Q7, its a 7 seater.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Zze121",
        "comment": "\n\t\t\t\n\nThe CGI look very interesting, BUT please bear in mind this is NOT the real thing yet...\n\n \n\nThis car looks damn awesome.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SGCMHello",
        "comment": "\n\t\t\t\n\n7 seater Mercedes is coming after all, from the horses mouth... \n \nMercedes Sales Boss Announces A Seven-Seat Compact Model\n \nMercedes recently introduced the all-new A-Class and weâre starting to learn more about the other compact models that will follow in the next few years.\n \nWeâve already seen several of the upcoming vehicles â including the A-Class sedan, GLB and CLA â and Mercedes will continue to offer the B-Class despite the fact that sales have fallen by nearly 50% since 2012. While is seems odd that company would continue to produce the slow selling model, Mercedes sales and marketing boss Britta Seeger told Automotive News Europe the B-Class is in a âsignificant and promising segment so we will replace it.â\n \nSeeger went on to say the company will offer a compact model with seven seats. While she wouldnât reveal whether the seven-seat model would be a crossover or an MPV to battle the BMW 2-Series Gran Tourer, many are expecting a seven-seat version of the GLB. This makes sense as crossovers are significantly more popular than MPVs and they sell well in a variety of markets.\n \nWhatever form the seven-seat model takes, it will be one of nine compact models from Mercedes-Benz. The company hasnât revealed all of the upcoming vehicles but the list will include the A-Class sedan and hatchback, the redesigned CLA and a new GLA. There will also be the B-Class and the all-new GLB.\n \nBesides talking about the upcoming family of compact vehicles, Seeger confirmed the next-generation S-Class will become the companyâs first model to offer a Level 3 semi-autonomous driving system. She also said the company is âvery satisfiedâ with its diesel engines and their sales.\n \nWhile diesel vehicles will remain in the companyâs lineup, Seeger said approximately 15-25% of the companyâs products will be electrified by 2025. The exact product mix remains to be seen as Seeger said âTime and consumers will tell us which percentage will be full-electric, plug-in hybrid, 48-volt hybrid, gasoline and diesel.â\nWow, Carbon, you very up to date with Mercedes.  Thanks for sharing. \nCarbon, you know the carbon VES surcharge for GLB?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Ahbengdriver",
        "comment": "\n\t\t\t\nMerc is gonna be a very rich company, bcos they are beginning to make every shitty model they can think of, just to fill every corner of the market.  BMW is coming close too.  These germans were once head turners.  Now aunties, uncles and even our club bengs all own 1 of them.  Go to any public large carparks, and count how many Jap cars, common ones and popular ones, and count how many merc n BMWs on the same floor.  Dont be surprised with the results.\n \nHow times have changed.  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\nWow, Carbon, you very up to date with Mercedes. Thanks for sharing.\n \nCarbon, you know the carbon VES surcharge for GLB?\n\n \nEverything can be found online, I just search and share.\n \nI am not working for or have any relationship with MB, so I would not be able to tell you about the VES surcharge. But going by EU6 requirement, I can safely said that the newer mild hybrid setup for entry level MB should land the car in at least the Neutral band, when it is launched sometime towrads end of the year. The rest shall depand on how much is LTA shifting it goal pole (VES criteria)... ...   \nThis car looks damn awesome.\n \nVery unlikely the GLB would ended up like this. I personally expect it to look more like a baby G class, with little rounded corner, so as to creat max. interior space (especially in view that it might be a 7 seater).\nReminds me of the Daihatsu Terios 7 seater if the GLB crossover is a 7 seater.\n \nBut the price of GLB will be easily double that of Terios 7... \n\nMerc is gonna be a very rich company, bcos they are beginning to make every shitty model they can think of, just to fill every corner of the market.  BMW is coming close too.  These germans were once head turners.  Now aunties, uncles and even our club bengs all own 1 of them.  Go to any public large carparks, and count how many Jap cars, common ones and popular ones, and count how many merc n BMWs on the same floor.  Dont be surprised with the results.\n \nHow times have changed.  \n\n \nWell, as the saying goes: Money is never enough. And the same for every company and it shareholder. The more product they can sell, the better. The more frustrating part is with the 1 product different size strategy, e.g. C Class is small, E Class is medium, S Class is large, and very soon will have A Class sedan to be XS of S...\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nNew Mercedes-Benz GLB Looks More Mini-GLS Than G-Wagen In Best Photos Yet\n \nAfter seeing nothing but camo-heavy prototypes, we finally caught a break thanks to this completely undisguised crash test model, and can unequivocally state that Mercedes‘ upcoming GLB crossover will not look anything like the G-Class.\n \nIn fact, if we go by its overall form factor as well as its roof and pillar design, it would seem the GLB looks more like a mini-GLS, which is disappointing only if you were expecting something either more utilitarian like the G-Wagen, or something more sporty.\n \nUnderneath its exterior lies the automaker’s MFA2 architecture, shared by the GLA, smaller compared to the GLB, which by the way, could spawn a 7-seater version – visually, there seems to be room for an extra row of seats on this very prototype.\n \n\n \n\n \n\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\tActually looks abit like the BMW Gran Tourer from the side. The Munich giant was having things all their way in this segment so glad to see Benz coming in to challenge them. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nI will post the new 2019 B-Class spy shots here for now (since the original title of this thread mentioned B-Class specifically), till more details are out. \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited April 12, 2018 by Carbon82\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\tInterior cues from the new A class.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "mercymercy",
        "comment": "\n\t\t\tMay I suggest the moderator move this thread to car brand under Conti talk? Thanks. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nTopic moved under Conti Talk section for ease of reference and discussion. Thanks to @mercymercy for highlighting the concerns.\n \nLatest spy video of the upcoming GLB. Look good so far, and this shall be a highly anticipated model before turn of the year.  \n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nMore spy shots of the upcoming the GLB... Size and proportion look good based on these shots. If it come with 7 seats as with the ongoing rumor, BMW 2GT will be threaten, imo...\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heartlander",
        "comment": "\n\t\t\tSure look like got 3 rows of seats. Lots of space behind the 2nd row window.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\tKind of squarish look but need to see when the camouflage is removed but definitely a threat to the BMW 2GT n if the 3rd row is spacious plus added rear aircon, it shld give the Beemer a good fight. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nInterior look just like the new generation A-Class. Keep up the good work Mercedes!  \n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mockngbrd",
        "comment": "\n\t\t\t\n\nMerc is gonna be a very rich company, bcos they are beginning to make every shitty model they can think of, just to fill every corner of the market.  BMW is coming close too.  These germans were once head turners.  Now aunties, uncles and even our club bengs all own 1 of them.  Go to any public large carparks, and count how many Jap cars, common ones and popular ones, and count how many merc n BMWs on the same floor.  Dont be surprised with the results.\n \nHow times have changed.\nWithout money, how to make and sell cars like the amg, m cars and all the gt3rs gt2rs 911s?  \nEven Toyota can't afford to develop their own sports cars entirely. Without \"brand diluting\" cars like the 2 series gt, the X1, x2... And entry level cars that ppl like to say are for \"badge whores\", there will not be anymore z4s, M2 competitions, M5 competitions and stuff like the big 8 series coupes. Even the 5s and 3s will not be as well developed if they did not have money from selling more cars. \n \nThere is one car company that has stuck to their roots for the longest time. Lotus. \nThey must be doing really really well.\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited November 4, 2018 by Mockngbrd\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nWithout money, how to make and sell cars like the amg, m cars and all the gt3rs gt2rs 911s? \n \nEven Toyota can't afford to develop their own sports cars entirely. Without \"brand diluting\" cars like the 2 series gt, the X1, x2... And entry level cars that ppl like to say are for \"badge whores\", there will not be anymore z4s, M2 competitions, M5 competitions and stuff like the big 8 series coupes. Even the 5s and 3s will not be as well developed if they did not have money from selling more cars. \n \nThere is one car company that has stuck to their roots for the longest time. Lotus. \nThey must be doing really really well.\nNot forgetting FERRARI \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nThe GLB Concept will be unveiled at the upcoming Shanghai Motor Show, starting 16 April\n \n\n\n\n \nBut the latest spy shots shows even more...\n \n\n \n\n \n\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Fitmugen",
        "comment": "\n\t\t\t\nKind of squarish look but need to see when the camouflage is removed but definitely a threat to the BMW 2GT n if the 3rd row is spacious plus added rear aircon, it shld give the Beemer a good fight.Not difficult to look nicer than BMW 2GT. The car really looks dated now.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nAlready have road test models still considered CONCEPT? Mercedes trying to pull a fast one huh \n \n \n\nThe GLB Concept will be unveiled at the upcoming Shanghai Motor Show, starting 16 April\n \n\n\n\n \nBut the latest spy shots shows even more...\n \n\n \n\n \n\n \n\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nAlready have road test models still considered CONCEPT? Mercedes trying to pull a fast one huh \nI also wonder what's the need for a concept since production model is expected to be unveiled within the next few months.\n \nBut that seems to be the new trend (with Audi and Skoda doing the same), as manufacturers are trying to grab as much market attention, without showing hand (revealing details to their competitors). \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nI also wonder what's the need for a concept since production model is expected to be unveiled within the next few months.\n \nBut that seems to be the new trend (with Audi and Skoda doing the same), as manufacturers are trying to grab as much market attention, without showing hand (revealing details to their competitors).\n\nI do agree with u n bro Vratenza on why the need for a concept when its a done deal already but that said theoretically not wrong as this is a first ever mid sized MPV for Benz so it is a concept in that sense?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "BanCoe",
        "comment": "\n\t\t\t\nI do agree with u n bro Vratenza on why the need for a concept when its a done deal already but that said theoretically not wrong as this is a first ever mid sized MPV for Benz so it is a concept in that sense?They like people to peek-a-boo\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nMercedes-Benz Concept GLB\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nWith the Concept GLB at the 2019 Auto Shanghai, Mercedes-Benz shows what SUV ideas on the company's compact car platform might also be realised alongside the GLA as a sporty all-rounder. While the latter promises progressive driving enjoyment with its coupé-like lines, the Concept GLB places the emphasis on spaciousness and robustness. The concept car (length/width/height: 4634/1890/1900 millimetres) has space for up to seven occupants thanks to its long wheelbase (2829 millimetres). A number of sturdy features signal that the Concept GLB feels right at home on rough farm tracks.\n \n\"We asked ourselves whether there is still space between the GLA and GLC in our successful SUV range. The Concept GLB is the answer to this question. With it we are demonstrating the creative ideas we have for this segment, too\", says Britta Seeger, Member of the Board of Management of Daimler AG, responsible for Mercedes-Benz Cars Sales. \"The Concept GLB is a durable and practical SUV with nonetheless compact dimensions. Whether it is a generous, seven-seater family vehicle or a versatile leisure time companion: we are certain that this concept will be of great interest to our customers.\" Customers highly appreciate the varied SUV portfolio of Mercedes-Benz. To date, more than six million customers worldwide have purchased a Mercedes-Benz SUV. In 2018, with more than 820,000 units sold, the SUVs were the strongest segment for Mercedes-Benz.\n \n\nSUV genes skilfully brought to the fore: Exterior design\n \nThe Mercedes-Benz Concept GLB has a distinctive presence in the world of compact SUVs with its muscular proportions. The clear, surface-accentuated contours with reduced lines and precise joints convey effortless superiority and modernity. The upright front section with its striking MULTIBEAM LED headlamps is clear evidence of off-road genes, as are the short overhangs at the front and rear. The long wheelbase and the functional greenhouse are the decisive factors providing generous spaciousness for up to seven occupants.\n \nThe muscular and sensuously contoured vehicle shoulder dominates the side view, an effect reinforced by the rising waistline. The contiguous doors improve ease of access and keep the door apertures free of soiling. All-round protective claddings divide the overall proportions and emphasise the vehicle's off-road character.\n \nThe harmonious colour concept has exterior paintwork in designo cashmere white magno with high-gloss black mounted parts (e.g. the claddings or integrated roof box) as a contrast, plus discreet orange highlights in the radiator grille and as lettering on the outside mirror housings.\n \nThe chrome underguard at the front with integral air inlets in a stainless steel look emphasises the off-road qualities. The rear underguard echoes this theme, creating a balanced overall picture.\n \nExtra show car elements: equipped for expeditions\n \nWith a series of distinctive extra elements the concept vehicle exhibits a particularly robust character. At the front and rear, two shrouds emerge from the roof frame and accommodate LED spotlights acting as ambient lighting and orientation aids when driving off-road.\n \nThe black roof rails end in a curve at the front and rear. A roof box is mounted on the rear area. The rough-treaded off-road tyres are on robust 17-inch wheels in a bicolour design.\n \nHigh-quality finish and very spacious: the interior\n \nIn design terms the interior of the Concept GLB reveals its membership of the new Mercedes-Benz compact car family, but as a showcar and SUV it has a special leather features and special trim elements. And for the first time in a compact model by Mercedes-Benz, a third seat row with two additional single seats that can be recessed flush into the load compartment floor to increase load capacity. These seats are far more than emergency seats, and offer comfortable seating for two medium-sized occupants.\n \nMake space: flexible seat arrangement in the second and third row\n \nThe backrest of the middle seat row is 40:20:40 split-folding, and can be folded down to create a level load surface. The seat surfaces have a 40:60 division. The second seat row is fore-and-aft adjustable by 140 mm - by 90 mm to the front to increase luggage space or legroom for occupants right in the rear, and by 50 mm to the rear if particularly generous legroom is required in a five-seat configuration. Eight-stage seat backrest inclination adjustment in the second seat row also facilitates adaptation according to the current space or comfort requirements.\n \nTo facilitate access to the third seat row, the seats in the second row have an Easy-Entry function: when the unlocking lever on the top outer edge of the backrest is operated, the backrest folds forward and the entire seat can be pushed forward. A total of four child seats can be attached in the second and third seat rows.\n \nContrast in chestnut: exclusive leather and open-pored walnut\n \nThe seats, fittings and door panels are partially lined in nappa and nubuk leather, the predominant colour tone being \"chestnut brown\". Echoing the exterior highlights, there are orange trim strips and seams in just a few places. The centre sections of the front seats have two parallel rows of perforations in their woven nubuk leather covers, revealing the orange-coloured fabric sub-layer. These extend from the front edge of the seat cushion to the upper edge of the integrated head restraint.\n \nThe wood trim elements on the dashboard and centre console are of open-pored walnut. The walnut panels have a chiselled honeycomb pattern that fades out towards the edges. The pedals in the footwell feature decorative inserts in the same material within a high-gloss metal surround, with an identical honeycomb pattern.\n \nDashboard: MBUX and off-road elements\n \nThe basic architecture of the dashboard corresponds to that of the B-Class, with a widescreen cockpit facing the driver and the functions and displays controlled via the Mercedes-Benz User Experience - MBUX. New features are the off-road-type tubular elements in milled aluminium which round off the dashboard at the lower end. These give the dashboard support an impression of robustness, power and a certain fun factor. Below the three round centre nozzles is the air conditioning control panel with an intentionally analogue look, whose buttons create the impression that they have been milled from a solid aluminium cylinder.\n \nThe robust character of the interior continues in the centre console. Aluminium tubular elements with a brushed structure in a grab-handle look lend solidity to the design of the components and controls. Along the doors, the SUV character is underlined by the horizontal grab handle that forms a robust part of the door panel structure as a machined aluminium tube.\n \nPowertrain: Four-cylinder turbo with 165 kW/224 hp\n \nThe Concept GLB is powered by the M 260 four-cylinder petrol engine combined with an 8G-DCT dual clutch transmission, with a maximum output of 165 kW/224 hp and peak torque of 350 Nm. The engine block of diecast aluminium with cast iron cylinder liners has CONICSHAPE® technology, which is also known in-house as \"trumpet-honing\". To further minimise piston friction and lower fuel consumption, the cylinder bore is widened at the lower end of the cylinder liners. The resulting, conical shape resembles the mouth of a trumpet.\n \nAn innovative low-friction oil and optimised piston rings also reduce friction losses. To take account of the higher specific output, the pistons themselves feature cooling ducts. This also ensures more efficient combustion. The balance shafts for smooth engine-running are located in the lower section of the crankcase. To enhance comfort even further, there is a centrifugal pendulum damper in the powertrain.\n \nAlso in the aluminium four-valve cylinder head is CAMTRONIC, a variable valve timing system that allows two-stage adjustment of the valve lift on the intake side of the valve assembly. In the partial-load range, this variable valve lift adjustment allows less air to be fed to the combustion chamber with a smaller valve lift, which leads to lower gas cycle losses. In higher load ranges the system switches to the higher valve lift to achieve the engine's full power delivery.\n \nAll-wheel drive as a matter of course: 4MATIC with three selectable characteristics maps\n \nThe Concept GLB is equipped with the permanent all-wheel system 4MATIC, with fully-variable torque distribution. This sporty all-wheel drive configuration allows the driver to use the DYNAMIC SELECT switch to influence the characteristics of 4MATIC. Three characteristic maps are available to control the all-wheel drive clutch, though the system responds flexibly to the current driving situation in any mode. In regular driving operation, the drive programme \"Eco/Comfort\" is based on an 80:20 distribution (front axle:rear axle), while in \"Sport\" it is 70:30. In off-road mode the all-wheel drive clutch acts as an inter-axle differential lock, with the basic distribution a balanced 50:50.\n \n4MATIC components include the power take-off to the rear axle, which is integrated into the automated dual clutch transmission, and the rear axle differential with an integrated multiplate clutch. This is electro-mechanically operated. Via a crown wheel and a ball ramp, an electric motor exerts an axial force on the clutch pack to open or close the plates. The rear axle differential compensates the different paths/rotational speeds of the rear wheels. The advantages of this control system are above all non-rpm-dependent operation across the entire actuation range, pilot control of the clutch while still stationary and higher efficiency thanks to the ball ramp concept.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "mel1888",
        "comment": "\n\t\t\tpics looks really nice. Now wait n see if actual looks as good as pics.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nActually looking at the spec of GLB, it seems to be a 7 seater version of the GLC Class, particularly in the dimensions aspect.\n \nGLB - 4,634mm (L) x 1,890mm (W) x 1,900mm (H)\n\n \nGLC - 4,656mm (L) x 1,890mm (W) x 1,639mm (H)\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nSo it’s shorter than GLC but taller. Same width though. \n \nEarlier pics looked like it was even bigger than GLC. I supposed the taller stance made it look deceivingly bigger than it actually is. Makes sense that it slots between GLA n GLC and also it being a mid sized SUV MPV. Those needing a full sized one will probably go for GLS. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nI can see how they squeeze in the 3rd row.\n \nBy increasing the vertical height, and a more angular upright rear roofline of the current GLC boot space, they can fit in 2 foldable seats but that will mean zero rear luggage space with all seats up.\n \nThe GLB actually looks more rugged than GLC/GLA/GLE with it's wide flared fenders front and rear. Of course this is still concept, production will see the exterior tone down a notch or 2.\n \n \n\nActually looking at the spec of GLB, it seems to be a 7 seater version of the GLC Class, particularly in the dimensions aspect.\n \nGLB - 4,634mm (L) x 1,890mm (W) x 1,900mm (H)\n\n \nGLC - 4,656mm (L) x 1,890mm (W) x 1,639mm (H)\n\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Throttle2",
        "comment": "\n\t\t\t\nLooks like a new class.\nDefinitely not a B styled vehicle.\nSeems to be presented more as an off roader type.\nVery jeepish, height inclusive.\n \nConcept exterior looks fat and unrefined but brings out the jeep look\nGrill super ugly\nFront end ugly\nRear ok\nTotal package ok but looks somewhat off balanced\nInterior pretty cool but it wont happen that way.\n \nOverall Nah for me....\nWont buy.\n \nCompare the GLC and GLB pics above is like Beauty and the Beast. \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited April 23 by Throttle2\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Megatop",
        "comment": "\n\t\t\t\nGLB concept launched at Shanghai Auto Show \n \nhttps://www.youtube.com/watch?v=bKGhTgLMODE\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\tNice glb concept. Following very closely \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nOfficially unveiled. \n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heartlander",
        "comment": "\n\t\t\tReally glad that the bra has been removed from actual production units.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mockngbrd",
        "comment": "\n\t\t\tLooks nice and chunky. It's a Mercedes forester \n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 11 by Mockngbrd\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nGLB AMG45 confirm rocks...very nice design \n \n骂死你，干得好\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Ct3833",
        "comment": "\n\t\t\t\n\nGLB AMG45 confirm rocks...very nice design \n \néªæ­»ä½ ï¼å¹²å¾å¥½ððð\nI like it but cannot afford.\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 11 by Ct3833\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mkl22",
        "comment": "\n\t\t\tLooks better than the GLC. More squarish. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nI like it but cannot afford.\nSG price is ridiculous\n \nme peasant too\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Freeder",
        "comment": "\n\t\t\tExpensive Badge for this SUV..\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Ct3833",
        "comment": "\n\t\t\t\n\nSG price is ridiculous\n \nme peasant too\n\nagree, unless one has a lot of money to splurge , otherwise,  like me, I will wait for COE car 10 years later .\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mockngbrd",
        "comment": "\n\t\t\t\nPrice out liao meh?\n \n\nThis will slot in between GLA and GLC. Confirm sell alot.\n \n\nMust be M-B realized their GLA is too small to compete in the segment liao. GLB 7-seater packaging is really good. \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 12 by Mockngbrd\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Atachi",
        "comment": "\n\t\t\t\n\nPrice out liao meh?\n \nThis will slot in between GLA and GLC. Confirm sell alot.\n \nMust be M-B realized their GLA is too small to compete in the segment liao. GLB 7-seater packaging is really good.\n\n \nIf it is really going to be priced between GLA and GLC, i am seriously tempted. Gonna make a good family car.\nI'm worried for my pocket.   \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 12 by Atachi\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\n\nPrice out liao meh?\n \nThis will slot in between GLA and GLC. Confirm sell alot.\n \nMust be M-B realized their GLA is too small to compete in the segment liao. GLB 7-seater packaging is really good.\n\nthe size is very close to glc, 1 inch shorter in length, 2 inch taller and can have 7 seater version.\n \nwill steal glc sale?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Lala81",
        "comment": "\n\t\t\t\nLooks nice and chunky. It's a Mercedes forester\n \nI find it a bit too chunky leh. Bah bah but not in a good way  \nI prefer the GLC look.\n \nhttps://www.youtube.com/watch?v=J_-5GGe4EW4\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 12 by Lala81\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Testdrive2011",
        "comment": "\n\t\t\tthis looks better than the BMW 2 series gran tourer thats for sure\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nthis looks better than the BMW 2 series gran tourer thats for sure\nWhether it looks better than the 216GT is subjective but unless it’s priced near $160k which I doubt, the BMW will still sell more. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nWhether it looks better than the 216GT is subjective but unless it’s priced near $160k which I doubt, the BMW will still sell more.\n \nthats true...this GLB approx 220 to 250 at cycle one  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heartlander",
        "comment": "\n\t\t\t\nAt current rate of C&C's GLA200 at $180k and GLC200 at $220k, most likely it will sell GLB200 at about $200k.\n \nSeriously it will be one car I am willing to splurge if I do not want to squirrel too much into my retirement funds. Almost a perfect package, except for price.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Testdrive2011",
        "comment": "\n\t\t\t\nWhether it looks better than the 216GT is subjective but unless it’s priced near $160k which I doubt, the BMW will still sell more.\n \nTrue, its hard to compete on pricing when the 216GT is a Cat A car.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\tGroup buy anyone?\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Testdrive2011",
        "comment": "\n\t\t\t\nGroup buy anyone?\n \ndoes that actually work with the AD here?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mockngbrd",
        "comment": "\n\t\t\tNo.. Unless u got like 5 or 10 mayb? \n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 13 by Mockngbrd\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nThey keep showing the amg line versions..... Wonder what the standard version looks like as that will form the bulk of the sales. \n \nC&C will want 10k more just for the amg line..... Another 8k for 12 \" double screen, 6k for sunroof, 6k for 3rd row seats.... \n \nTBH, IMHO, the design is a little trying too hard..... It wants to look more \"boxy\" and \"rugged\"  compared to GLA/GLC but yet falls short... So now it looks like a morph that is arrested halfway. \n \n \n \n \nOfficially unveiled.\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mkl22",
        "comment": "\n\t\t\tRegardless. I think this will be their best seller worldwide. Read in some brief that this was designed for China. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nRegardless. I think this will be their best seller worldwide. Read in some brief that this was designed for China.\nTo be a volume seller, price level is important so unless this GLB is priced to sell, it wont be their best seller in my opinion \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\ndoes that actually work with the AD here?\n \nPI. we have 3 committed orders here already. I can add to group chat. pls pm\n\nThey keep showing the amg line versions..... Wonder what the standard version looks like as that will form the bulk of the sales. \n \nC&C will want 10k more just for the amg line..... Another 8k for 12 \" double screen, 6k for sunroof, 6k for 3rd row seats.... \n \nTBH, IMHO, the design is a little trying too hard..... It wants to look more \"boxy\" and \"rugged\"  compared to GLA/GLC but yet falls short... So now it looks like a morph that is arrested halfway. \n\n \nsome will not buy its appeal. I love the boxy and rugged looks! I just find it not tall enough.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nPI. we have 3 committed orders here already. I can add to group chat. pls pm\n \n \nsome will not buy its appeal. I love the boxy and rugged looks! I just find it not tall enough.\n\nIf too tall, CG will be even worse. \nMost cars of this type is about 1.9m tall at most n anyway any taller n our MS car parks will not be able to enter. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nIf too tall, CG will be even worse.\nMost cars of this type is about 1.9m tall at most n anyway any taller n our MS car parks will not be able to enter.\n\n \nIm obsessed with height. so i have been comparing heights of different rides. with lift kit, i think GLB's height can be > 1.7m \n \nSahara wrangler: 1891\nVellfire: 1880\nFortuner: 1835\nXC40: 1652\nXC60, GLB: 1658\nGLC: 1587\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "L23",
        "comment": "\n\t\t\t\n\nPI. we have 3 committed orders here already. I can add to group chat. pls pm\n\n \nsome will not buy its appeal. I love the boxy and rugged looks! I just find it not tall enough.\n\n \nHow much PI will be selling?\nAny specification to take a look?\nWhen will it reaches sg?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\nThey keep showing the amg line versions..... Wonder what the standard version looks like as that will form the bulk of the sales. \n \nC&C will want 10k more just for the amg line..... Another 8k for 12 \" double screen, 6k for sunroof, 6k for 3rd row seats.... \n \nTBH, IMHO, the design is a little trying too hard..... It wants to look more \"boxy\" and \"rugged\"  compared to GLA/GLC but yet falls short... So now it looks like a morph that is arrested halfway. \n\n \nHere's how the standard version look like, as well as details of the latest SUV from Mercedes-Benz. \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nPowerful proportions with short overhangs and off-road-oriented design as well as optional 4MATIC all-wheel drive and a special off-road light which helps detect obstacles immediately in front of the vehicle at low speeds - the new Mercedes-Benz GLB is a versatile SUV. And a spacious family car: on request it is the first Mercedes-Benz in this segment available as a seven-seater. The two seats in row three can be used by people up to 1.68 metres in height. With powerful and efficient four-cylinder engines, current driving assistance systems with cooperative support for the driver, the intuitively operable infotainment system MBUX plus the comprehensive convenience control ENERGIZING Comfort, the new family member (length/width/height: 4634/1834/1658 millimetres) has all the strengths of the current compact-class generation from Mercedes-Benz.\n \nAt 2829 millimetres the GLB has ten centimetres more wheelbase than, for example, the new B-Class. Together with the function-oriented greenhouse this is decisive when it comes to the generous amount of space. The headroom in the first seat row is 1035 millimetres - a best in this segment. At 967 millimetres the effective legroom in the rear of the five-seater is at an especially comfortable level.\n \nThe load compartment capacity of 560 to 1755 litres (figures for the five-seater) boasts the qualities of an estate. On request the second seat row can be longitudinally adjusted and as standard the inclination of the backrests is adjustable in several stages. This enables the load compartment to be enlarged by up to 179 litres and put to versatile use.\n \n\nSuccess story: the eighth model in the compact car family\n \nThe new GLB is manufactured at the Aguascalientes (Mexico) plant and, for the Chinese market, in Beijing. The GLB will be coming to the German sales partners at the end of this year.\n \nOne in three Mercedes-Benz cars is now an SUV, and one in four a compact model. A compact SUV like the GLB therefore combines all the success factors of the company's highest-volume segments.\n \nWith the new GLB the compact car family from Mercedes-Benz now consists of eight models: the A-Class, A-Class Saloon and long-wheelbase A-Class Saloon, B-Class, CLA Coupé, CLA Shooting Brake and the GLA are already on the market. In 2018 over 609,000 customers all over the world were able to take delivery of a compact model. Since the A-Class was launched in 1997, over 6.5 million vehicles from this segment have been sold worldwide by Mercedes-Benz.\n \nReady for boarding: up to seven seats\n \nThe GLB is the first compact vehicle from Mercedes-Benz to offer a third seat row on request with two additional individual seats. The seats offer people up to a height of 1.68 metres a comfortable amount of space. The extensive safety equipment includes retractable head restraints, seat belts with belt tensioners, a side window airbag which also protects the passengers in the third seat row plus ISOFIX and TOP-Tether anchorages for suitable child seats. These can be used to attach up to four child seats in the rear.\n \nComfort details in the third row include two drinks holders between the seats as well as two stowage compartments with a rubberised insert on the left and right in the load compartment trim, each with a USB port. The seats can be lowered so that they are flush with the load compartment floor in order to extend the load compartment.\n \nOff-road orientation: the exterior design\n \nThe powerful proportions of the Mercedes-Benz GLB underscore the design with its off-road orientation: the surfaces of the forms are emphasised, and reduced lines and precise seams are major features. The upright front section with its striking headlamps is clear evidence of off-road genes, as are the short overhangs at the front and rear.\n \nThe muscular and sensuously contoured vehicle shoulder dominates the side view at the height of the C-pillar, an effect reinforced by the rising waistline. The doors reach over the side bar, improving ease of access, and keep the door apertures free of soiling as well as increasing protection in a side impact. All-round protective claddings divide the overall proportions and emphasise the vehicle's off-road character, as does the simulated underride guard at the front and rear.\n \n\"Its iconic design lends the Mercedes-Benz GLB an unmistakable SUV character\", says Gorden Wagener, Chief Design Officer at Daimler AG. \"The clear forms with reduced lines and powerful surfaces conveys our design philosophy of Sensual Purity.\"\n \nWith aluminium details: the interior design\n \nThe instrument panel consists of a single piece, which has optical cut-outs in the driver and front passenger area. The driver faces a widescreen cockpit, with control and display via MBUX (Mercedes-Benz User Experience). A new feature is the characteristic off-road tubular element in an aluminium look which rounds off the lower section of the instrument panel and houses the three round centre air vents. These give the dashboard support an impression of robustness, power and a certain fun factor. Below the nozzles is the air conditioning control panel, whose buttons create the impression that they have been milled from a solid aluminium cylinder.\n \nThe robust character of the interior continues in the centre console. Tubular elements in a machined look lend solidity to the design of the components and controls. Along the doors, the SUV character is underlined by the horizontal grab handle that, from the design and equipment line Progressive upwards, forms a robust part of the door panel structure and resembles a machined aluminium tube.\n \nSpot on for hill and dale: the off-road light function\n \nThe LED High Performance headlamps and MULTIBEAM LED headlamps are available for the Mercedes-Benz GLB on request. The latter allow extremely quick and precise, electronically controlled adjustment of the headlamps to suit the current traffic situation.\n \nAs an option there are also front fog lamps with LED technology. They distribute the light more widely than the main headlamps and thus illuminate peripheral areas better. Their low position in the front bumper helps reduce the risk of dazzling.\n \n4MATIC models include the Off-Road Engineering Package. In combination with MULTIBEAM LED headlamps these models offer a special off-road light function. This makes it easier to see obstacles in rough terrain in the dark. With the off-road light the cornering light on the MULTIBEAM LED headlamps is continuously switched on up to a speed of 50 km/h. This results in wide and bright light distribution immediately in front of the vehicle.\n \nFrom A for Assistance to W for Wearable linking: the technical details\n \nThe GLB benefits from the technical highlights of the current compact-class generation from Mercedes-Benz. These include in particular:\n \n- The four-cylinder petrol and diesel engines, which were completely updated to relaunch the compact model series: Compared to the previous generation, the excel with considerably increased specific outputs, improved efficiency and lower emissions.\n \n- The driving assistance systems with cooperative support for the driver and functionality from the S-Class: thanks to improved camera and radar systems, the GLB can look up to 500 m ahead and can drive partially autonomously in certain situations, for example by conveniently adapting the speed before corners, crossroads or roundabouts using the Active Distance Assist DISTRONIC with recourse to maps and navigation data. As a new function of the Active Steering Assist, among other things, there is also the intuitive Active Lange Change Assist. If the Active Parking Assist with PARKTRONIC is additionally on board, the GLB also has the function extended automatic restart on motorways.\n \n- The comfort suspension: at the front the GLB has McPherson suspension struts, at the rear an acoustically and vibrationally decoupled multi-link axle with compression springs. Adaptive adjustable damping is available on request. With this the driver can change between more comfort or particularly sporty tuning via the DYNAMIC SELECT switch.\n \n- The intuitively operated infotainment system MBUX (Mercedes-Benz User Experience): The powerful computer, brilliant screens and graphics, individualisable depiction, all-colour head-up display, navigation with augmented reality, learning-capable software and the voice control which can be activated with \"Hey Mercedes\" are the key advantages of the system.\n \n- The ENERGIZING comfort control: it networks various comfort systems in the vehicle, and uses musical and lighting moods plus a number of massages for a wide range of feel-good programs. The ENERGIZING COACH recommends these programs according to the situation. If the Mercedes-Benz vivoactive® 3 smartwatch or another compatible Garmin® wearable is linked, personal values such as stress level or sleep quality improve the precision of the recommendation.\n \nShould a tad more traction be called for: the 4MATIC all-wheel drive\n \nOn request the Mercedes-Benz GLB is equipped with the permanent all-wheel system 4MATIC, with fully-variable torque distribution. This sporty all-wheel drive configuration allows the driver to use the DYNAMIC SELECT switch to influence the characteristics of 4MATIC. Three characteristic maps are available to control the all-wheel drive clutch, though the system responds flexibly to the current driving situation in any mode. In regular driving operation, the drive program \"Eco/Comfort\" is based on an 80:20 distribution (front axle:rear axle), while in \"Sport\" it is 70:30. In off-road mode the all-wheel drive clutch acts as an inter-axle differential lock, with the basic distribution a balanced 50:50.\n \n4MATIC components include the power take-off to the rear axle, which is integrated into the automated dual clutch transmission, and the rear axle differential with an integrated multiplate clutch. This is electro-mechanically operated. Via a crown wheel and a ball ramp, an electric motor exerts an axial force on the clutch pack to open or close the plates. The rear axle differential compensates the different paths/rotational speeds of the rear wheels. The advantages of this control system are above all non-rpm-dependent operation across the entire actuation range, pilot control of the clutch while still stationary and higher efficiency thanks to the ball ramp concept.\n \nUseful in easy off-road terrain: the Off-Road Engineering Package\n \nIn addition to off-road light, the Offroad Engineering package has an additional driving mode. It adapts the engine's power delivery and the ABS control to easy off-road terrain away from tarmac roads. It can be activated via the DYNAMIC SELECT switch.\n \nOther elements of the Off-Road Engineering Package:\n \n- An animation of the driving situation can be called up in the media display. The realistic presentation of gradient, inclination angle and technical settings helps the driver to judge manoeuvres correctly.\n \n- The hill-start assistance system Downhill Speed Regulation (DSR) automatically adheres to a preselected, slow speed between approx. 2 and 18 km/h, it can be read out in the instrument cluster and in the optional head-up display. With targeted brake applications the assistant helps retain control during steep downhill driving.\n \nPowerful and efficient: the engines\n \nThe new Mercedes-Benz GLB places its trust in the four-cylinder petrol and diesel engines which were completely updated to relaunch the compact model series. In comparison to the previous generation, they are characterised by significantly increased power, improved efficiency and emissions.\n \nThe gateway to the petrol-model range is the M 282 with a displacement of 1.33 litres in the GLB 200. This engine has cylinder shutoff for efficient operation in the partial-load range.\n \nThe two-litre M 260 engine in the GLB 250 4MATIC has cast-iron cylinder liners in its engine block of diecast aluminium, widening at the lower end as per the CONICSHAPE® principle. In-house the cylinder bore process is descriptively known as \"trumpet-honing\". This minimises piston friction and cuts consumption. In the aluminium four-valve cylinder head, the CAMTRONIC variable valve timing system allows two-stage adjustment of the valve lift on the intake side.\n \nThanks to further extended exhaust gas aftertreatment the two-litre diesel (OM 654q) in the GLB 200 d/GLB 220 d with the 8G-DCT dual-clutch transmission already meets the RDE (Real Driving Emissions) level 2 not obligatory until 2020 and is certified in accordance with Euro 6d.\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nHow much PI will be selling?\nAny specification to take a look?\nWhen will it reaches sg?\n\n \ntotally no pricing yet worldwide. \n \nbut the name suggests it will be priced between GLA and GLC. I could be wrong though\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\ntotally no pricing yet worldwide. \n \nbut the name suggests it will be priced between GLA and GLC. I could be wrong though\n\n \nMercedes Germany config has GLB.\n \nPrice is also there.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Thaiyotakamli",
        "comment": "\n\t\t\t\nWhether it looks better than the 216GT is subjective but unless itâs priced near $160k which I doubt, the BMW will still sell more.Changing to this? Hehehe\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Soundphile",
        "comment": "\n\t\t\t\n\nMercedes Germany config has GLB.\n \nPrice is also there.\nCare to share the link? Don't see it in the line up when I check... \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nCare to share the link? Don't see it in the line up when I check...\n \nIt's classified under Sports Tourer\nhttps://www.mercedes-benz.de/passengercars/content-pool/tool-pages/car-configurator.html/motorization?rccVehicleModelId=2470821\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nMercedes Germany config has GLB.\n \nPrice is also there.\nNo RHD...\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nNo RHD...\n \nThis is a configurator for Germany Market.  Use that to see what's available as option.\n \nBy the way, Configurator for Merc UK is available now.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nThere is no pricing info. Care to share ?\n\nI doubt there is pricing available\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nThere is no pricing info. Care to share ?\nI doubt there is pricing available\n\n \nB180 sports starts from GBP24K\nB180sport.pdf\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 14 by Davidtch\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\tFren, b class is not glb \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "L23",
        "comment": "\n\t\t\t\nB180 sports starts from GBP24K\n     \n     \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nVideo of the new GLB\n \n\n\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\n\nVideo of the new GLB\n \n \n\nNice but Indian guy presentation not so promising \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Alextoh76",
        "comment": "\n\t\t\tUk presentation maybe better.Link removed by mod.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nThe 3rd row do not seems to sit as low as the BMW 2GT.\n\n \nIt size seems the same as GLC (GLB in Red, GLC in Metallic Grey), with a shorter bonnet than the latter too.\nFrom Left to Right: G Glass, GLS, GLE, GLC, GLB and GLA\n\n \nAnd the GLB 250 4MATIC's spec look impressive (especially in consideration that it is 4 wheel driven).\n\n \nThis shall be one of the highly sort after model from the 3 point star, once it hit our shore. Anytime a >3 months waiting list...\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Freeder",
        "comment": "\n\t\t\t\nFren, b class is not glbLuckily, he’s not a car dealer..Later , also hantam got Vsex insai.. scary..\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Testdrive2011",
        "comment": "\n\t\t\t\n\nThe 3rd row do not seems to sit as low as the BMW 2GT.\n\n \nIt size seems the same as GLC (GLB in Red, GLC in Metallic Grey), with a shorter bonnet than the latter too.\nFrom Left to Right: G Glass, GLS, GLE, GLC, GLB and GLA\n\n \nAnd the GLB 250 4MATIC's spec look impressive (especially in consideration that it is 4 wheel driven).\n\n \nThis shall be one of the highly sort after model from the 3 point star, once it hit our shore. Anytime a >3 months waiting list...\n\n \nlooks to have more space at the back too\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "titarium",
        "comment": "\n\t\t\t\nHow's the feedback on A-Class's performance & Drive ? \n \nBasically is a JV engine , if driving A class with 4 Pax is ok , then current judgement 2 Pax on GLB 200 is ok . \n \nGood news is Road Tax and COE Cat = A Class ! \n \nBring in price can benchmark against UK model , just need to be patient to watch up the launch price and work the ratio then it should be around there. \n \nYet there's rumor that it would be pricier than GLC, but not sure how true can that be. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mkl22",
        "comment": "\n\t\t\t\n\nThe 3rd row do not seems to sit as low as the BMW 2GT.\n\n \nIt size seems the same as GLC (GLB in Red, GLC in Metallic Grey), with a shorter bonnet than the latter too.\nFrom Left to Right: G Glass, GLS, GLE, GLC, GLB and GLA\n\n \nAnd the GLB 250 4MATIC's spec look impressive (especially in consideration that it is 4 wheel driven).\n\n \nThis shall be one of the highly sort after model from the 3 point star, once it hit our shore. Anytime a >3 months waiting list...\nI would think easily a 6mth or more waiting list. Mexico plant for worldwide. China plant only for China. \nHow's the feedback on A-Class's performance & Drive ? \n \nBasically is a JV engine , if driving A class with 4 Pax is ok , then current judgement 2 Pax on GLB 200 is ok . \n \nGood news is Road Tax and COE Cat = A Class ! \n \nBring in price can benchmark against UK model , just need to be patient to watch up the launch price and work the ratio then it should be around there. \n \nYet there's rumor that it would be pricier than GLC, but not sure how true can that be.\nCatA? Where got catA? Less than 130bhp meh?\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 22 by Mkl22\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nMy guess:\n \nGLB200 5 seater likely priced between GLA and GLC\nGLB250 7 seater to be priced along side or higher than GLC\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nHow's the feedback on A-Class's performance & Drive ? \n \nBasically is a JV engine , if driving A class with 4 Pax is ok , then current judgement 2 Pax on GLB 200 is ok . \n \nGood news is Road Tax and COE Cat = A Class ! \n \nBring in price can benchmark against UK model , just need to be patient to watch up the launch price and work the ratio then it should be around there. \n \nYet there's rumor that it would be pricier than GLC, but not sure how true can that be.\n\nThis car COE category is in Cat B due to the >130hp\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nMy guess:\n \nGLB200 5 seater likely priced between GLA and GLC\nGLB250 7 seater to be priced along side or higher than GLC\n\nU could be right but C&C would be missing a great chance to volume sell if they don’t bring in GLB200 7 seater. Unfortunately this GLB200 will be in COE Cat B otherwise it would sell even more. \n \nThe success of the BMW 2GT is due to the low price n being in Cat A which unfortunately this GLB is unlikely to match but there is still a market for premium 7 seater at reasonable price n even more so as it’s been reported that BMW will not be coming out with a new model for the 2GT. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mkl22",
        "comment": "\n\t\t\t\n\nU could be right but C&C would be missing a great chance to volume sell if they donât bring in GLB200 7 seater. Unfortunately this GLB200 will be in COE Cat B otherwise it would sell even more. \n \nThe success of the BMW 2GT is due to the low price n being in Cat A which unfortunately this GLB is unlikely to match but there is still a market for premium 7 seater at reasonable price n even more so as itâs been reported that BMW will not be coming out with a new model for the 2GT.\nNo more mercs in CatA liao. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Alextoh76",
        "comment": "\n\t\t\tSpore gets this.Link removed by mod.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "titarium",
        "comment": "\n\t\t\t\n\nU could be right but C&C would be missing a great chance to volume sell if they don’t bring in GLB200 7 seater. Unfortunately this GLB200 will be in COE Cat B otherwise it would sell even more.\n \nThe success of the BMW 2GT is due to the low price n being in Cat A which unfortunately this GLB is unlikely to match but there is still a market for premium 7 seater at reasonable price n even more so as it’s been reported that BMW will not be coming out with a new model for the 2GT.\n\n \nOver look on HP keep thinking of comparison against BMW 2GT, no chance for Cat A , but with Cat A doubt the drive would be nice .\n \nlooking of what had been share with current COE the price expected for GLB 200 would be :\nPI : 160-170 k\nC&C : 175 - 190 k \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nThe 3rd row do not seems to sit as low as the BMW 2GT.\n\n.\n\nYes looks definitely higher than the BMW 2GT. Sitting higher means better thigh support which is important esp for adults\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Tohto",
        "comment": "\n\t\t\t\n\nU could be right but C&C would be missing a great chance to volume sell if they don’t bring in GLB200 7 seater. Unfortunately this GLB200 will be in COE Cat B otherwise it would sell even more. \n \nThe success of the BMW 2GT is due to the low price n being in Cat A which unfortunately this GLB is unlikely to match but there is still a market for premium 7 seater at reasonable price n even more so as it’s been reported that BMW will not be coming out with a new model for the 2GT.\n\nIf Cat with less than 130bhp, so under power how to drive.\nNo fun at all.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nIf Cat with less than 130bhp, so under power how to drive.\nNo fun at all.\n\nThe BMW 216GT diesel version is only 116hp but torque is 270nm n with that torque, its a good drive in local conditions as the instant torque enables quick take off from standstill n this also enables easy overtaking and confident changing of lanes. Don’t need high hp in our local roads for most cars anyway esp MPVs. \n \nI’m not sure of the petrol version of the GT which has even lower hp n torque but so far not heard complaints yet.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Tohto",
        "comment": "\n\t\t\t\n\nThe BMW 216GT diesel version is only 116hp but torque is 270nm n with that torque, its a good drive in local conditions as the instant torque enables quick take off from standstill n this also enables easy overtaking and confident changing of lanes. Don’t need high hp in our local roads for most cars anyway esp MPVs. \n \nI’m not sure of the petrol version of the GT which has even lower hp n torque but so far not heard complaints yet.\n\nDiesel is different, torque is high.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nNoticed no rear seat aircon vents. \n \nThe GLB250 same or similar engine output as the GLC250. But 0-100 about 0.2-0.3s faster.. Think is due to the 8DCT. Should be very drivable in SG traffic. \n \n\nThe 3rd row do not seems to sit as low as the BMW 2GT.\n\n \nIt size seems the same as GLC (GLB in Red, GLC in Metallic Grey), with a shorter bonnet than the latter too.\nFrom Left to Right: G Glass, GLS, GLE, GLC, GLB and GLA\n\n \nAnd the GLB 250 4MATIC's spec look impressive (especially in consideration that it is 4 wheel driven).\n\n \nThis shall be one of the highly sort after model from the 3 point star, once it hit our shore. Anytime a >3 months waiting list...\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\tA class has A180d that fits Cat A COE.  But need to pay extra $500 road tax\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nThe current generation m274 petrol engine is very drivable in city traffic like ours. \n \n\n \nThis is the A 250 power torque graph, but they use the same engine across their 250s range. \n \nThe max peak torque arrives very early just slighy before 1800rpm (in a way very diesel-like early peak torque) and remains flat all the way to 4000rpm (unlike diesel, the torque band is wider and the hp climbs higher at higher speed) . Depending on the drive mode, the gear would have upshifted by 3000-4000rpm...so during acceleration, you will always be in the power band sweetspot. The smooth shifting 9 speed with close ratio helps keep the rev within the power band. \nIt will be interesting to see if the 8DCT can match or overtake the 9speed auto in terms of smoothness and reliability. \n \nAt licence losing speed of 180-200, the engine is also willing to rev further and overtaking is not laborous. \n \nI am pretty impressed with merc 4 pot turbo performance to be frank... Coming from a subaru 2.5 4 pot turbo previously. \n \nThe BMW 216GT diesel version is only 116hp but torque is 270nm n with that torque, its a good drive in local conditions as the instant torque enables quick take off from standstill n this also enables easy overtaking and confident changing of lanes. Don’t need high hp in our local roads for most cars anyway esp MPVs.I’m not sure of the petrol version of the GT which has even lower hp n torque but so far not heard complaints yet.\n \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 23 by Vratenza\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\nThe current generation m274 petrol engine is very drivable in city traffic like ours. \n \n7587083.jpg\n \nThis is the A 250 power torque graph, but they use the same engine across their 250s range. \n \nThe max peak torque arrives very early just slighy before 1800rpm (in a way very diesel-like early peak torque) and remains flat all the way to 4000rpm (unlike diesel, the torque band is wider and the hp climbs higher at higher speed) . Depending on the drive mode, the gear would have upshifted by 3000-4000rpm...so during acceleration, you will always be in the power band sweetspot. The smooth shifting 9 speed with close ratio helps keep the rev within the power band. \nIt will be interesting to see if the 8DCT can match or overtake the 9speed auto in terms of smoothness and reliability. \n \nAt licence losing speed of 180-200, the engine is also willing to rev further and overtaking is not laborous. \n \nI am pretty impressed with merc 4 pot turbo performance to be frank... Coming from a subaru 2.5 4 pot turbo previously. \n\n \nGLB is using a newer version of the M270 (transverse) / M274 (longitude), code name M260 (transverse).\n \nThe two-litre M 260 engine in the GLB 250 4MATIC (combined fuel consumption 7.4-7.2 l/100 km, combined CO2 emissions 169-165 g/km)1 has cast-iron cylinder liners in its engine block of diecast aluminium, widening at the lower end as per the CONICSHAPE® principle. In-house the cylinder bore process is descriptively known as \"trumpet-honing\". This minimises piston friction and cuts consumption. In the aluminium four-valve cylinder head, the CAMTRONIC variable valve timing system allows two-stage adjustment of the valve lift on the intake side.\n \nTo further minimise piston friction and lower fuel consumption, the cylinder bore is widened at the lower end of the cylinder liners. The resulting, conical shape resembles the mouth of a trumpet. An innovative low-friction oil and optimised piston rings also reduce friction losses. To take account of the higher specific output, the pistons themselves feature cooling ducts. This also ensures more efficient combustion. The balance shafts for smooth engine-running are located in the lower section of the crankcase.\n \nAlso new in the aluminium four-valve cylinder head of the two-litre engine is CAMTRONIC, a variable valve timing system that allows two-stage adjustment of the valve lift on the intake side of the valve assembly. In the partial-load range, this variable valve lift adjustment allows less air to be fed to the combustion chamber with a smaller valve lift, which leads to lower gas cycle losses. In higher load ranges the system switches to the higher valve lift to achieve the engine's full power delivery.\n \nMultiple fuel injection ensures optimum combustion despite the smaller valve lift. This compensates the reduced turbulence of the fuel/air mixture in the combustion chamber in the area of the spark plug. The four-cylinder has direct injection with latest-generation piezo injection valves. The position of the injectors has been optimised to achieve low cylinder wall coverage and therefore lower untreated emissions, especially particulate emissions. A particulate filter is included as standard. Thanks to optimised injection with partial valve lift, the engine runs even more quietly in wide operating ranges. A low level of exhaust emissions has been achieved by further development of the well-proven BlueDIRECT combustion system in conjunction with the standard petrol particulate filter.\n \nThe single-pipe turbocharger features an electronically controlled wastegate valve. The previously vacuum-operated actuator has been replaced by a precision electrical actuator, which reports its position and has a higher actuating speed, so that charge pressure control and diagnosis are significantly improved. This allows charging to be more precisely controlled.\n \nThe oil circuit is supplied with engine oil on a demand basis. Sensors monitor the oil pressure so that the supply volume can be adjusted. The cooling circuit has an electronically controlled thermostat which allows the engine temperature to be optimally set to suit needs.\n \nTo make engine operation more comfortable, a new centrifugal damper has been introduced into the powertrain as an addition to the balance shafts. This improves the engines NVH characteristics and allows comfortable driving possible at lower rpm. The exhaust system with flap control has the same purpose.\n \nThe engine is configured for front-wheel drive and 4MATIC all-wheel drive, and combined with the 8G-DCT dual clutch transmission. The M 260 engine is produced by the Kölleda plant.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heartlander",
        "comment": "\n\t\t\t\nAnother excellent detail review done by Thomas. He is about 1.9m tall and he can fit in just nice in all 3 rows by adjusting the middle row, though getting into 3rd row is abit difficult.\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Douglam",
        "comment": "\n\t\t\t\nYes looks definitely higher than the BMW 2GT. Sitting higher means better thigh support which is important esp for adultsðNot hard to achieve. The 3rd row seats in the 2GT is probably one of the lowest seats I've ever seen in a car. Well...other than the front seats in supercars. Lol.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Hrh",
        "comment": "\n\t\t\tWonder how will it be priced here considering it is based on A class chasis\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nNot hard to achieve. The 3rd row seats in the 2GT is probably one of the lowest seats I've ever seen in a car. Well...other than the front seats in supercars. Lol.\nActually most mid sized n SUV MPVs have this low sitting stance for the 3rd row unlike full size MPVs but this GLB seems the exception so it’s definitely a plus point. \n \nIt has to be low otherwise the roof will have to be higher n that means a boxy shape. I guess u can’t have it both ways ie low stance with a sleeker roofline or higher stance with a boxy n higher roofline. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heman75",
        "comment": "\n\t\t\t\n\nActually most mid sized n SUV MPVs have this low sitting stance for the 3rd row unlike full size MPVs but this GLB seems the exception so it’s definitely a plus point.\n \nIt has to be low otherwise the roof will have to be higher n that means a boxy shape. I guess u can’t have it both ways ie low stance with a sleeker roofline or higher stance with a boxy n higher roofline.\n\nthe key now is how is cnc going to price this model.. almost same size as GLC. will it be cheaper like below 200k? or more expensive than GLC. if price cheaper then GLC will bein trouble...and this GLB has some form of GLK \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nthe key now is how is cnc going to price this model.. almost same size as GLC. will it be cheaper like below 200k? or more expensive than GLC. if price cheaper then GLC will bein trouble...and this GLB has some form of GLKI also mentioned before price is the key factor esp in Singapore.  \nHierarchy wise it shld be priced between GLA n GLC but will it? 7 seater thus being more practical than GLC might cause it to be priced at GLC price or perhaps even more but then again GLB has an entry level 1.3l so it can n shld be priced lower than GLC which would mean below $200k at today’s prices. Just my thoughts. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nBasically the 5 seater GLB200 will be priced between GLA and GLC based on 5 seats arrangement comparison. \n \n7 seater pricing will be interesting.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nFrom these photos, the boxier GLB look much like a smaller GLS, than close sibling to the GLC. Just look at rear window and the C-pillar. And can also confirm that the bonnet is shorter than the GLC (which translate to more interior space), thanks to the transverse engine layout. \n\n \n\n \n\n \n \n\n \n\n \n\n \n \n\n \n\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nDoes it looks like X class?\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\nDoes it looks like X class?\nyou so bad  \n \nx class also 200+ not cheap leh  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Inlinefour",
        "comment": "\n\t\t\t\n\nBasically the 5 seater GLB200 will be priced between GLA and GLC based on 5 seats arrangement comparison.\n \n7 seater pricing will be interesting.\n\n \nextra 2 seat will be under additional equipment and accessories options \n \nthus RRP can be much lower  \n \nPS. features in/on test or showroom cars may not be standard  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nyou so bad  \n \nx class also 200+ not cheap leh  \n\n \nX class can be a more than 7 seater car.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nI am going to predict...... GLB will take over GLC in the PI market. \n \nCurrently on the road/carpark, for every 10 GLCs I see, 7comes from PI. 2 main factors, price and availability. \nC&C single Ad's allocation cannot fight PI sourced from dealers all over UK/HK. \n \nAfter experiencing C&C's level of service for the past 2 years of ownership, I would have taken the chance and gone PI route  (saving a pretty penny) if I am to do it all over again. \n \n \nI also mentioned before price is the key factor esp in Singapore.Hierarchy wise it shld be priced between GLA n GLC but will it? 7 seater thus being more practical than GLC might cause it to be priced at GLC price or perhaps even more but then again GLB has an entry level 1.3l so it can n shld be priced lower than GLC which would mean below $200k at today’s prices. Just my thoughts.\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nI am going to predict...... GLB will take over GLC in the PI market. \n \nCurrently on the road/carpark, for every 10 GLCs I see, 7comes from PI. 2 main factors, price and availability. \nC&C single Ad's allocation cannot fight PI sourced from dealers all over UK/HK. \n \nAfter experiencing C&C's level of service for the past 2 years of ownership, I would have taken the chance and gone PI route  (saving a pretty penny) if I am to do it all over again.\n\nWhen the GLC was launched by C&C, there was at least a 6-9mth waiting list if I remember correctly. This worked 2 ways as this created a hype over the car due to the anticipation of getting your hands on it n it’s as if u strike lottery if u could get it first but then the PIs came in n their waiting time was much faster n slowly the euphoria died down esp as the GLC coupe also came along. \n \nAnyway, if the principal does the same thing n allocates small numbers here then history would repeat itself n majority will go PI again. This car has the potential to sell well here esp with the imminent exit of the BMW GT so C&C has to play their card right but I just sense they or maybe it’s the principal doesn’t seem bothered. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Heman75",
        "comment": "\n\t\t\t\nwill there be a GLB43AMG?\n \n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "TangoElite",
        "comment": "\n\t\t\t\nwill there be a GLB43AMG?\n \n \n35 yes, 43/45 not sure.\n\nI am going to predict...... GLB will take over GLC in the PI market. \n \nCurrently on the road/carpark, for every 10 GLCs I see, 7comes from PI. 2 main factors, price and availability. \nC&C single Ad's allocation cannot fight PI sourced from dealers all over UK/HK. \n \nAfter experiencing C&C's level of service for the past 2 years of ownership, I would have taken the chance and gone PI route  (saving a pretty penny) if I am to do it all over again. \n\n \nwhats wrong with C&C service\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 25 by TangoElite\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\nwill there be a GLB43AMG?\n \nGLB45\n \n43 will be phased out soon.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nWhen the GLC was launched by C&C, there was at least a 6-9mth waiting list if I remember correctly. This worked 2 ways as this created a hype over the car due to the anticipation of getting your hands on it n it’s as if u strike lottery if u could get it first but then the PIs came in n their waiting time was much faster n slowly the euphoria died down esp as the GLC coupe also came along.\n \nAnyway, if the principal does the same thing n allocates small numbers here then history would repeat itself n majority will go PI again. This car has the potential to sell well here esp with the imminent exit of the BMW GT so C&C has to play their card right but I just sense they or maybe it’s the principal doesn’t seem bothered.\n\n \nProduction will start from Autumn in a new factory.  Hopefully the production projection will be much more accurate.\n \nSince we have a small market, it will be in the list of least important market.\n \nLikely to be demand more than supply again\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nProduction will start from Autumn in a new factory.  Hopefully the production projection will be much more accurate.\n \nSince we have a small market, it will be in the list of least important market.\n \nLikely to be demand more than supply again\nUnfortunately, that’s true that we are insignificant to demand more units.  \nThat said, C&C shld put some pressure on principal for more allocation even if it maybe futile. I seldom see PML having this issue on allocation so wonder why this seems to be a Benz issue?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nUnfortunately, that’s true that we are insignificant to demand more units.\n \nThat said, C&C shld put some pressure on principal for more allocation even if it maybe futile. I seldom see PML having this issue on allocation so wonder why this seems to be a Benz issue?\n\n \nIt might be BMW Asia more hungry.  BMW sales is lagging behind Merc.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Sunny",
        "comment": "\n\t\t\t\npersonally, i find GLB too boxy for my liking.  other than that, it looks rugged on the outside, nice on the inside.\nGLC SUV hits sweet spot between GLB and GLC Coupe \n \nnot many would go 7 seater SUV like mazda cx9, xc90, audi q7, xtrail, etc if frequent ferrying >5pax\nif so...go for MPV is better option i feel.  \n \nshould GLB priced similar as GLC SUV, maybe can sell better than latter (for the extra space and those who do not mind boxy look). additional choice for buyers  \n \n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nThose A class platform based AMGs will have 35/45 moniker\n \nThose C class and above platform AMGs will still keep to 43/63 moniker. \n \nDon't ask me whet though.... \n \n\nGLB45\n \n43 will be phased out soon.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nThose A class platform based AMGs will have 35/45 moniker\n \nThose C class and above platform AMGs will still keep to 43/63 moniker. \n \nDon't ask me whet though.... \n\n \n43 will be phased out gradually.\n \nReplaced by 53.\n \nFWD platform will be 35/45\n \nRWD platform will be 53/63.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nTheir modus operandi is any errors or warranty claim, do software reflash or update... Repeat it  until one bangs table... Then they change the part....\n \nClaim warranty for door trim corrosion not due to wear and tear, had to threaten lawsuit then they agree on repair \"out of good will\"... Even repair took 3 attempts for a simple panel.... 1st attempt, waited for 1mth for the part, send car in... Called me tell me that the part is blemished.. \nSo cannot install... Send my car back... \n2nd attempt, after another month of wait, fixed  but took 1 whole day... Collected... They did not fit the speaker grill properly onto the panel.... Had to call to complain. \n3rd attempt, had to send in again to fix it... \n \nThis kind of service I think any ah beng workshop can do better. \n \n\n \n35 yes, 43/45 not sure.\n \nwhats wrong with C&C service\n \n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nOh thanks! I stand corrected. \n \nI had the impression we are talking about X3 vs X5. \n \nThanks for the info! \n \n\n43 will be phased out gradually.\n \nReplaced by 53.\n \nFWD platform will be 35/45\n \nRWD platform will be 53/63.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nMercedes-AMG GLB 45 Spied For The Very First Time\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nEngine spec can take reference from here:\n \nMercedes-AMG Most Powerful 4 Cylinders Engine\n \n\n \n\nLook for this engine in the A45, CLA 45, and GLB 45 in the near future.\n \nMercedes-AMG finally announces the official specs for its new 2.0-liter turbocharged four-cylinder engine that goes under the internal designation M 139. In the higher-spec S trim, the mill offers 416 horsepower (310 kilowatts) and beats the previous-gen A45 with 375 hp (280 kW) to take the title as world's most powerful factory-offered four-cylinder engine ever available in a production vehicle.\n \n\nSpecifically, the S version of the M 139 makes 416 hp at 6,750 rpm and 500 Newton-meters of torque between 5,000 and 5,250 rpm. The redline hits at 7,200 rpm.\n\n \n\nThere's also a standard variant of the M 139 that produces 382 hp at 6,500 rpm and 480 Newton-meters between 4,750 and 5,000 rpm. The redline is the same 7,200 rpm.\n\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "L23",
        "comment": "\n\t\t\t\n\n \nMercedes-AMG GLB 45 Spied For The Very First Time\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nEngine spec can take reference from here:\n \nMercedes-AMG Most Powerful 4 Cylinders Engine\n \n\n \n\nLook for this engine in the A45, CLA 45, and GLB 45 in the near future.\n\nMercedes-AMG finally announces the official specs for its new 2.0-liter turbocharged four-cylinder engine that goes under the internal designation M 139. In the higher-spec S trim, the mill offers 416 horsepower (310 kilowatts) and beats the previous-gen A45 with 375 hp (280 kW) to take the title as world's most powerful factory-offered four-cylinder engine ever available in a production vehicle.\n\nSpecifically, the S version of the M 139 makes 416 hp at 6,750 rpm and 500 Newton-meters of torque between 5,000 and 5,250 rpm. The redline hits at 7,200 rpm.\n\nThere's also a standard variant of the M 139 that produces 382 hp at 6,500 rpm and 480 Newton-meters between 4,750 and 5,000 rpm. The redline is the same 7,200 rpm.\nLook like a old forester to me\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mkl22",
        "comment": "\n\t\t\t\n\nTheir modus operandi is any errors or warranty claim, do software reflash or update... Repeat it  until one bangs table... Then they change the part....\n \nClaim warranty for door trim corrosion not due to wear and tear, had to threaten lawsuit then they agree on repair \"out of good will\"... Even repair took 3 attempts for a simple panel.... 1st attempt, waited for 1mth for the part, send car in... Called me tell me that the part is blemished.. \nSo cannot install... Send my car back... \n2nd attempt, after another month of wait, fixed  but took 1 whole day... Collected... They did not fit the speaker grill properly onto the panel.... Had to call to complain. \n3rd attempt, had to send in again to fix it... \n \nThis kind of service I think any ah beng workshop can do better. \n\n \nyou are probably lucky in the 3 attempts to fix it, hopefully they dont accidentally break something else... then cycle starts again.\n \nwhich is why i'm very weary of local ADs, none of them can get it right.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nyou are probably lucky in the 3 attempts to fix it, hopefully they dont accidentally break something else... then cycle starts again.\n \nwhich is why i'm very weary of local ADs, none of them can get it right.\nYou are spot on! Something else will prop out and it’s never ending with all the time waiting. Sometimes I am wondering if they do all these on purpose to deter u from returning for the slightest problem? Lol\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Alextoh76",
        "comment": "\n\t\t\t\n35 spotted.\n \nLink removed by mod.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "GoodCar",
        "comment": "\n\t\t\t\nTo be a volume seller, price level is important so unless this GLB is priced to sell, it wont be their best seller in my opinionAgree. If the price is right, I will consider it. Else I will stick to my plan to stick to a Jap/Korean brand to last till retirement. Singapore car price is really crazy and often underspec when compare to other countries.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Lala81",
        "comment": "\n\t\t\t\n\npersonally, i find GLB too boxy for my liking.  other than that, it looks rugged on the outside, nice on the inside.\nGLC SUV hits sweet spot between GLB and GLC Coupe \n \nnot many would go 7 seater SUV like mazda cx9, xc90, audi q7, xtrail, etc if frequent ferrying >5pax\nif so...go for MPV is better option i feel.  \n \nshould GLB priced similar as GLC SUV, maybe can sell better than latter (for the extra space and those who do not mind boxy look). additional choice for buyers  \n\n \nI don't like the look either. \nBut if the pricing is not too far off, it will sell like hotcakes lah. It's a merc afterall  \nAgree. If the price is right, I will consider it. Else I will stick to my plan to stick to a Jap/Korean brand to last till retirement. Singapore car price is really crazy and often underspec when compare to other countries.\n \nprice differential very huge leh.\njap/korean suv/crossover vs merc proper sized crossover/suv (GLB and above)\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t@alextoh76 please stop promoting your FB group, else your account will be locked! Take this as the final warning!!\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "titarium",
        "comment": "\n\t\t\tAre all GLB will be manufacture in Mexico ? \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nAre all GLB will be manufacture in Mexico ?\n \nFrom the official press release, yes.\n \nThe new GLB is manufactured at the Aguascalientes (Mexico) plant and, for the Chinese market, in Beijing.\n \n \n \nMercedes-AMG GLB 35 Spied Hiding The Obvious\n \n* For those interested, GLB 35 will be using the M 260 engine (same as GLB250, but tuned up to deliver 306 horsepower), while GLB 45 (and GLB 45S) will be using the newly developed M 139 engine, which is good for up to 416 horsepower.\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nThe AMG lite version of the new GLB compact crossover will probably debut in the months to come.\n \nThe first one to come will be the GLB 35 caught on camera again while undergoing testing ahead of a world reveal likely to take place before the end of the year. Having seen the standard GLB and knowing how AMG upgrades the cars for the “35” spec, it’s easy to imagine what is hiding underneath the heavy camouflage. The big air intakes up front are already peeking through the camo, while the dual exhausts at the back further reveal it’s not a regular GLB.\n \nStretching out at the Green Hell, the compact crossover tuned in Affalterbach was riding low thanks to a stiffer suspension setup and also appeared to have bigger brakes to complement the upgraded engine. Speaking of which, a 2.0-liter four-cylinder will deliver 302 horsepower and 295 pound-feet (400 Newton-meters) to both axles with help from a dual-clutch, seven-speed automatic transmission.\n \nAs far as performance is concerned, we are estimating the 0-62 mph (0-100k kph) task will take roughly five seconds to complete and top speed is likely to be electronically governed at 155 mph (250 kph). For an even faster version, the already spotted GLB 45 likely due in 2020 will up the power ante to as much as 416 hp and 369 lb-ft (500 Nm) in the flagship GLB 45 S. These \"45 S\" models from Mercedes' compact car lineup will feature the world's most powerful four-cylinder ever installed in a regular production vehicle.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "titarium",
        "comment": "\n\t\t\t\nAd direct import from Mexico \n \nPI will be from HK / UK ? \n \nBeing manufactured in Mexico will it be having lower OMV. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Davidtch",
        "comment": "\n\t\t\t\n\nAd direct import from Mexico\n \nPI will be from HK / UK ?\n \nBeing manufactured in Mexico will it be having lower OMV.\n\n \nWishful thinking\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Vratenza",
        "comment": "\n\t\t\t\nLower OMV does not translate to lower selling price. Ask PML/Wearnes\n \nWishful thinking\n \n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited June 29 by Vratenza\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nThe first batch of production is LHD for the US market. \n \nUK will be second. PI Shld be getting from UK. From website, pre-order starts July 2019. Already collecting interest in June. Hopefully there will be some pricing indication next month. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Fuelsaver",
        "comment": "\n\t\t\t\nLook like a old forester to meVery Subaru-ish and low ground clearance.. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Sunny",
        "comment": "\n\t\t\t\nDimensions comparison with between GLB vs GLC (not so much with GLA)\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nMercedes-AMG GLB Loses Camo\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nMercedes-Benz debuted its new GLB-Class in early June, but we have a bit longer to wait until the high-performance AMG variant arrives. However, with the GLB’s squarish shape officially revealed to the world, camouflage is falling from AMG GLB 45. This prototype was caught up close near the Nürburgring during a fuel stop, and our spy team wasn’t shy about getting a close look.\n \nTechnically speaking, we can’t say for certain whether this is the GLB 45 or the lesser-powered GLB 35. Ordinarily, we’d be able to tell the difference with a quick look at the rear, where a set of quad exhaust tips would reveal this as the 45. There are only two exhaust outlets on this SUV, though they obviously aren’t standard-issue GLB 35 tips. The wheels don’t help either, as we’ve seen the GLB 35 riding on spokes like these, and on black five-star wheels captured on camera with a GLB 45 prototype.\n \nUltimately, both muscle SUVs will have a similar appearance on the outside with tweaks to the front and rear fascias, and of course the trademark grille. Upgraded brakes and suspension will also be part of the AMG makeover, but the real difference comes under the hood. The GLB 35 should get the same 2.0-liter turbocharged four-pot that powers the AMG A35, generating 302 horsepower (225 kilowatts), and actually, the GLB 45 will probably have the 2.0-liter as well. It will be tuned considerably higher though, possibly up to 416 hp (310 kW) as found in the A45 S. At the very least, it should offer 383 hp (286 kW), which would still be enough to give this compact seven-seater plenty of thrust.\n \nWe’ve heard nothing official from Mercedes on when the AMG-tuned GLB models will debut. With the base model out and about right now, logic says the GLB 35 should arrive sometime later this year, possibly in September or even sooner. The GLB 45 should land either very late this year, or more likely, early in 2020.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "GoodCar",
        "comment": "\n\t\t\t\n\nI don't like the look either. \nBut if the pricing is not too far off, it will sell like hotcakes lah. It's a merc afterall  \n \n \nprice differential very huge leh.\njap/korean suv/crossover vs merc proper sized crossover/suv (GLB and above)\nYou are right loh, Price differential is high. But there was a saying, a man must have one of the B in his life. \nWell, when the time come, hope my left and right brain can fight it out and draw a decisive decision.\n \nBoh Bian ah, our car price here three time of others....:)\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Lala81",
        "comment": "\n\t\t\t\n\nYou are right loh, Price differential is high. But there was a saying, a man must have one of the B in his life.\n \nWell, when the time come, hope my left and right brain can fight it out and draw a decisive decision.\n \nBoh Bian ah, our car price here three time of others....:)\nGlc also being refreshed. But minor changes with mbux system also coming in. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Angcheek",
        "comment": "\n\t\t\t\nLower OMV does not translate to lower selling price. Ask PML/Wearnes\n \nthats true , Nothing beats Long waiting time    OMV is nothing \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "GoodCar",
        "comment": "\n\t\t\t\nSome queries\n \nGLB is front wheel drive with compact car MFA2 platform\nGLC is rear wheel drive with class see platform\n \nIs their NVH comparable？some say C is the ”real” entry to real MB......any insight from any folks here?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nupzzzzzzzzzzz\n \nany updates on pricing? I heard UK started pre-order (for RHD models). Any news on others? be it LHD or RHD?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\nSeems like the price of GLB will really sit right in-between the GLA & GLC... or to put things in perspective, GLB250 (7 seater) will be price around that of GLC200 (5 seater). \n \nFor those that are keen and can read German, the full details (in PDF file) can be found on Mercedes-Benz (Germany) website.\n \nMercedes-Benz GLB Launches With Attractive Starting Price In Europe\n \n\n \nThe Mercedes-Benz GLB will arrive in showrooms at the end of the year, but the company is currently accepting orders in Germany, where it’s offered with a choice of six powertrains, from €37,746.80 ($42,293).\n \nIn comparison, the more urban- and hatch-like GLA starts at € 30,333.10, while the larger GLC, from € 46,237.45 in Merc’s home market. In America, the respective starting MSRPs for the two models are $33,950 for the GLA and $40,700 for the GLC.\n \nBuilt on the same basic underpinnings as the new A-Class, albeit bigger to offer more passenger room and the option of a third row of seats, suitable for occupants up to 1.68 meters (about 5.6ft) in height, the boxy GLB technically rivals the Audi Q3 and BMW X1. However, the base X1 is available from €32,700 ($36,639), whereas the 2020 Q3 starts at €38,600 ($43,249).\n \nThe only petrol engines available are the 163 PS (161 hp / 120 kW), 1.3-liter in the GLB 200 and 224 PS (221 hp / 165 kW), 2.0-liter in the GLB 250 4Matic.\n \n\nThe diesel lineup is more generous, being offered in GLB 180d, GLB 200d, GLB 200d 4Matic and GLB 220d 4Matic guises. Pricing ranges between €37,770.60 ($42,320) and €44,601.20 ($49,973). These models share the same 2.0-liter power unit between them, which churns out 116 PS (114 hp / 85 kW) and 280 Nm (207 lb-ft) of torque in the most affordable variant, and 150 PS (148 hp / 110 kW) and 320 Nm (236 lb-ft) in the mid-range grades. The 220d 4Matic has 190 PS (187 hp / 140 kW) and 400 Nm (295 lb-ft).\n \nModels packing the 4Matic all-wheel drive system have the standard Offroad Engineering Package, with Downhill Speed Regulation, an extra driving mode and additional off-road light. Elsewhere, you can spec your GLB with a wide range of options, including LED headlights and fog lamps, 360-degree camera system, head-up display, Burmester premium audio, heated steering wheel. Several packages, like the Business, Driving Assistance, Night and Start, with the latter being offered until the end of the year, are also on the list.\n \nAdditionally, Mercedes-Benz is offering the GLB Edition 1 for a €9.044 ($10,133) premium, with 20-inch alloy wheels with opal orange rim flanges, bahia brown interior with coral red topstitching and walnut wood with coral red pattern.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\nI find it interesting that the 1.3l petrol has a much faster 0-100 than the 2l diesel. The hp of the 1.3l is much higher than the diesel but the diesel’s torque is slightly higher. \n \nJust my opinion but I think from standstill, the diesel may have enough to overtake the petrol who will undoubtedly be the quicker car after say 80-100m?\n \nAnd with the above, some points for consideration are:\n1) 0-100 numbers must be taken in the context of local driving conditions. I know of some car owners who swear by 0-100 but I believe these nos. are only appropriate in racing conditions not day to day driving. \n2) so much for the saying “there’s no replacement for displacement”\n \nI know it’s not a very Apple to Apple comparison between a petrol v diesel as engine characteristics are different but just soliciting opinions. \n \nAgree? Or are my assumptions flawed?\nOpen to discussion tks!\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Atachi",
        "comment": "\n\t\t\t\n\nI find it interesting that the 1.3l petrol has a much faster 0-100 than the 2l diesel. The hp of the 1.3l is much higher than the diesel but the dieselâs torque is slightly higher. \n \nJust my opinion but I think from standstill, the diesel may have enough to overtake the petrol who will undoubtedly be the quicker car after say 80-100m?\n \nAnd with the above, some points for consideration are:\n1) 0-100 numbers must be taken in the context of local driving conditions. I know of some car owners who swear by 0-100 but I believe these nos. are only appropriate in racing conditions not day to day driving. \n2) so much for the saying âthereâs no replacement for displacementâ\n \nI know itâs not a very Apple to Apple comparison between a petrol v diesel as engine characteristics are different but just soliciting opinions. \n \nAgree? Or are my assumptions flawed?\nOpen to discussion tks!\nYeah. Someone mentioned Torque is > Hp in SG driving. There is only so much you can sprint before meeting the red light. With greater torque the “burst” of power and pull more shiok over here. \n0-100 as provided by the manufacturers are a good gauge but take it with a grain of salt. The types of tyres, humidity, etc. Then there are some manufacturers that like to +/- secs off their 0-100 timings.\n\n\n\t\t\t\n\t\t\t\t\n\n\n\tEdited August 14 by Atachi\n\t\n\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Adrianli",
        "comment": "\n\t\t\t\n\nI find it interesting that the 1.3l petrol has a much faster 0-100 than the 2l diesel. The hp of the 1.3l is much higher than the diesel but the diesel’s torque is slightly higher. \n \nJust my opinion but I think from standstill, the diesel may have enough to overtake the petrol who will undoubtedly be the quicker car after say 80-100m?\n \nAnd with the above, some points for consideration are:\n1) 0-100 numbers must be taken in the context of local driving conditions. I know of some car owners who swear by 0-100 but I believe these nos. are only appropriate in racing conditions not day to day driving. \n2) so much for the saying “there’s no replacement for displacement”\n \nI know it’s not a very Apple to Apple comparison between a petrol v diesel as engine characteristics are different but just soliciting opinions. \n \nAgree? Or are my assumptions flawed?\nOpen to discussion tks!\n\nI truly believe in 0-100 timing especially for our start-stop traffic. Downgraded from a 7s car to a 14s car. It really is a struggle. Even my fren taking a lift from my car ask me to stop torturing the 14s car. Car engine roar very loud but speed is not there.\n \n0-100 timing roughly lets you gauge how fast you can merge with expressway traffic, make a successful quick right turn, zoom out from slip road while traffic lights for oncoming traffic turns green or simply overtaking or undertaking.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "jk228b",
        "comment": "\n\t\t\tAm genuinely excited about the GLB..probably until Cycle ridiculously markup the price of the car lol\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\nPricing:\n \nGlb200 7 seater RHD. Available only Feb 2020\n \nSport: $122k + CoE\nAMG line: $128k + CoE \nAMG line premium: $138k + CoE\nAMG line premium plus: $148k + CoE \n \nSpecs and comparison join my Whatsapp group. I will share the pdf\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\nPricing:\n \nGlb200 7 seater RHD. Available only Feb 2020\n \nSport: $122k + CoE\nAMG line: $128k + CoE \nAMG line premium: $138k + CoE\nAMG line premium plus: $148k + CoE \n \nSpecs and comparison join my Whatsapp group. I will share the pdf\nU got this from C&C or PI?Have a feeling this is PI price. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\n\nI find it interesting that the 1.3l petrol has a much faster 0-100 than the 2l diesel. The hp of the 1.3l is much higher than the diesel but the diesel’s torque is slightly higher.\n \nJust my opinion but I think from standstill, the diesel may have enough to overtake the petrol who will undoubtedly be the quicker car after say 80-100m?\n \nAnd with the above, some points for consideration are:\n1) 0-100 numbers must be taken in the context of local driving conditions. I know of some car owners who swear by 0-100 but I believe these nos. are only appropriate in racing conditions not day to day driving.\n2) so much for the saying “there’s no replacement for displacement”\n \nI know it’s not a very Apple to Apple comparison between a petrol v diesel as engine characteristics are different but just soliciting opinions.\n \nAgree? Or are my assumptions flawed?\nOpen to discussion tks!\n\n \n \ni think seeing how those older 2l sonata taxi accelerate from standstill can be good gauge.\ndiesel engine deals with weight better than similar sized petrol engine.\n \nI have owned 13s, 10s and 7s car. but i never outrun them from standstill to like 50m. maybe my driving style is more relaxed. but i'm quite sure i have to step the gas quite hard to match them. \n \nof cos, at higher speed, diesel engine can feel out of breath, cos they cannot rev as high as petrol engine\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\ni think seeing how those older 2l sonata taxi accelerate from standstill can be good gauge.\ndiesel engine deals with weight better than similar sized petrol engine.\n \nI have owned 13s, 10s and 7s car. but i never outrun them from standstill to like 50m. maybe my driving style is more relaxed. but i'm quite sure i have to step the gas quite hard to match them. \n \nof cos, at higher speed, diesel engine can feel out of breath, cos they cannot rev as high as petrol engine\nThat’s the gist of my point actually.  \nOn paper some of the 0-100 can look impressive but as u have rightfully pointed out, u might still not be able to outrun a lesser 0-100 car at least for the start as its torque that determines this. I know there will be some that say can’t compare petrol v diesel which is true also but point is don’t be seduced by the 0-100 numbers. \nI’m sure the Sonata taxi 0-100 will be nowhere near your 10s, 7s nos. \n \nThe other point was that all the big hoo ha on displacement is not really true in modern day engines which can be tuned to get higher output. Of course the old school guys will disagree on this.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\n\nThat’s the gist of my point actually.\n \nOn paper some of the 0-100 can look impressive but as u have rightfully pointed out, u might still not be able to outrun a lesser 0-100 car at least for the start as its torque that determines this. I know there will be some that say can’t compare petrol v diesel which is true also but point is don’t be seduced by the 0-100 numbers.\nI’m sure the Sonata taxi 0-100 will be nowhere near your 10s, 7s nos.\n \nThe other point was that all the big hoo ha on displacement is not really true in modern day engines which can be tuned to get higher output. Of course the old school guys will disagree on this.\n\nhaha there is a debate is another tread on NA vs TC. fact is in today's emission conscious world, big cc NA engine is losing its place\n \nya 0-100kmh is just one gauge. some even compared 0-50kmh and quarter mile timing\n \nbut for our daily drive, normal road car....i think these figures don't matter much\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nU got this from C&C or PI?\nHave a feeling this is PI price.\n\nyes self import price.\n \nC&C i think at least $20k more on top of PI price going by the current trend \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\nhaha there is a debate is another tread on NA vs TC. fact is in today's emission conscious world, big cc NA engine is losing its place\n \nya 0-100kmh is just one gauge. some even compared 0-50kmh and quarter mile timing\n \nbut for our daily drive, normal road car....i think these figures don't matter much\n\n \nI have had an NA 8.9s car and turbo 8.9s car. but when driving, the turbo one just feels a lot more pull and shiok!! but go up genting the turbo car overheat\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SZ_ford",
        "comment": "\n\t\t\t\nI have had an NA 8.9s car and turbo 8.9s car. but when driving, the turbo one just feels a lot more pull and shiok!! but go up genting the turbo car overheat\n \ni guess your tc engine has smaller cc but more torque\n \nya i agree on the shiokness. recently i drove a 2l na after years of driving tc, just not used to the lack of response\n \nwait are we digressing?? haha\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\ni guess your tc engine has smaller cc but more torque\n \nya i agree on the shiokness. recently i drove a 2l na after years of driving tc, just not used to the lack of response\n \nwait are we digressing?? haha\n\nturbo is the way to go! yes more torque. small cc 1.4 250Nm.\nSomemore when full load, the NA totally cmi.\nturbo still can go, no problem. but overheat if keep boosting (genting)\n \n1.6NA. 125hp, 160Nm\n1.4T. 150hp, 250Nm\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "TangoElite",
        "comment": "\n\t\t\t\n\n\tNew GLB-Class, slotting in between GLA and GLC \n\n\n\n\tAlso the first 7 seater compact for Mercedes. \n\n\n\n\t \n\n\n\n\tAMG GLB35 version below\n\n\n\n\t306hp, 400Nm @ 3krpm, 0-100 in a \"slow\" 5.2 Secs, 4matic, DCT-8G\n\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carbon82",
        "comment": "\n\t\t\t\n\n\tMercedes-Benz GLB35 AMG 4Matic\n\n\n\n\t\n\n\n\t\n\n\n\tWith its passionate, striking design, great practicality and dynamics and space for up to seven occupants, the new Mercedes-AMG GLB35 4MATIC is an unrivalled alternative in the compact SUV segment. The turbocharged 2.0-litre four-cylinder engine develops 225 kW (306 hp) and guarantees impressive driving enjoyment in combination with the AMG SPEEDSHIFT DCT 8G transmission and variable AMG Performance 4MATIC all-wheel drive (acceleration from 0-100 km/h in 5.2 seconds). Not to mention the advantages of an SUV: raised seating position, plenty of space for passengers and luggage, and well-balanced off-road performance.\n\n\n\n\t\"With the new GLB35 4MATIC we are extending our product portfolio by adding a highly attractive model for an active target group that attaches special importance to versatility. This also includes the optional seven-seater capability of our new compact SUV, though without having to sacrifice the genes typical of an AMG. Because in its segment, our GLB35 likewise fulfils our brand promise of Driving Performance,\" says Tobias Moers, CEO of Mercedes-AMG GmbH.\n\n\n\n\tResponsive and emotive: the AMG 2.0-litre 4-cylinder in-line turbocharged engine\n\n\n\n\tThanks to a twinscroll turbocharger, the 2.0-litre turbocharged engine rated at 225 kW (306 hp) impresses with great responsiveness to movements of the accelerator pedal, high torque (max. 400 Nm from 3000 rpm) and great liveliness. The crankcase made of high-strength, lightweight die-cast aluminium reduces the vehicle weight where it matters most for driving dynamics. The exhaust turbocharging combines optimum responsiveness at low engine speeds with a strong power increase at higher speeds.\n\n\n\n\tThe high technological level is also confirmed by CAMTRONIC variable valve control for low fuel consumption. Intelligent thermal management ensures a faster and more efficient warm-up of the engine and oil. And the compact piezo injectors deliver fuel extremely precisely for increased efficiency.\n\n\n\n\tFast and agile: AMG SPEEDSHIFT DCT 8G dual clutch transmission\n\n\n\n\tThe transmission masters fast gearshifts and a sporty driving style just as well as comfort-oriented gearshifts for relaxed long-distance journeys. During upshifts, partial ignition interruption produces an impressive sound experience, while the double-declutch function during downshifts benefits gearshifting comfort. The function synchronises the engine and transmission speeds, minimises unwanted gas cycle responses and stabilises the vehicle, for example when braking ahead of bends. This also supports a particularly dynamic driving style.\n\n\n\n\tThe new Mercedes-AMG GLB35 4MATIC displays its full sprint potential with the RACE START function included as standard. Higher engine rpm when starting off, in combination with optimised shift points, produces the best possible traction and maximum acceleration. RACE START remains active while the accelerator is kept fully depressed.\n\n\n\n\tDriving pleasure to the power of five: AMG DYNAMIC SELECT and AMG DYNAMICS\n\n\n\n\tThe five AMG DYNAMIC SELECT drive programs - Slippery, Comfort, Sport, Sport+ and Individual, make for a very variable driving experience with a wide range from serene comfort to agile and sporty. The programs modify key parameters, such as the response of the engine, transmission, suspension and steering.\n\n\n\n\t- The new \"Slippery\" drive program is optimised for low-grip road conditions, with reduced power and a flat torque curve. Smooth gear changes, earlier upshifts and the ECO start/stop system support the stability-focused driving impression.\n\n\n\n\t- The \"Comfort\" program stands for comfortable and fuel-efficient driving, for example thanks to very early upshifts. Suspension and steering are set up with an emphasis on comfort, the ECO start/stop system is active.\n\n\n\n\t- \"Sport\" and \"Sport+\" place the focus on agility and driving pleasure with sporty engine and transmission tuning. The ECO start/stop system is deactivated.\n\n\n\n\t- The \"Individual\" drive program enables the individual parameters to be selected and saved according to personal preferences. In addition, the gliding function is available in the \"Reduced\" and \"Moderate\" drive settings.\n\n\n\n\tThe driving modes are linked to the AMG DYNAMICS agility control, which means that the handling characteristics can be even more closely matched with different requirements and driving conditions.\n\n\n\n\tIn the GLB35 4MATIC, AMG DYNAMICS has the agility functions \"Basic\" and \"Advanced\", and their functionalities are automatically activated by the relevant drive program. Relevant parameters such as the torque distribution of the all-wheel drive system, the steering characteristics or the intervention thresholds of the completely newly developed ESP® (Electronic Stability Program) are intelligently adapted according to the drive program.\n\n\n\n\t- \"Basic\" is assigned to the \"Slippery\" and \"Comfort\" drive programs. In this case the GLB35 4MATIC has extremely stable handling with a high level of yaw damping.\n\n\n\n\t- \"Advanced\" is activated in the \"Sport\" program. The GLB35 4MATIC is then neutral and well-balanced. The lower level of yaw damping, reduced steering angles and increased agility support a dynamic driving style - for example on winding country roads.\n\n\n\n\tOptimum traction: variable AMG Performance 4MATIC all-wheel drive\n\n\n\n\tThe performance-oriented all-wheel drive system continuously ensures the best possible ratio of dynamism, traction and efficiency. A multi-disc clutch with AMG-specific electromechanical control allows a variable torque split which can be instantly changed according to the driving situation. This ranges from purely front-wheel drive to a 50:50 percent distribution to the front and rear axle, for example during dynamic driving manoeuvres or on snow or ice. The influencing factors for torque distribution are not only the driving speed, the lateral and longitudinal acceleration and the steering angle, but also the difference in rotational speed between the individual wheels and the gear selected.\n\n\n\n\tThe all-wheel drive is regulated depending on the selected stage of the 3-stage Electronic Stability Program ESP® - from safety-oriented yet sporty to highly dynamic. The 4ETS dynamic handling control system further enhances handling safety and agility, in particular on slippery surfaces or on surfaces with different friction coefficients. It uses brake interventions to keep individual driven wheels from spinning when starting off or accelerating. At the same time the differential locking effect enables the drive torque to be shifted to the wheels that are not spinning.\n\n\n\n\tFor high lateral dynamics and long-distance comfort: the suspension\n\n\n\n\tThe AMG suspension is tuned for high cornering speeds with a low tendency to roll. This allows the dynamic potential of the GLB35 4MATIC to be fully realised. The high reserves at the critical limits guarantee sheer driving pleasure - while the vehicle remains safe and predictable at all times. The complete redesign of all wheel-guiding components such as the steering knuckles and transverse control arms at the front axle, as well as the model-specific subframe and the wheel carriers at the rear axle, assist even more direct steering and increase the lateral dynamics. At the same time the suspension developers at Mercedes-AMG took care to maintain a balanced level of long-distance comfort.\n\n\n\n\tFull control: speed-sensitive power steering and a high-performance brake system\n\n\n\n\tThe electromechanical, speed-sensitive power steering has a variable ratio and impresses with its precise and authentic feedback. The steering servo assistance is reduced at high speeds, and continuously increases at lower speeds. This means that comparatively little steering force is required at low speeds, while the best possible control over the vehicle is maintained at high speeds. Depending on which drive program the driver has selected, it provides taut and sporty or more comfortable steering feedback.\n\n\n\n\tThe AMG high-performance brake system with silver brake callipers and black AMG lettering at the front is a worthy counterpart to the powerful drive system. Deceleration is finely controllable, with high fade-resistance even under heavy stress. This is ensured for example by the large brake discs, which are internally ventilated and perforated all-round. The front axle is fitted with 4-piston fixed callipers and cast iron brake discs in size 350 x 34 mm, while the rear axle has 1-piston floating callipers and cast iron brake discs in size 330 x 22 mm.\n\n\n\n\tDesign: hallmark AMG expressiveness with personalisation potential\n\n\n\n\tBased on the AMG Line, the new GLB35 4MATIC is distinguishable by further model-specific design features. The AMG-specific radiator grille is used for the first time in a 35-series model, and emphasises membership of the AMG family. The front splitter, the prominent rear apron with two round, single tailpipe trim elements and the AMG roof spoiler in the vehicle colour also guarantee a high recognition factor.\n\n\n\n\tThe 19-inch AMG 5-twin-spoke light-alloy wheels painted in tantalum grey with a high-sheen finish and the AMG high-performance brake system with silver brake callipers and black AMG lettering at the front provide further visual highlights. Three further wheel variants from 19 to 21 inches are available on request, each in two colours.\n\n\n\n\tThe optional AMG Night package with design features such as the front splitter and rear apron trim in high-gloss black, plus black chrome-plated exhaust tailpipe trim elements, provides eye-catching highlights. Because depending on the chosen paint finish, the result is strong contrasts or flowing transitions.\n\n\n\n\tSporty and highly individualisable interior\n\n\n\n\tMembership of the AMG family is visually underlined by the sport seats upholstered in black ARTICO man-made leather/DINAMICA microfibre with red double topstitching and red seat belts. Two optional Leather packages with a choice of two-tone upholstery, for example in classic red/black, and topstitching on the beltline and dashboard, enhance the interior even further.\n\n\n\n\tWith AMG-specific displays: the MBUX infotainment system\n\n\n\n\tThe innovative control and display concept MBUX creates an even closer bond between the vehicle, driver and passengers. At the same time the latest version of the infotainment system contributes to the great day-to-day suitability of the new GLB35 4MATIC. Emotive displays such as the particularly striking Supersport mode with a central, round rev counter and bargraph-style driver information underline the exclusivity.\n\n\n\n\tWhether it's operated with the touchpad, Touch Control buttons on the steering wheel, by voice control or gesture control: the control concept is both versatile and flexible. Thanks to the innovative voice control - activated with the keyword \"Hey Mercedes\" - the AI software recognises and understands practically all commands common in infotainment and vehicle control - even when spoken indirectly.\n\n\n\n\tWith the three AMG-specific display styles \"Classic\", \"Sporty\" or \"Supersport\", the vehicle functions are directly visualised on the left side of the instrument cluster and in the touchscreen display on the right. Visually, the two displays under one shared glass cover blend into a Widescreen Cockpit and as a central element consequently emphasise the horizontal orientation of the interior design.\n\n\n\n\tObey any command: multifunction sports steering wheel\n\n\n\n\tThe multifunction sports steering wheel in nappa leather ensures first-class ergonomics and intuitive operation. The steering wheel rim with a flattened bottom section, perforated leather in the grip area and red contrasting topstitching is both attractive and pleasant to the touch. The galvanised steering wheel gearshift paddles allow an even sportier driving style with manual gear shifting.\n\n\n\n\tThe optional AMG Performance steering wheel and accompanying AMG steering wheel buttons are visibly and tangibly configured for performance. This allows fast and confident operation of specific dynamic functions - for a focussed, concentrated and performance-oriented driving style.\n\n\n\n\tTwo more passengers with the optional third seat row\n\n\n\n\tThe new GLB35 4MATIC is the first compact car by Mercedes-AMG to be optionally available with a third seat row consisting of two additional individual seats, plus fore-and-aft adjustment of the second seat row and the EASY-ENTRY feature. The second seat row has a 40:60 split. The seats in the third row accommodate passengers up to a height of 1.68 metres in comfort. The seats can be lowered so that they are flush with the load compartment floor in order to extend the load compartment.\n\n\n\n\tConvenience features in the third row include two drink holders between the seats and two stowage compartments with rubber-lined inserts on the left and right in the load compartment panelling. Each of these is fitted with a USB charging socket. The extensive safety equipment underlines the high day-to-day suitability. It consists of extendable head restraints, seat belts with belt tensioners and belt force limiters, a window airbag that also protects the passengers in the third seat row, and i-Size/ISOFIX and Top-Tether anchorages for suitable child seats.\n\n\n\n\tEven more dynamism: the AMG RIDE CONTROL suspension\n\n\n\n\tThe optionally available AMG RIDE CONTROL suspension guarantees superior performance. The adaptive, electronically controlled damping provides a wide range of setups from comfortable to very sporty. The damping is adjusted individually for each wheel, and depends on the driving style, the road surface and the selected suspension setting.\n\n\n\n\tThe best possible operating point is always selected on the basis of numerous data such as acceleration or vehicle speed. The suspension characteristics are modified by simply selecting one of the drive programs Comfort, Sport or Sport+.\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Icetrap",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 8/14/2019 at 10:50 AM, Spring said:\n\t\n\n\t\n\t\t\n\t\t\tI find it interesting that the 1.3l petrol has a much faster 0-100 than the 2l diesel. The hp of the 1.3l is much higher than the diesel but the diesel’s torque is slightly higher.\n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tJust my opinion but I think from standstill, the diesel may have enough to overtake the petrol who will undoubtedly be the quicker car after say 80-100m?\n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tAnd with the above, some points for consideration are:\n\t\t\n\n\t\t\n\t\t\t1) 0-100 numbers must be taken in the context of local driving conditions. I know of some car owners who swear by 0-100 but I believe these nos. are only appropriate in racing conditions not day to day driving.\n\t\t\n\n\t\t\n\t\t\t2) so much for the saying “there’s no replacement for displacement”\n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tI know it’s not a very Apple to Apple comparison between a petrol v diesel as engine characteristics are different but just soliciting opinions.\n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tAgree? Or are my assumptions flawed?\n\t\t\n\n\t\t\n\t\t\tOpen to discussion tks!\n\t\t\n\t\n\n\n\n\tI hear that there is a chatgroup. Can I be added into it? \n\n\n\n\t \n\n\n\n\tI have 5 friends who are keen on this car. \n\n\n\n\t \n\n\n\n\tAdd me. 90705 seven four five \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Spring",
        "comment": "\n\t\t\t\n\n\t\n\t\t4 hours ago, Icetrap said:\n\t\n\n\t\n\t\t\n\t\t\tI hear that there is a chatgroup. Can I be added into it? \n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tI have 5 friends who are keen on this car. \n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tAdd me. 90705 seven four five \n\t\t\n\t\n\n\n\n\tSorry I’m not aware of any chat group for GLB. \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 9/1/2019 at 11:34 AM, Icetrap said:\n\t\n\n\t\n\t\t\n\t\t\tI hear that there is a chatgroup. Can I be added into it? \n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tI have 5 friends who are keen on this car. \n\t\t\n\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tAdd me. 90705 seven four five \n\t\t\n\t\n\n\n\n\t5 frens can group buy liao... our group chat 4 pax. adding u in..\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "flashbang",
        "comment": "\n\t\t\t\n\tStarting from 122k at PI? That's too cheap...\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Angcheek",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 9/1/2019 at 4:15 PM, Spring said:\n\t\n\n\t\n\t\t\n\t\t\tSorry I’m not aware of any chat group for GLB. \n\t\t\n\t\n\n\n\n\t \n\n\n\n\tIcetrap is gal or guy ? gal I add 😂\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Old-driver",
        "comment": "\n\t\t\t\n\n\t\n\t\t53 minutes ago, flashbang said:\n\t\n\n\t\n\t\t\n\t\t\tStarting from 122k at PI? That's too cheap...\n\t\t\n\t\n\n\n\n\tCOE not included probably.\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "titarium",
        "comment": "\n\t\t\t\n\tAdd me as well at 9386 Five x2 Nine x2 \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "BanCoe",
        "comment": "\n\t\t\t\n\n\t\n\t\t8 hours ago, Angcheek said:\n\t\n\n\t\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tIcetrap is gal or guy ? gal I add 😂\n\t\t\n\t\n\n\n\n\tU like Venus fly trap😜😜\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "flashbang",
        "comment": "\n\t\t\t\n\n\t\n\t\t11 hours ago, Old-driver said:\n\t\n\n\t\n\t\t\n\t\t\tCOE not included probably.\n\t\t\n\t\n\n\n\n\tThat would make sense... another 40k on top.\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\n\t\n\t\t14 hours ago, Angcheek said:\n\t\n\n\t\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tIcetrap is gal or guy ? gal I add 😂\n\t\t\n\t\n\n\n\n\tspoke to him on whatsapp liao. he mentioned wife request 7 seater. so he is a male\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\n\t\n\t\t15 hours ago, flashbang said:\n\t\n\n\t\n\t\t\n\t\t\tStarting from 122k at PI? That's too cheap...\n\t\t\n\t\n\n\n\n\tthe PI i spoke to did not quote COE because COE is unknown when the 7 seater model delivers in May 2020 (earliest)\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "LinusLoh_1967",
        "comment": "\n\t\t\t\n\n\t\n\t\t36 minutes ago, Carer said:\n\t\n\n\t\n\t\t\n\t\t\tthe PI i spoke to did not quote COE because COE is unknown when the 7 seater model delivers in May 2020 (earliest)\n\t\t\n\t\n\n\n\n\t122k without coe is still super cheap! Lol!\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Angcheek",
        "comment": "\n\t\t\t\n\n\t\n\t\t15 hours ago, BanCoe said:\n\t\n\n\t\n\t\t\n\t\t\tU like Venus fly trap😜😜\n\t\t\n\t\n\n\n\n\t \n\n\n\n\tyes ...... never miss any great opportunity . \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Icetrap",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 9/2/2019 at 6:28 PM, Angcheek said:\n\t\n\n\t\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tIcetrap is gal or guy ? gal I add 😂\n\t\t\n\t\n\n\n\n\tLol\n\n\n\n\t \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Icetrap",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 8/15/2019 at 9:57 AM, Carer said:\n\t\n\n\t\n\t\t\n\t\t\t \n\t\t\n\n\t\t\n\t\t\tI have had an NA 8.9s car and turbo 8.9s car. but when driving, the turbo one just feels a lot more pull and shiok!! but go up genting the turbo car overheat\n\t\t\n\t\n\n\n\n\tThis is torque. A lot of people talk about HP, but the pushing factor is always Torque.\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Thaiyotakamli",
        "comment": "\n\t\t\t\n\n\t\n\t\t2 hours ago, Icetrap said:\n\t\n\n\t\n\t\t\n\t\t\tThis is torque. A lot of people talk about HP, but the pushing factor is always Torque.\n\t\t\n\t\n\n\n\n\tThats why diesel car feel more punchy\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Joyer",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 9/2/2019 at 2:54 PM, Carer said:\n\t\n\n\t\n\t\t\n\t\t\t5 frens can group buy liao... our group chat 4 pax. adding u in..\n\t\t\n\t\n\n\n\n\tCan you please also add me? Thx 9626 zero six zero eight. \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\tAdded\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Bigcat",
        "comment": "\n\t\t\t\n\n\t\n\t\tOn 9/16/2019 at 3:56 PM, Carer said:\n\t\n\n\t\n\t\t\n\t\t\tAdded\n\t\t\n\t\n\n\n\n\tCan you please add me too? Nine seven 3 2 eight nine 7 0. Many thanks!\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carer",
        "comment": "\n\t\t\t\n\tadded.. pls intro yourself.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SGCMmooomooo",
        "comment": "\n\t\t\t\n\tPls add too. 93 65 20 25\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "SGCMmooomooo",
        "comment": "\n\t\t\t\n\n\tThere is also a new Facebook group.\n\n\n\n\thttps://www.facebook.com/groups/371508383488114/\n\n\n\n\t\t\t\n\t\t"
    }
]