[
    {
        "userid": "Marcz",
        "comment": "\n\t\t\t\n\n \n\n \n\n \nMercedes-Benz CLS 350 / CLS 500 \nEngine 3,498cc V6 / 4,966 cc V8 \nGearbox 7-speed automatic \nMax power 272hp@6,000rpm / 306hp@5,600rpm \nMax torque 350Nm@2,400-5,000rpm/ 460Nm@2,700-4,250rpm \n0-100 kmh 7.0secs / 6.1secs \nTop Speed 250kmh \n \n \nAny comments about this car?  \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Leslielai",
        "comment": "\n\t\t\tIs it just me or does it look like the Cefiro?  \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Lala81",
        "comment": "\n\t\t\t\nmercedes is gd if u lock the steering wheel \n \n\ndoubt u see more than a few of these here anyway. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Joyce",
        "comment": "\n\t\t\tdo you own that car\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Seansene",
        "comment": "\n\t\t\tLooks like an overgrown banana \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "XLR8",
        "comment": "\n\t\t\tFrom the side view it looks like a Rover cum Jaguar cum BMW 7 series hybrid.  \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Redeel",
        "comment": "\n\t\t\t\nFirst pic looks just like a Cefiro!\n \neddie\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Assassin",
        "comment": "\n\t\t\tDont quite like the looks of this one. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Carmour",
        "comment": "\n\t\t\t\nI think Mercedes usually look much better in real-life than in pictures.\n \nThe pictures don't have the \"grand\" look. \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Jonnybravo",
        "comment": "\n\t\t\t\ni totally agree with Carmour... the glamour and class to this car is undisputable. There's this touch of class to this vehicle that makes it so different. even when compared to the current W220 platform, i still think the new CLS is a much better choice although it's thought to be of a lower range among the 2. It just drags the car away from the \"Tow Kay\" image of Benz. Think it would attract young executive (make that RICH young executives) who have been favouring BMW over Mercedes Benz.\n \nAll in all, that's a car i would want to step out of, preferably infront of a crowd.lol  \n \n(except the Maclaren SLR.   )\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Potheader",
        "comment": "\n\t\t\tAgree!  \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Assassin",
        "comment": "\n\t\t\tThink that applies for all cars too. \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Accenture",
        "comment": "\n\t\t\tyucks...and it does look like the new Cefiro\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Ocleansb",
        "comment": "\n\t\t\t\nThe CLS a class of it own and has beautiful curves which at present hardly can find any makers with the design.\n\nAnyway , CLS350 costs S$279K from C&C, not cheap also, again, for Towkay to drive.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Nullifi3d",
        "comment": "\n\t\t\t5 year old thread dude.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Cerano",
        "comment": "\n\t\t\t\ndigger ah.\n \n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "denisoei",
        "comment": "\n\t\t\t\nI love it ! great and awesome car! \n\n\n\n\n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Hamburger",
        "comment": "\n\t\t\tgreat car but sub standard photography with the wrong focus.  \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mercury1",
        "comment": "\n\t\t\t3rd pic background is that  Capella? \n\n\t\t\t\n\t\t"
    },
    {
        "userid": "denisoei",
        "comment": "\n\t\t\tNo  its at Kult Kafe  Mount Emily\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nNew CLS coming...\n \nhttps://www.motor1.com/news/186107/mercedes-cls-spied-almost-undisguised/\n \n\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Volvobrick",
        "comment": "\n\t\t\tIf they do a shooting brake again, it would be extremely tempting...\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "Mercury1",
        "comment": "\n\t\t\t\nThanks dude, might check it out one day\n \nNo  its at Kult Kafe  Mount Emily\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "camrysfe",
        "comment": "\n\t\t\t\nIf they do a shooting brake again, it would be extremely tempting...No more shooting brake liao.\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "camrysfe",
        "comment": "\n\t\t\t\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\nFront looks like a sad face.\n \t2018 Mercedes-Benz CLS leaks online ahead of LA revealhttps://www.autocar.co.uk/car-news/motor-shows-la-motor-show/2018-mercedes-benz-cls-leaks-online-ahead-la-reveal\n \nImages of the next-generation Mercedes-Benz CLS have leaked online one day before it is officially revealed at the LA motor show.\n\nThe upcoming Audi A7 and Porsche Panamera rival's new, sharper design and more luxurious E-Class-like interior, with which the CLS is technically linked, can be seen in the photos.\nFirst-ride: 2018 Mercedes CLS pre-production car\nThe leaked images first landed on Australian site Motoring and came with mention of Mercedes's 3.0-litre straight-six engine being added to the CLS range.\nAutocar can confirm that this engine will also be used as part of a hybrid drivetrain for AMG's first 53 model, called the CLS 53. AMG boss Tobias Moers confirmed in LA that \"The 53 nomenclature will feature on AMG models which only use petrol-electric hybrid powertrains\", with the CLS 53 being the first when it arrivces at the Detroit motor show in January. He said the car will have 429bhp.\nAutocar understands that this electrified model will become the new range-topper, spelling the end of the V8-engined Mercedes-AMG CLS 63, which makes way for the AMG GT four-door (read on for more).\nWhat we already know\nPrior to the leak, Autocar revealed that the new CLS will grow beyond the 4940mm length, 1880mm width and 1420mm height of the outgoing second-generation CLS, which has been on sale since 2010.\n\nCLS Project Leader Michael Kelz has recently divulged to Autocar during a prototype CLS drive that the third-generation model has a drag coefficient of 0.27. This is somewhat short of the 0.23 of the latest E-Class, though it is said to be achieved with near-to-zero lift without the necessity to equip the new model with an active spoiler like that used by Audi on its new second-generation A7.\n\"The big challenge is the CLS's sloping rear end, which remains a key styling characteristic. It hinders efforts to create downforce. To provide a suitable balance between stability and drag, we’ve incorporated some special aerodynamic solutions within the car's undertray,” he said.\nIn the interests of weight saving, the outer body is made predominantly from aluminium, including the bonnet, wheel arches and boot lid. As with the E-Class, though, the four doors are all fashioned from steel.\nMercedes-Benz claims the frameless design of the doors, a design element brought over from the previous two generations of the CLS, brings advantages in refinement, with the rubber sealing around the top of the windows said to offer more aerodynamic properties than that of framed doors.\n“They’re quieter at speed than the doors we use on the E-Class,” said Kelz. “The difference is not great, but our tests have shown there is less buffeting with the frameless design, especially at motorway speeds.”\nMercedes-Benz CLS interior\n\nThe CLS is no longer as uniquely styled nor quite as eye-catching as those found in previous incarnations of the German saloon, which featured their own uniquely styled fascia. \nIn a bid to provide the new model with additional economies of scale with other Mercedes-Benz models in a bid to lower development, component sourcing and production costs, it also receives a lightly reworked version of the latest E-Class’s dashboard, complete with a so-called Widescreen Cockpit with twin 12.3in screens for the instruments and infotainment system.\nThere’s also a new multifunction steering wheel borrowed from the recently facelifted S-Class. The new turbine air vents from the recently introduced E-Class Coupé are also adopted, but, in a first for the CLS, they glow either blue or red depending on the temperature at which the air conditioning is set.\nKelz said: “We have provided it with all the technical features and options already offered on the latest E-Class and S-Class models. This is important in markets such as China, where buyers place a big emphasis on luxury,” he said. “But the CLS is also considered a more sporting alternative to both of them in other markets. In Europe, it’s seen as a driver’s car, and this has played a key role in its development.”    \nIn the rear, there’s now a dedicated centre seat position between two more heavily sculptured positions in a three-across bench. “We’ve received feedback from earlier CLS buyers requesting a fifth seat. Its inclusion is part of our efforts to provide the new model with greater everyday practicality,” says Kelz.\nThe new CLS also benefits from the adoption of a 61mm-longer wheelbase, at 4988mm, with the upshot that there are now larger rear door apertures and, in combination with a corresponding increase in width, more accommodation in the back. Boot space has also increased over the second-generation CLS, Kelz confirmed.\nMercedes-Benz CLS powertrains\n\nWhen the new CLS hits showrooms next year, it will offer a limited range of four and six-cylinder petrol and diesel engines – all in combination with Mercedes-Benz’s 9G-Tronic nine-speed automatic gearbox as standard. Insiders told Autocar that buyers will also get to choose between standard rear-wheel drive or optional 4Matic four-wheel drive on a number of models.\nThe petrol units feature Mercedes-Benz’s new EQ Power system, providing them with mild hybrid properties, relying on a newly developed 48V electric system.\nAs Autocar recently revealed, the line-up will open with the CLS 350. This has the latest evolution of Mercedes-Benz’s M264 petrol engine developing 295bhp and 295lb ft of torque. Next up is the CLS 450, which receives Mercedes-Benz’s new M256 turbocharged and electronically supercharged 3.0-litre in-line six-cylinder petrol engine with 362bhp and 369lb ft.\n\nTopping the petrol line-up, in the absence of plans for a successor to today’s Mercedes-AMG CLS 63. will be the CLS 53. Set to be unveiled at the Detroit motor show in January 2018, this is planned to run an AMG-tuned version of the M256 turbocharged and electronic supercharged 2.9-litre six-cylinder petrol engine used in the CLS 450, with a claimed 429bhp and over 443lb ft.\nAlso planned from the outset of UK sales are a range of diesel models. These start with the CLS 300d, which runs Mercedes-Benz’s existing OM654 designated turbocharged 2.0-litre four-cylinder diesel engine with 228bhp and 332lb ft.\nA more powerful diesel, the new OM656 unit, will also be available. Recently unveiled in the facelifted S-Class, the turbocharged 2.9-litre in-line six-cylinder is set to kick out 282bhp and 443lb ft in the CLS 350d and 335bhp and 516lb ft in the CLS 400d.\nThe CLS will also feature a host of new technology. This includes some of the the semi-autonomous driving technology of the E-Class, including Speed Limit Pilot, which automatically adjusts the speed of the vehicle in relation to posted speed limits, and Active Lane Change Assist, which is able to autonomously perform a lane change when the driver indicates.\nThe infotainment software and menus will all be related to those featured in the E-Class, with the image of the car's interior showing that the dashboard will also feature a near-identical layout for its vents and centre console.\nThe Shooting Brake version of the CLS is expected to be dropped due to low demand; just 750 CLS Shooting Brakes were sold in the UK last year.\n\n \n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "StanleyOng2630",
        "comment": "\n\t\t\tStill like my 1st Gen CLS...\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "StanleyOng2630",
        "comment": "\n\t\t\t\nStill like my 1st Gen CLS...going to upgrade with EuropeCar kits n Android Multimedia Unit..and renew COE...\n\nHow to put photos?\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "DACH",
        "comment": "\n\t\t\t\n\nStill like my 1st Gen CLS...going to upgrade with EuropeCar kits n Android Multimedia Unit..and renew COE...\nHow to put photos?\n\n \nYou can choose files from your computer and attach them.\nThen select them into your post.\n\n\n\t\t\t\n\t\t"
    },
    {
        "userid": "StanleyOng2630",
        "comment": "\n\t\t\t\nMy AMG 4444L (Double Happiness Lucky car). Going to upgrade to NEW AMG Kit soon.\n\n\n\n\n\n\n\n\t\t\t\n\t\t"
    }
]